script_name('FBI Tools')
script_version('2.1')
script_author('Christopher_Lucas')
require 'lib.moonloader'
require 'lib.sampfuncs'
--REQUESTS--
local encoding = require 'encoding'
local sf = require 'sampfuncs'
local key = require "vkeys"
local inicfg = require 'inicfg'
local sp = require 'lib.samp.events'
local sampevents = require 'lib.samp.events'
local dlstatus = require('moonloader').download_status
local bNotf, notf = pcall(import, "imgui_notf.lua")
local lmem, mem  = pcall(require, 'memory')
encoding.default = 'CP1251'
u8 = encoding.UTF8
autoBP = 1
------------
--GLOBALS--
ctag = " FBI Tools {ffffff}|"
rabden = false
check = false
getcode = false
frak = nil
rang = nil
wfrac = nil
local a = 0
local chek = false
warnst = false
ttest = false
changetextpos = false
opyatstat = false
gmegafhandle = nil
gmegafid = nil
gmegaflvl = nil
gmegaffrak = nil
nikk = nil
ttt = nil
tLastKeys = {}
departament = {}
radio = {}
sms = {}
wanted = {}
show = 1
suz = {}
zid = nil
ooplistt = {}
sInfo = {
  updateAFK = 0
}
pInfo = {
  info = {
    day = os.date("%d.%m.%y"),
    dayOnline = 0,
    dayAFK = 0,
    thisWeek = 0,
    dayPM = 0,
    weekPM = 0,
    weekOnline = 0,
    weekWorkOnline = 0,
    dayWorkOnline = 0
  }
}
local config_keys = {
    oopda = { v = {key.VK_F12}}, 
    oopnet = { v = {key.VK_F11}},
    tazerkey = { v = {key.VK_X}},
    fastmenukey = { v = {key.VK_F2}},
    megafkey = { v = {18,77}},
    dkldkey = { v = {18,80}},
    cuffkey = { v = {}},
    followkey = { v = {}},
    cputkey = { v = {}},
    cejectkey = { v = {}},
    takekey = { v = {}},
    arrestkey = { v = {}},
    uncuffkey = { v = {}}
}
local shpt = [[
Пока что вы не настроили шпору.
Что бы вставить сюда свой текст вам нужно выполнить ряд дейтсвий:
1. Открыть папку fbitools которая находится в папке moonloader
2. Открыть файл shp.txt любым блокнотом
3. Изменить текст в нем на какой вам нужен
4. Сохранить файл
]]
local yst = [[
1.0 Общие положения:
1.1 - Устав является общепринятым и обязателен для исполнения всеми сотрудниками SAPD
1.2 - Незнание устава карается увольнением
1.3 - Несоблюдение устава карается увольнением / понижением / выговором / занесением в ЧС / нарядом. 
1.4 - Устав изменяется только Шерифом (при предварительном согласовании) и Директором FBI.

2.0 Основные обязанности сотрудников SAPD:
2.1 - Знать и соблюдать устав SAPD, УК ,АК , Конституцию , правила пользования волной департамента и прочие нормативно-правовые акты Штата SA регулирующие работу PD
2.2 - Поимка преступников на территории юрисдикций всех PD и прилегающих поселков 
2.3 - Исполнять приказы старших по званию/должности
2.4 - Обеспечение безопасности жизнедеятельности граждан
2.5 - Уважительное отношение к гражданам
2.6 - Борьба с нарушениями правил дорожного движения 
2.7 - При необходимости,показать документы утверждающие личность и принадлежность к Полиции. Исключение: SWAT. 
2.8 - Сотрудник SAPD не обязан выполнять приказы солдат из армии (любого звания), других PD. 
Исключение: Сотрудники ФБР, Мэр.
2.9 - Принимать вызовы независимо от обстановки, а также докладывать о выезде на вызов.
2.10 - Докладывать о происшествиях в рацию.В некоторых случаях вызывать помощь. 
2.11 - Объективно оценивать обстановку вокруг себя/на посту.Быть всегда готовым к любому происшествию
2.12- Предупреждать и пресекать попытки граждан совершения Уголовного/Административного правонарушения
2.13 - При получении информации о предстоящем преступлении незамедлительно сообщать в рацию старшим по званию
2.14 - Знать основные положения Правил Дорожного Движения;
2.15 - Перед тем как уйти в AFK доложите о зарядке в рацию и после чего можете отдохнуть в тире.
Исключение:Детективное Бюро в своем кабинете
2.16 - Проводить собеседование для выдачи разрешения на покупку лицензии на оружие.
2.17 - Беспрекословно выполнять приказ старшего по звании, только если он не противоречит уставу.
2.18 - Принимать вызовы от граждан, с звания "сержант" с напарником. Если вызов не больше 1000 метров и адекватен. 


3.0 Сотрудникам SAPD запрещено:
3.1 - Открывать огонь по гражданским. Исключение: в целях самообороны,в погоне после соответствующего предупреждения
3.2 - Пользоваться электрошокером и наручниками без причины.
3.3 - Нарушать правила сервера
3.7 - Выпрашивать и намекать на повышение.
3.8 - Заниматься автоугоном
3.9 - Материться в IC чаты, флудить в рацию, устраивать и провоцировать конфликты, разводить ссору,оскорблять
3.10 - Находиться в выходном более 10 минут в рабочее время - разрешается при одобрении Старшего офицера с доказательствами 
3.12 - Стоять AFK на посту/в патруле (более 120 секунд), стоять AFK в неположенном более 120 сек; Исключение: Старший состав (От Майора и выше), так же Старший состав не имеет права спать более 300 сек в гараже, разрешается в своих кабинетах (так же это разрешено Заместителю, Начальнику и Куратору)
3.13 - Использовать читы / баги сервер,а также использование команд: /cput, /ceject не по делу (в качестве развлечения/насмешек)
3.14 - Употреблять алкоголь в рабочее время
3.15 - Избивать заключенных
3.16 - Стрелять в граждан будучи в "выходном" (исключение - самооборона, с доказательствами)
3.17 - Хранить / употреблять наркотические средства и материалы. 
3.18 - Поставлять посторонним незаконным путём ключи от полицейского участка
3.19 - Бездельничать (находиться в участке без дела более 5 минут).
3.20 - Игнорировать просьбы граждан помочь им, игнорировать/отказывать в просьбе о проведении собеседования на получение лицензии на оружие.
3.21 - Выезжать на вызов одному. 
Исключение: вызов на пост или в другие людные места где запрещены похищения.
3.22 - Запрещено использовать BunnyHop (НонРП бег с помощью прыжков). Карается нарядом в дальнейшем выговором.
3.23 - Запрещено самовольно брать ключ без разрешения Ст.Офицеров.
3.24 - Запрещено носить аксессуары в рабочее время (Искл.: часы, очки,шляпы)
3.25 - Запрещено кататься на личном транспорте средстве (Искл.: От майора и старше; Детективы во время расследований;Начальники и Кураторы отделов)
3.26 - Использование команд таких как /piss в гараже, оружейной и участке, в людных местах - строгий выговор.
3.27 - Запрещено насиловать (/iznas) - понижение.
3.28 - Проявлять любые признаки неадекватного поведения
3.29 - Заниматься личными делами в рабочее время. Исключение: ст. офицеры (Исключение для ст. офицеров: Игра в казино запрещена, покупать недвижимости по государственной цене).
3.30 - Запрещено снимать значок своего отдела 
Исключение: SWAT, ст. офицеры, расследование DB, ADG-9 во время сборов и по разрешению ст. офицера.
3.31 - Запрещено пользоваться диспетчером (/patrul). Исключение: SWAT, ст. офицеры.
3.32 - Проводить патрули/погони в одиночку.
3.33 - Запрещено не обоснованно нарушать Правил Дорожного Движения и Административного правонарушения.
3.34 - Запрещено превышать свои полномочия.


4.0 Сотрудникам SAPD разрешено:
4.1 - Требовать от граждан и должностных лиц прекращения административного или уголовного правонарушения.
4.2 - Доставлять правонарушителей в отделение полиции ( Гараж / КПЗ ).
4.3- Доставлять в отделение полиции лица,подозреваемые в совершенном преступлении.
4.4 - Лишать вод.прав за многочисленное нарушение Административного Кодекса.
4.5 - Осуществлять обыск на призывах, собеседованиях и задержанных преступников. 
4.6 - Останавливать подозрительные Т.С для проверки документов. 
4.7 - Взламывать дверь дома подозреваемого в преступлении.
4.8 - Оцеплять местность для проведения операций по устранению массовых беспорядков.
4.9 - Требовать документы и проводить обыск, подозрительных людей, которые неадекватно себя ведут (Ломка), на употребление наркотических веществ.
4.10 - Сотрудники полиции имеет право потребовать: паспорт, лицензии - которые нарушили Уголовный или Административный кодекс.
4.11 - Сотрудники полиции имеет право потребовать гражданина выйти/слезть из транспортного средства.
4.12 - Сотрудники полиции имеет право потребовать гражданина перепарковать/убрать авто.
4.13 - Сотрудники полиции имеет право потребовать гражданина покинуть местность, если есть риск угрозы здоровья и жизни.

5.0 Правила общения и субординация:
5.1 - Обращение к старшим по званию ведется вежливо и тактично.
5.2 - Сотрудник полиции обязан вежливо общаться с любым жителем штата
5.3 - Здороваясь с старшим по званию / гражданами, полицейский должен говорить “Приветствую”, “Здравствуйте”.
5.4 - При общении с гражданскими сотрудник должен использовать исключительно деловой стиль речи;
5.5 - Запрещено писать транслитом (vot tak)

6.0 Построение:
6.1 - Запрещено общаться во все чаты, во время построения.
6.2 - Запрещено держать оружие в строю
6.3 - Запрещено стрелять из строя (исключение: приказ)
6.4 - Запрещено покидать строй без разрешения или приказа.
6.5 - Запрещено спать в строю (не больше 60 сек AFK). (На Инспекционной проверке от FBI, запрещено уходить вообще в AFK).
6.6 - Запрещено использовать телефон. Исключение: разрешение ст. офицера.
6.7 - Общее построение может проводить Капитан и выше, при необходимости, в отсутствие руководства, строить состав имеет право самый старший офицер на работе.
6.8 - За неявку в строй без уважительной причины - выговор.

7.0 Личные ключи:
7.1- Ключи разрешено брать только с разрешения старшего состава (Майор и выше)
7.2 - Запрещено брать более одного раза ключи. Исключение: потеря (док-ва), кража бандитами(док-ва), изъяли агенты FBI (до-ва).
7.3 - Запрещено брать и использовать ключи в личных целях.
7.4 - Запрещено брать и использовать ключи сотрудникам Академии.
7.5 - Запрещено выносить ключи из участка ( брать ключи в дом ).
7.6 - Запрещено продавать ключи.
7.7 - Запрещено выпускать преступников из КПЗ; содействовать преступникам, намеривающимся совершить побег.
7.8 - Использовать ключи только с целью открыть/закрыть тюремную камеру.

8.0 Увольнительное время:
8.1 График работы:
Время на движение до работы: 10 минут;
[Примечание: За длительное нахождение в выходном, в рабочее время, сотрудник получит выговор за прогул]
Понедельник: 9:00 - 21:00
Вторник: 9:00 - 21:00
Среда: 9:00 - 21:00
Четверг: 9:00 - 21:00
Пятница: 10:00 - 21:00
Суббота: 10:00 - 20:00
Воскресение: 11:00 - 20:00
8.2 Перерыв осуществляется с 13:00 до 14:00 - ежедневно.
8.3 Дежурная смена работает круглосуточно.
8.4 Запрещено прогуливать работу.

9.0 Транспорт SFPD
9.1 - Патрульное авто разрешено брать с звания: офицер.
9.2 - Мотоциклы разрешено брать со звания: Сержант. 
9.3 - Бобики разрешено брать: спец. отряду SWAT и для тренировок, а также для агитаций и сборов на собрания отделов
9.4 - Ранчеры разрешено брать: со звания Сержант
9.5 - Вертолет разрешено брать: Ст. офицерам и спец. отряду SWAT.
9.6 - Патрульное авто с улучшенным двигателем (E-Power на заднем стекле) разрешено брать спец. отряду SWAT.

10.0 Для ст. офицеров
10.1 - Майор и выше имеют право пересекать свободно юрисдикцию.
10.2 - Майоры и выше могут выдавать отгул сотрудникам департамента.
10.3 - Майоры и выше могут в рабочее время заниматься своими делами. Исключение: Играть в казино и заниматься поисками (ловля госов) домов. 
10.4 - Майоры и выше должны подавать пример для остальных сотрудников.
10.5 - Майоры и выше должны в меру своих возможности оказывать помощь сотрудникам.
10.6 - Майор и выше имеет право не предъявлять доказательства нарушения сотрудника. Исключение: Полковникам и Шерифам.
10.7 - Назначение/снятие с должности Кураторов, Начальников, только с согласованием Шерифа.
10.8 - Выдавать наказание ст. офицерам может только Шериф.


ОСНОВНЫЕ ТРЕБОВАНИЯ ДЛЯ КУРАТОРОВ/ НАЧАЛЬНИКОВ/ ЗАМЕСТИТЕЛЕЙ ОТДЕЛОВ

• Следить за отделом в целом.
• Расставлять на посты сотрудников отдела.
• По вступлению нового сотрудника в отдел, объяснить ему, как работает отдел, то есть чем должен заниматься новичок в дальнейшем.
• Соблюдать суббординацию к старшим по званию.
• Всегда присутствовать на повышениях/собраниях.
• Иметь онлайн не менее 3 часов в день по будням, 5 часов и более по выходным.
• Иметь звание не ниже Прапорщика - для заместителей начальников отделов РА, PS, DB.
• Иметь звание не ниже Ст.Прапорщика - для заместителя начальника отдела SWAT.
• Иметь звание не ниже Мл.Лейтенанта - для начальника SWAT.
• Иметь звание не ниже Ст.Прапорщика - для начальника Детективов.
• Иметь звание не ниже Ст.Прапорщика - для главы Patrol Service.
• Иметь звание не ниже Ст.Прапорщика - для главы П.А.
• Иметь звание не ниже Ст.Лейтенанта - для кураторов отделов.
• Следить за состоянием автомобилей своего отдела. В случае, если автомобиль, который прикреплен к вашему отделу не заправлен - немедленно исправить ситуацию, иначе будут применены санкции относительно начальника/заместителя отдела.
• Носить свои командирские жетоны.
• Минимальный срок командования 14 дней.]]
local ykt = [[
Раздел I

1. Избиение, нанесение телесных повреждений.
1.1 За избиение или нанесение телесных повреждений, преступнику присваивается 2 уровень розыска.
[ Удары ножом, битой, лопатой, кулаком и ногой. ]

2. Вооружённое нападение, использование огнестрельного оружия.
2.1 За вооружённое нападение на гражданских, преступнику присваивается 3 уровень розыска + изъятие лицензии на оружие.
2.2 За вооружённое нападение на гос.сотрудников, преступнику присваивается 6 уровень розыска + изъятие лицензии на оружие + запрет на выход под залог [ООП].
[ Розыск выдаётся за использование огнестрельного оружия с целью нанесения физического вреда или повреждения/уничтожения имущества. ]
В рамках самообороны разрешено использовать оружие, но только при условии наличия соответствующей лицензии. Если лицензии нет, обороняющийся всё равно задерживается по статье за "Ношение оружия без лицензии". ]

3. Убийство.
3.1 За убийство или заказ убийства, преступнику присваивается 3 уровень розыска.
3.2 За убийство военнослужащего при исполнении, преступнику присваивается 4 уровень розыска.
3.3 За убийство полицейского при исполнении, преступнику присваивается 5 уровень розыска.
3.4 За убийство агента ФБР при исполнении, преступнику присваивается 6 уровень розыска.

4. Хулиганство, попрошайничество.
4.1 За хулиганство и неадекватное поведение в общественных местах, преступнику присваивается 1 уровень розыска.
[ К хулиганству приравнивается любое нарушение общественного порядка: Стояние на крыше автомобиля, нахождение на крыше остановки, ложный вызов на экстренную линию, флуд в любой чат одним и тем же сообщением.
Если человек толкает пустую машину с проезжей части на обочину, это не считается хулиганством. ]
4.2 За попрошайничество в общественных местах, преступнику присваивается 1 уровень розыска.

5. Оскорбление.
5.1 За оскорбление в любой форме, преступнику присваивается 2 уровень розыска.
[ Оскорбление – это любая попытка перехода на личности в общении, например обращение – "мусор" в отношении представителя силовых структур. Так же оскорблением можно считать затрагивание расы, национальности [Ниггер, макаронник, узкоглазый и т.п.].
В случае если оскорбления идут в крайне неадекватной форме, при задержании следует ставить запрет на рассмотрение дела о выпуске под залог [Запрет права на адвоката].

6. Угон транспортного средства.
6.1 За угон транспортного средства, преступнику присваивается 2 уровень розыска.
[ Угон считается угоном лишь тогда, когда преступник сдвинулся с места находясь за рулем транспорта – в иных случаях следует задерживать за "Проникновение", в зависимости от ситуации ограничиваясь предупреждением.
Если угон происходит через взлом авто, так же следует обвинять в порче имущества. ]

7. Неподчинение, попытка скрыться от полиции, побег.
7.1 За неподчинение правоохранительным органам, преступнику присваивается 1 уровень розыска.
[ Неподчинением следует считать отказ или игнорирование законных требований офицера, как пример: Отказ покинуть салон авто или отказ покинуть место проведения тренировки гос. служащих.
Отказ оплачивать штраф или подписывать протокол о задержании неподчинением не является! ]
7.2 За попытку скрыться от сотрудников правоохранительных органов, преступнику присваивается 2 уровень розыска.
7.3 За побег из тюрьмы при помощи ключей от камер [/escape], преступнику присваивается 6 уровень розыска и запрет на выход под залог [ООП].
[ Ключи подвергаются изъятию из инвентаря лишь при 3 и выше уровне розыска [Общее кол-во зв. по действующим статьям] и за офф от ареста.
При проведении рейдов на ОПГ, у членов ОПГ розыск уже изначально 6+, так как рейд проводится после проведённого расследования против данной ОПГ.
Помните, ключи – как и лицензии, являются предметом ценности, за злоупотребление полномочиями и командами, будет следовать наказание вплоть до увольнения с занесением в ЧС гос. структур. ]

8. Соучастие в преступлении.
8.1 За соучастие в преступлении, преступнику присваивается тоже же наказание, что и организатору.
[ Пример: Таксист везёт пассажира, если оскорбляет пассажир, а водитель пытается скрыться от погони, заместо того чтобы содействовать задержанию – он соучастник.
Однако если водитель оскорбляет, а невинный пассажир едет рядом, то пассажир соучастником не является, так как он не причастен к преступлению.

Не следует путать с содействием преступлению, если пассажир к примеру подсказывает водителю как/куда ехать или например провоцирует офицеров своими криками, то это такое же соучастие. ]

9. Оружие.
9.1 За ношение оружия в открытом виде, кроме гос. служащих находящихся при исполнении служебных обязанностей – оружие изымается.
9.2 За ношение оружия без лицензии, преступнику присваивается 1 уровень розыска и штраф в размере 2000$.
9.3 За изготовление оружие нелегальным способом, его приобретение или его продажу, преступнику присваивается 3 уровень розыска с последующим изъятием оружия и/или материалов.
[ Нелегальным способом является изготовление оружия из материалов в гетто. Легальный способ – покупка у NPC в АММО. ]

10. Наркотики и материалы.
10.1 За хранение или перевозку наркотиков, преступнику присваивается 3 уровень розыска с изъятием наркотических веществ.
10.2 За хранение или перевозку материалов, преступнику присваивается 3 уровень розыска с изъятием материалов.
10.3 За употребление наркотиков, преступнику присваивается 3 уровень розыска с последующим изъятием наркотических веществ.
[ Отыгровки навроде – "/me съел конфету", с целью употребить наркотик и избежать наказание – НЕ являются адекватной РП-отыгровкой.
Если вы видите в чате "Nick_Name употребил(а) наркотик", то смело задерживайте преступника, при обязательном условии что это происходит прямо на ваших глазах и вы напрямую видите персонаж игрока.
При употреблении наркотических веществ, розыск следует так же выдавать и за их хранение. ]
10.4 За употребление наркотических веществ гос. служащим, сотрудник увольняется из организации и получает 3 уровень розыска.
10.5 За рекламу/продажу/покупку наркотиков или материалов, преступнику присваивается 2 уровень розыска и изъятие наркотиков/материалов.
10.6 За изготовление наркотиков/психотропных веществ, присваивается 3 уровень розыска.
[ Относится так же к выращиванию "марихуаны" на фермах. Обвинению подлежат все фермеры, заместители и хозяева фермы. Простые работники обвинению не подлежат. ]


11. Уничтожение и повреждение имущества.
11.1 За повреждение чужого имущества, преступнику присваивается 1 уровень розыска и штраф в размере 5000$
11.2 За уничтожение чужого имущества, преступнику присваивается 4 уровень розыска, штраф в размере 15000$ и полная выплата компенсации за нанесённый ущерб.
[ Уничтожением является любое действие, после которого предмет взорвался или исчез [Перевернули, утопили, расстреляли и т.д.]


12. Проникновение на запретную территорию.
12.1 За проникновение на охраняемую территорию, преступнику присваивается 2 уровень розыска.
[ Территории воинских частей и формирований, офис ФБР, второй и выше этажи мэрии, места тренировок - розыск следует выдавать после повторного нарушения границы. Пробивание блок постов, проникновение на территории находящиеся под оцеплением силами правопорядка - розыск следует выдавать сразу же, после нарушения границы.
Если преступник совершил правонарушение на территории, то розыск следует выдавать так же и по этой статье (оскорбил и уехал, испортил имущество, угнал т/с и т.д.). ].
12.2 За проникновение на частную территорию, преступнику присваивается 1 уровень розыска.
[ Проникновение в транспорт является незаконным, если оно осуществляется без согласия владельца/арендатора данного транспорта.
Крыша SFN так же является частной территорией ].


13. Бандитизм.
13.1 За ограбление граждан или организаций, преступнику присваивается 3 уровень розыска с последующим изъятием награбленного имущества.
[ При ограблениях на форму, материалы или наркотики, розыск следует выдавать так же и за хранение. ]
13.2 За вымогательство, обвиняемому присваивается 2 уровень розыска.
[ "– Механик, либо ты сейчас отдаёшь нам все свои деньги, либо мы покромсаем твоё корыто до состояния металлолома!", "– У меня есть док-ва твоего самовола, либо ты сейчас платишь мне 50000$, либо я на это пожалуюсь и тебя уволят!" – примеры оснований для обвинений в вымогательстве. ]
13.3 За угрозы, обвиняемому присваивается 1 уровень розыска.
[ Угрозы наподобие "Тебя понизят/уволят/занесут в ЧС гос. структур" – наказываются по этой статье, но если гражданин к примеру говорит "Я буду жаловаться!" – это не является основанием. ]
13.4 За провокации, обвиняемому присваивается 2 уровень розыска.
[ Выкрики подобно "– Давай! Стреляй, или ты боишься?!", оскорбительные жесты вроде "/me показал средний палец", "/me плюнул в лицо" и т.п. – примеры оснований для обвинений в провокации. ]
13.5 За мошенничество, обвиняемому присваивается 2 уровень розыска.
[ Пример: Таксист на арендованном гос. авто с включенным счётчиком [/fare] вымогает деньги/чаевые наперёд, а при отказе их дать – высаживает из авто. Подобное является мошенничеством и за это следует задерживать.
"– Хочешь расскажу, как взламывать банкомат? Заплати деньги и скажу." – NonRP-мошенничество, в этой ситуации обязательно сообщите в репорт администрации. ]
13.6 За попытку взлома/взлом базы данных полиции, преступнику присваивается 1 уровень розыска.

14. Проституция и изнасилование.
14.1 За предложение интимных услуг, преступнику присваивается 1 уровень розыска.
14.2 За изнасилование преступнику присваивается 3 уровень розыска.

15. Дача ложных показаний, использование фальшивых документов.
15.1 За укрывательство преступлений/преступников/фактов/улик и прочей важной для следствия информации или за дачу ложных показаний, преступнику присваивается 2 уровень розыска.
15.2 За использование фальшивых документов или удостоверений, присваивается 1 уровень розыска.


16. Клевета.
16.1 За клевету на гражданское или государственное лицо, присваивается 1 уровень розыска.
16.2 За клевету на государственные и частные организации, присваивается 2 уровень розыска.


17. Покупка, продажа и хранение военной формы.
17.1 За продажу военного имущества, военный подлежит увольнению, занесению в черный список армии, так же ему присваивается 3 уровень розыска.
17.2 За покупку военной формы, преступнику присваивается 2 уровень розыска, форма подлежит изъятию.
17.3 За хранение/ношение купленной или ворованной военной формы, преступнику присваивается 2 уровень розыска, форма подлежит изъятию.
[ Или хранение, или ношение – это одно и тоже преступление и при задержании обвинение следует выдавать лишь по одному виду статьи. ]

18. Покупка, кража и продажа ключей от камер.
18.1 За покупку/продажу/кражу ключей от камеры, преступнику присваивается 6 уровень розыска.

19. Коррупция.
19.1 За предложение взятки, преступнику присваивается 2 уровень розыска.
19.2 За принятие взятки, гос. сотрудник несет наказание в виде присвоения 2 уровня розыска и увольнения.
[ Чтобы офицер понёс наказание за коррупцию, вы должны предоставить руководству РП-доказательства, к примеру: Запись диктофона или видео с видеорегистратора, с полагающейся РП-отыгровкой.
Полиции запрещается полностью манипулировать ситуацией, не оставляя жертвам ни единого шанса, за бредовые махинации вроде "/me изъял все предметы для видеосъёмки, диктофон, часы и т.п.", будет следовать наказание за PowerGaming. ]

20. Терроризм и взятие в заложники.
20.1 За совершение теракта, захват зданий и помещений, преступнику присваивается 6 уровень розыска, лишение всех лицензий и запрет на выход под залог [ООП].
[ Террористический акт — совершение взрыва, поджога или иных действий, устрашающих население и создающих опасность гибели человека, посеяв страх и неуверенность в его несокрушимости среди населения.
Стрельба в воздух среди населения, стрельба в людей, взрывы – считается терактом. Вооруженное нападение на одного человека, террористическим актом не является. ]
20.2 За похищение или взятие в заложники граждан или гос. сотрудников, преступнику присваивается 4 уровень розыска, изъятие лицензии на оружие и запрет на выход под залог [ООП].

21. Нелегальные мероприятия/организации. Митинги.
21.1 За организацию нелегальных мероприятий/митингов (Без согласия мэра, премьер-министра или шерифа окрестности, которое стало местом проведения), организаторам присваивается 2 уровень розыска.
21.2 За создание нелегальных организаций (Без согласия мэра или премьер-министра), организаторы и работники получают наказание в виде 3 уровня розыска.

22. Браконьерство.
22.1 За рыбалку без лицензии [Браконьерство], преступнику присваивается 1 уровень розыска.

23. Неуплата штрафа.
23.1 За неуплату штрафа, преступнику присваивается 2 уровень розыска.

24. Игнорирование спец.сирен.
24.1 За игнорирование специальных сирен при движении государственного транспорта, преступнику присваивается 1 уровень розыска.


Раздел II

1. Неординарные ситуации.
1.1 За уход в "АФК" на 30 с лишним секунд или за офф от ареста, преступнику присваивается 6 уровень розыска с причиной: "Уход" и запрет на выход под залог [ООП].
1.2 За превышение полномочий адвоката [освобождение ООП], адвокату присваивается 3 уровень розыска и запрет на выход под залог [Данное деяние приравнивается к соучастию ООП].
[ Освобожденный преступник задерживается по статье за побег с места заключения (статья 7.3) ].
1.3 За агитацию в день выборов – присваивается 6 уровень розыска и запрет на выход под залог [ООП].
[ Запрещена агитация путём подачи объявлений, в эфирах радио, в публичных выступлениях, выкриках и СМС-рассылке. ]


2. Судебные разбирательства.
2.1 За уклонение от участия в судебном разбирательстве, преступнику присваивается 3 уровень розыска и запрет на выход под залог [ООП], так же происходит понижение/увольнение из организации, если он там состоит, если это невозможно, то ему присваивается штраф устанавливаемый судом.
2.2 За отказ в выплате денежной компенсации, преступнику присваивается 2 уровень розыска и запрет на выход под залог [ООП], так же происходит понижение/увольнение из организации, если он там состоит, если это невозможно, то ему присваивается штраф устанавливаемый судом.
2.3 За уклонение от уголовного наказания [АФК/выход из игры/неоправданный неактив и т.п.], преступнику присваивается 3 уровень розыска и запрет на выход под залог [ООП], так же происходит понижение/увольнение из организации, если он там состоит, если же это невозможно, то ему присваивается штраф устанавливаемый судом.
2.4 За нарушение порядка на судебном заседании [Касается всех участников процесса, включая судебную комиссию], преступнику присваивается 2 уровень розыска и запрет на выход под залог [ООП], так же если не удается задержать нарушителя, то добавляется статья 2.3.



ПРИМЕЧАНИЕ К УГОЛОВНОМУ КОДЕКСУ:


Знание пунктов 2 и 3 второго раздела УК не является обязательным, так как они используются исключительно в судебных процессах.

Так как на нашем проекте нет судов, которые определяют тяжесть преступления – все нарушения законов совмещаются – по каждому преступлению идёт отдельное обвинение, как примеры:
Человека задержали за употребление наркотиков, при обыске у него нашли ещё наркотики – следует выдавать розыск как за употребление, так и за хранение.
Человека задержали за угон частного т/с, при задержании следует выдавать розыск как за угон, так и за проникновение в транспорт.

Так же, при условии что:
1. Преступник адекватен;
2. Идёт на встречу правоохранительным органам;
3. Был задержан не по статьям, за которые следует 10-14.
Задержанному разрешается сбавить срок до минимального, с сохранением лицензий, но не запрещёнки.
Суть: Если задержанный признаёт свою вину, раскаивается и после же вменяемо отыгрывает с офицером полноценный допрос, где даёт пояснение своих мотивов свершения данного преступления – он получает право на кратчайшее освобождение из СИЗО [/clear –> /su 1 Чистосердечное признание –> /arrest].
]]
local akt = [[
1-я часть – для водителей:

0.0 Езда без включенных фар.
0.1 За езду без фар дальнего света [/clist 33], нарушителю следует наказание в виде предупреждения и лекции от полиции.
[ По статье не следует задерживать, но если нарушитель проигнорировал/не подчинился требованиям сделанным в доступной для него форме включить фары [Любой /clist, кроме 0], офицер может произвести задержание по статье "Неподчинение".
Сотрудники гос. структур имеют право выключать фары при необходимости. ]
1.1 Езда по встречной полосе.
1.2 Езда по встречной: штраф в размере [LVL x 500$], в случае же неуплаты штрафа – изъятие водительских прав и задержание по статье за неуплату штрафов.
[ Объезд по встречной полосе не считается нарушением, если он стал следствием из-за действий и нарушения ПДД другим водителем ]
2.0 Превышение скорости.
2.1 Превышение скорости: штраф в размере [LVL x 500$].
3.0 Наезд на пешехода.
3.1 Наезд на пешехода: 2 уровень розыска + изъятие водительских прав.
4.0 Парковка в неположенном месте.
4.1 Парковка в неположенном месте наземным транспортным средством: изъятие водительских прав.
4.2 Парковка в неположенном месте воздушным транспортным средством: изъятие лицензии пилота.
5.0 ДТП, уход с места ДТП.
5.1 Виновник ДТП: штраф в размере [LVL x 500$], выплата материального ущерба.
5.2 Покидание места ДТП: 3 уровень розыска, штраф в размере [LVL x 500$] + изъятие прав.
6.0 Управление транспортным средством в нетрезвом состоянии.
6.1 Управление ТС в наркотическом или алкогольном опьянении: 1 уровень розыска + изъятие прав.
7.0 Создание аварийной ситуации.
7.1 Создание аварийной ситуации [АФК на дороге будучи водителем авто, намеренная помеха движению, подрезания]: Изъятие прав и штраф [LVL x 500$].
[ Запрещается изымать водительские права, пока человек находится в АФК ]
8.0 Движение в неположенном месте.
8.1 Движение по тротуарам, обочинам и ж/д путям: штраф в размере [LVL x 500$], в случае же неуплаты штрафа – изъятие водительских прав и задержание по статье за неуплату штрафов.

2-я часть – для пешеходов:

10.1 Создание аварийной ситуации [АФК на дороге, ходьба по проезжей части, перегораживание движения и намеренные прыжки под машину]:
[ Для людей проживающих в штате от 1 до 2-х лет : давать предупреждение, при повторном нарушении выписывать штраф.
Для людей проживающих в штате от 3-ех лет: выписывать штраф.
Штраф [LVL x 250]. ]
]]
local fpt = [[
ПРЕАМБУЛА
Вступительная часть.

0.1 Федеральное Постановление - это нормативно-правовой акт, который был призван внести чёткие рамки в работу государственных организаций.
0.2 Федеральное Постановление издаётся Федеральным Бюро Расследований (далее ФБР) для Полицейских Департаментов (далее ПД) и военных частей (Далее Армия).
0.3 Федеральное Постановление может быть изменено Директором ФБР ( при участии следящего Администратора ) в любое время дня и ночи, его вступление в силу происходит через 48 часов после публикации.
0.4 Федеральное Постановление обязано выполняться всеми сотрудниками вышеупомянутых организаций.
0.5 Незнание Федерального Постановления не освобождает обвиняемого от ответственности.

Изображение

ГЛАВА НОМЕР ОДИН
Преступления против общественности.

1.1 Запрещается несанкционированное применение огнестрельного оружия против любого гражданского лица/сотрудника государственных организаций - понижене.
1.2 Запрещается любое унижение чести и достоинства граждан вне зависимо от его социального или правового статуса - увольнение.
1.3 Запрещается применение насилия в отношении как граждан так и заключенных под стражу лиц - понижение.

Изображение

ГЛАВА НОМЕР ДВА
Постановление в отношении сотрудников Федерального Бюро Расследований и Мэрии.

2.1 Запрещается проникать на территорию FBI без получения официального пропуска от любого из агентов ФБР выше Мл.Агента - предупреждение / понижение.
Примечание: Мэру, Генералам армий, Шерифам разрешение не требуется.
2.2 Запрещается выдавать себя за любого государственного сотрудника - увольнение.
Исключение: Агенты ФБР во время ведения следственных действий под прикрытием.
2.3 Запрещается брать руководство операциями (теракты / похищения) без приказа ФБР - увольнение.
2.4 Запрещается неподчинение агенту ФБР в рамках его законных требований - понижение-увольнение.
Исключение: Агенты ФБР во время ведения следственных действий под прикрытием.
2.5 Запрещается оскорблять/угрожать/шантажировать агента ФБР - увольнение.
2.6 Запрещается оспаривать понижение/увольнение, выданное агентом ФБР/Мэром где-либо, кроме как в специальном разделе жалоб - понижение / увольнение.
2.7 Запрещается раскрывать личность агента ФБР, если тот находится под прикрытием - увольнение.
2.8 Запрещается вносить помехи в работу аттестационной комиссии от высших органов власти, проводящих любого рода проверки в государственных структурах - понижение.
2.9 Запрещается избегать проверки от ФБР - понижение.
Примечание: Агент имеет право вас вызвать в бюро и провести проверку. При отказе последует соответствующее наказание согласно пункту 2.9.

Изображение

ГЛАВА НОМЕР ТРИ
Постановление в отношении Полицейских Департаментов и Армий.

3.1 Запрещаются любые проявления неадекватного поведения и провокации - предупреждение / понижение / увольнение.
3.2 Запрещается нарушать правила строя - предупреждение / понижение.
3.3 Запрещается продажа любого государственного имущества (Ключи от камер/форма/фуры с боеприпасами) - увольнение + ЧС фракции.
3.4 Запрещается давать заведомо ложную информацию государственному сотруднику - увольнение.
3.5 Запрещается необоснованно требовать документы, а так же проводить обыск гражданских лиц - понижение.
3.6 Запрещается лишать права на адвоката (За исключением статьей "Уголовного Кодекса",предусматривающих лишение и наличия у вас доказательств) - понижение.
3.7 Запрещается государственным сотрудникам входить в сговоры с мафией/бандами - увольнение.
Исключение: Спец. операции (обязательный контроль старшего офицера).
3.8 Запрещается без разрешения/пропуска (самовольно) покидать часть/свой город - выговор/понижение/увольнение.
3.9 Запрещается носить форму не соответствующую занимаемой должности/званию - понижение.
Примечание: Соответствие формы и званий устанавливается руководителем организации.
3.10 Запрещается в рабочее время носить на себе вызывающие аксессуары - предупреждение / понижение.
3.11 Запрещается умышленно удалять с базы данных розыска - понижение / увольнение
Дополнение: Если вы ошиблись и можете доказать свою невиновность, вы должны сообщить об этом в департамент.


Изображение

ГЛАВА НОМЕР ЧЕТЫРЕ
Преступления государственных сотрудников против норм Устава, и других правовых документов.

4.1 Запрещается снимать преступникам розыск без уведомления ФБР - понижение.
Исключение: Если розыск был выдан по ошибке и вы можете это доказать.
4.2 Запрещается выдавать розыск без весомой на то причины, по просьбе. Иными словами - не видя факта нарушения лично - понижение / увольнение.
4.3 Запрещается провоцировать кого-либо, не важно, какого рода провокации - понижение.
4.4 Запрещается использовать нецензурную брань, а также оскорбления - понижение / увольнение.
4.5 Запрещается в рабочее время заниматься своими делами ( игра в казино, участие в гонках, дерби, пейнтболе в рабочее время с 9:00 до 22:00 за исключением перерыв с 13:00 до 14:00 , и случаев, когда вышеупомянутые мероприятия были организованы Администрацией сервера) - предупреждение / понижение / увольнение.
Исключение: Разрешение со стороны руководства организации, выполнение служебных обязанностей (например, охрана авторынка) или тренировок под присмотром старшего офицерского состава.
4.6 Запрещается хранение и употребление наркотических веществ, а также хранение краденых материалов - увольнение.
Исключение: Сотрудники PD, сотрудники ФБР в целях спец. операций (с обязательным контролем старшего офицера).
4.7 Запрещается находиться в опасном районе вне спец. операций - увольнение.
Исключение: Спец. операция, Федеральный патруль,специальные отделы (обязательный контроль со стороны руководства организации).
4.8 Запрещается объявлять в розыск не по уголовному кодексу - предупреждение / понижение.
4.9 Запрещается неподчинение старшему по званию в рамках закона - понижение.
Исключение: Старшие по званию - в рамках одной организации.
4.10 Запрещается употреблять алкоголь в рабочее время - понижение.
4.11 Запрещается брать/давать взятки - увольнение.
4.12 Запрещается нарушать правила волны департамента - предупреждение / понижение.
4.13 Запрещается беспричинно обыскивать государственных сотрудников - понижение.
4.14 Запрещается лишать лицензии без весомых на то причин - компенсация стоимости лицензий за счёт отобравшего офицера + понижение.
Примечание: Если Вы увидели, что государственный сотрудник нарушил правила дорожного движения или в гражданской форме УК (где предусматривается изъятие лицензии), и у Вас есть доказательства, Вы имеете полное право забрать лицензию.
4.15 Запрещается нарушать субординацию при общении со старшими по званию - предупреждение / понижение.
4.16 Запрещается убийство в наручниках или эффектом электрошокера - понижение / увольнение.
Примечание: Разрешено использовать электрошокер в перестрелке, если она началась в Зелёной Зоне и у вас есть доказательства.
4.17 Запрещается нарушать законы штата, не важно в форме вы или нет - предупреждение / понижение / увольнение.
Исключение: Если у Вас есть доказательства, подтверждающие вашу полную либо частичную невиновность по фактам: самообороны себя и близких; защиты личного имущества; при выполнении служебного долга, но находясь не при исполнении служебных обязанностей ( не в форме ); приказ старшего по званию в рамках закона.
4.18 Запрещается неподчинение руководящему составу ФБР - увольнение.
4.19 Запрещается неподчинение Мэру в рамках закона Штата Evolve - увольнение.
4.20 Запрещается отдавать приказы Мэру - увольнение.
4.21 Запрещается отдавать приказы сотрудникам ФБР - увольнение.
4.22 Запрещается нарушать нормы составления правовых актов ( Запрещается злоупотребление биндерами/скриптами ) - выговор / понижение / увольнение. Правила использования. ( кликабельно )

Изображение

ГЛАВА НОМЕР ПЯТЬ
Дополнительное положение.
5.1 Сотрудник ФБР имеет право сменить наказание на дисциплинарное взыскание в виде предупреждения.
5.2 Cотрудник Армии или ПД обязан сделать выводы о своей вине и постараться более не нарушать ФП.
5.3 Смена наказания осуществляется агентом ФБР, исходя из его здравого смысла и опыта. Выдача предупреждений за пункты, которые так или иначе способны пошатнуть государственную безопасность - запрещены.
5.4 Сотрудник имеет право получить только одно предупреждение, при последующих нарушениях следуют более тяжкие наказания.
5.5 Пункты, предусматривающие выбор вида наказания, подразумевают применение одного из них по усмотрению выдающего наказание, в зависимости от тяжести нарушения и наличия активных предупреждений, либо нарушений в прошлом.

]]
local dfmenu =
{
  {
    title = 'Бомба с часовым механизмом',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me достал саперный набор")
        wait(3500)
        sampSendChat("/me открыл саперный набор")
        wait(3500)
        sampSendChat("/me осмотрел взрывное устройство")
        wait(3500)
        sampSendChat("/do Определил тип взрывного устройства. Бомба с часовым механизмом.")
        wait(3500)
        sampSendChat("/do Увидел три провода выходящих с механизма.")
        wait(3500)
        sampSendChat("/me достал нож из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно зачистил первый провод")
        wait(3500)
        sampSendChat("/try достал отвертку с индикатором и прислонил край отвертки к оголённом проводу")
      end
      if cfg.main.male == false then
        sampSendChat("/me достала саперный набор")
        wait(3500)
        sampSendChat("/me открыла саперный набор")
        wait(3500)
        sampSendChat("/me осмотрела взрывное устройство")
        wait(3500)
        sampSendChat("/do Определила тип взрывного устройства. Бомба с часовым механизмом.")
        wait(3500)
        sampSendChat("/do Увидела три провода выходящих с механизма.")
        wait(3500)
        sampSendChat("/me достала нож из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно зачистила первый провод")
        wait(3500)
        sampSendChat("/try достала отвертку с индикатором и прислонила край отвертки к оголённом проводу")
      end
    end
  },
  {
    title = 'Бомба с часовым механизмом если {63c600}[Удачно]',
    onclick = function()
        if cfg.main.male == true then
        sampSendChat("/me перерезал проводок")
        wait(3500)
        sampSendChat("/me прислушался к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me перерезала проводок")
        wait(3500)
        sampSendChat("/me прислушалась к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с часовым механизмом если {bf0000}[Неудачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me аккуратно зачистил второй провод")
        wait(3500)
        sampSendChat("/me перерезал проводок")
        wait(3500)
        sampSendChat("/me прислушался к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me аккуратно зачистила второй провод")
        wait(3500)
        sampSendChat("/me перерезала проводок")
        wait(3500)
        sampSendChat("/me прислушалась к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с дистанционным управлением',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me достал саперный набор")
        wait(3500)
        sampSendChat("/me открыл саперный набор")
        wait(3500)
        sampSendChat("/me осмотрел взрывное устройство")
        wait(3500)
        sampSendChat("/do Определил тип взрывного устройства. Бомба с дистанционным управлением.")
        wait(3500)
        sampSendChat("/do Увидел два шурупа на блоке с механизмом.")
        wait(3500)
        sampSendChat("/me достал отвертку из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно выкручивает шуруп")
        wait(3500)
        sampSendChat("/me отодвинул крышку блока и увидел антенну")
        wait(3500)
        sampSendChat("/do Увидел красный мигающий индикатор.")
        wait(3500)
        sampSendChat("/me просмотрел путь микросхемы от антенны к детонатору")
        wait(3500)
        sampSendChat("/me увидел два провода")
        wait(3500)
        sampSendChat("/try перерезал первый провод. Индикатор перестал мигать.")
      end
      if cfg.main.male == false then
        sampSendChat("/me достала саперный набор")
        wait(3500)
        sampSendChat("/me открыла саперный набор")
        wait(3500)
        sampSendChat("/me осмотрела взрывное устройство")
        wait(3500)
        sampSendChat("/do Определила тип взрывного устройства. Бомба с Бомба с дистанционным управлением.")
        wait(3500)
        sampSendChat("/do Увидела два шурупа на блоке с механизмом.")
        wait(3500)
        sampSendChat("/me достала отвертку из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно выкручивает шуруп")
        wait(3500)
        sampSendChat("/me отодвинула крышку блока и увидел антенну")
        wait(3500)
        sampSendChat("/do Увидел красный мигающий индикатор.")
        wait(3500)
        sampSendChat("/me просмотрела путь микросхемы от антенны к детонатору")
        wait(3500)
        sampSendChat("/me увидела два провода")
        wait(3500)
        sampSendChat("/try перерезала первый провод. Индикатор перестал мигать.")
      end
    end
  },
  {
    title = 'Бомба с дистанционным управлением если {63c600}[Удачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с дистанционным управлением если {bf0000}[Неудачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me перерезал второй провод")
        wait(3500)
        sampSendChat("/do Индикатор перестал мигать.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me перерезала второй провод")
        wait(3500)
        sampSendChat("/do Индикатор перестал мигать.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложил туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с активационным кодом',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me достал саперный набор")
        wait(3500)
        sampSendChat("/me открыл саперный набор")
        wait(3500)
        sampSendChat("/me осмотрел взрывное устройство")
        wait(3500)
        sampSendChat("/do Определил тип взрывного устройства. Бомба с активационным кодом.")
        wait(3500)
        sampSendChat("/me достал из саперного набора прибор для подбора кода")
        wait(3500)
        sampSendChat("/me подключил прибор к бомбе")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 5326.")
        wait(3500)
        sampSendChat("/try ввёл полученный пароль. Экран бомбы выключился")
      end
      if cfg.main.male == false then
        sampSendChat("/me достала саперный набор")
        wait(3500)
        sampSendChat("/me открыла саперный набор")
        wait(3500)
        sampSendChat("/me осмотрела взрывное устройство")
        wait(3500)
        sampSendChat("/do Определила тип взрывного устройства. Бомба с активационным кодом.")
        wait(3500)
        sampSendChat("/me достала из саперного набора прибор для подбора кода")
        wait(3500)
        sampSendChat("/me подключила прибор к бомбе")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 5326.")
        wait(3500)
        sampSendChat("/try ввёла полученный пароль. Экран бомбы выключился")
      end
    end
  },
  {
    title = 'Бомба с активационным кодом если {63c600}[Удачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с активационным кодом если {bf0000}[Неудачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me перезагрузил(а) прибор")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 3789.")
        wait(3500)
        sampSendChat("/me ввёл полученный пароль")
        wait(3500)
        sampSendChat("/Экран бомбы выключился")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me перезагрузила прибор")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 3789.")
        wait(3500)
        sampSendChat("/me ввёла полученный пароль")
        wait(3500)
        sampSendChat("/Экран бомбы выключился")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  }
}
local fcmenu =
{
  {
    title = 'Теракты',
    submenu =
    {
      {
        title = '{00BFFF}« Мэрия »'
      },
      {
        title = '{00BFFF}Захват мэрии без заложников — {ff0000}100.000$'
      },
      {
        title = '{00BFFF}Захват мэрии c заложниками — {ff0000}150.000$'
      },
      {
        title = '{9A9593}« Офис ФБР »'
      },
      {
        title = '{9A9593}Захват офиса федерального бюро без заложников — {ff0000}100.000$'
      },
      {
        title = '{9A9593}Захват офиса федерального бюро c заложниками — {ff0000}150.000$'
      },
      {
        title = '{0080FF}« Участок SFPD »'
      },
      {
        title = '{0080FF}Захват участка SAPD без заложников — {ff0000}100.000$'
      },
      {
        title = '{0080FF}Захват участка SAPD c заложниками — {ff0000}150.000$'
      },
      {
        title = '{BF4040}« Больница »'
      },
      {
        title = '{BF4040}Захват больницы без заложников — {ff0000}75.000$'
      },
      {
        title = '{BF4040}Захват больницы с заложниками — {ff0000}100.000$'
      },
      {
        title = '{00BFFF}« Автошкола »'
      },
      {
        title = '{00BFFF}Захват автошколы без заложников — {ff0000}50.000$'
      },
      {
        title = '{00BFFF}Захват автошколы с заложниками — {ff0000}75.000$'
      },
      {
        title = '{40BFBF}« CМИ »'
      },
      {
        title = '{40BFBF}Захват СМИ без заложников — {ff0000}50.000$'
      },
      {
        title = '{40BFBF}Захват СМИ с заложниками — {ff0000}75.000$'
      },
      {
        title = '« Остальное »'
      },
      {
        title = 'Захват развлекательных/рабочих заведений без заложников — {ff0000}50.000$'
      },
      {
        title = 'Захват развлекательных/рабочих заведений с заложниками — {ff0000}75.000$'
      }
    }
  },
  {
    title = 'Похищения',
    submenu =
    {
      {
        title = 'Мэрия',
        submenu =
        {
          {
            title = '{0040BF}Мэр{ffffff} [6] - {ff0000}100.000$'
          },
          {
            title = '{0040BF}Зам.Мэра{ffffff} [5] - {ff0000}80.000$'
          },
          {
            title = '{0040BF}Начальник охраны{ffffff} [4] - {ff0000}60.000$'
          },
          {
            title = '{0040BF}Охранник{ffffff} [3] - {ff0000}40.000$'
          },
          {
            title = '{0040BF}Адвокат{ffffff} [2] - {ff0000}30.000$'
          },
          {
            title = '{0040BF}Секретарь{ffffff} [1] - {ff0000}20.000$'
          }
        }
      },
      {
        title = 'ФБР',
        submenu =
        {
          {
            title = '{9A9593}Директор{ffffff} [10] - {ff0000}100.000$'
          },
          {
            title = '{9A9593}Зам.Директора{FFFFFF} [9] - {ff0000}80.000$'
          },
          {
            title = '{9A9593}Инспектор{ffffff} [8] - {ff0000}70.000$'
          },
          {
            title = '{9A9593}Глава CID{ffffff} [7] - {ff0000}60.000$'
          },
          {
            title = '{9A9593}Глава DEA{ffffff} [6] - {ff0000}50.000$'
          },
          {
            title = '{9A9593}Агент CID{ffffff} [5] - {ff0000}40.000$'
          },
          {
            title = '{9A9593}Агент DEA{ffffff} [4] - {ff0000}30.000$'
          },
          {
            title = '{9A9593}Мл.Агент{ffffff} [3] - {ff0000}25.000$'
          },
          {
            title = '{9A9593}Дежурный{ffffff} [2] - {ff0000}20.000$'
          },
          {
            title = '{9A9593}Стажер{ffffff} [1] - {ff0000}15.000$'
          }
        }
      },
      {
        title = 'Полиция',
        submenu =
        {
          {
            title = '{0000FF}Шериф{ffffff} [14] - {ff0000}80.000$'
          },
          {
            title = '{0000FF}Полковник{ffffff} [13] - {ff0000}70.000$'
          },
          {
            title = '{0000FF}Подполковник{ffffff} [12] - {ff0000}65.000$'
          },
          {
            title = '{0000FF}Майор{ffffff} [11] - {ff0000}60.000$'
          },
          {
            title = '{0000FF}Капитан{ffffff} [10] - {ff0000}55.000$'
          },
          {
            title = '{0000FF}Ст.Лейтенант{ffffff} [9] - {ff0000}50.000$'
          },
          {
            title = '{0000FF}Лейтенант{ffffff} [8] - {ff0000}45.000$'
          },
          {
            title = '{0000FF}Мл.Лейтенант{ffffff} [7] - {ff0000}40.000$'
          },
          {
            title = '{0000FF}Ст.Прапорщик{ffffff} [6] - {ff0000}35.000$'
          },
          {
            title = '{0000FF}Прапорщик{ffffff} [5] - {ff0000}30.000$'
          },
          {
            title = '{0000FF}Сержант{ffffff} [4] - {ff0000}25.000$'
          },
          {
            title = '{0000FF}Мл.Сержант{ffffff} [3] - {ff0000}20.000$'
          },
          {
            title = '{0000FF}Офицер{ffffff} [2] - {ff0000}15.000$'
          },
          {
            title = '{0000FF}Кадет{ffffff} [1] - {ff0000}10.000$'
          }
        }
      },
      {
        title = 'Армия',
        submenu =
        {
          {
            title = '{008040}Генерал{ffffff} [15] - {ff0000}80.000$'
          },
          {
            title = '{008040}Полковник{ffffff} [14] - {ff0000}75.000$'
          },
          {
            title = '{008040}Подполковник{ffffff} [13] - {ff0000}70.000$'
          },
          {
            title = '{008040}Майор{ffffff} [12] - {ff0000}65.000$'
          },
          {
            title = '{008040}Капитан{ffffff} [11] - {ff0000}60.000$'
          },
          {
            title = '{008040}Ст.Лейтенант{ffffff} [10] - {ff0000}55.000$'
          },
          {
            title = '{008040}Лейтенант{ffffff} [9] - {ff0000}50.000$'
          },
          {
            title = '{008040}Мл.Лейтенант{ffffff} [8] - {ff0000}45.000$'
          },
          {
            title = '{008040}Прапорщик{ffffff} [7] - {ff0000}40.000$'
          },
          {
            title = '{008040}Старшина{ffffff} [6] - {ff0000}35.000$'
          },
          {
            title = '{008040}Ст.сержант{ffffff} [5] - {ff0000}30.000$'
          },
          {
            title = '{008040}Сержант{ffffff} [4] - {ff0000}25.000$'
          },
          {
            title = '{008040}Мл.Сержант{ffffff} [3] - {ff0000}20.000$'
          },
          {
            title = '{008040}Ефрейтор{ffffff} [2] - {ff0000}15.000$'
          },
          {
            title = '{008040}Рядовой{ffffff} [1] - {ff0000}10.000$'
          }
        }
      },
      {
        title = 'Медики',
        submenu =
        {
          {
            title = '{BF4040}Глав.Врач{ffffff} [10] - {ff0000}80.000$'
          },
          {
            title = '{BF4040}Зам.Глав.Врача{ffffff} [9] - {ff0000}75.000$'
          },
          {
            title = '{BF4040}Хирург{ffffff} [8] - {ff0000}70.000$'
          },
          {
            title = '{BF4040}Психолог{ffffff} [7] - {ff0000}60.000$'
          },
          {
            title = '{BF4040}Доктор{ffffff} [6] - {ff0000}40.000$'
          },
          {
            title = '{BF4040}Нарколог{ffffff} [5] - {ff0000}35.000$'
          },
          {
            title = '{BF4040}Спасатель{ffffff} [4] - {ff0000}30.000$'
          },
          {
            title = '{BF4040}Мед.Брат{ffffff} [3] - {ff0000}25.000$'
          },
          {
            title = '{BF4040}Санитар{ffffff} [2] - {ff0000}20.000$'
          },
          {
            title = '{BF4040}Интерн{ffffff} [1] - {ff0000}15.000$'
          }
        }
      },
      {
        title = 'Автошкола',
        submenu =
        {
          {
            title = '{40BFFF}Управляющий{ffffff} [10] - {ff0000}80.000$'
          },
          {
            title = '{40BFFF}Директор{ffffff} [9] - {ff0000}75.000$'
          },
          {
            title = '{40BFFF}Ст.Менеджер{ffffff} [8] - {ff0000}70.000$'
          },
          {
            title = '{40BFFF}Мл.Менеджер{ffffff} [7] - {ff0000}60.000$'
          },
          {
            title = '{40BFFF}Координатор{ffffff} [6] - {ff0000}55.000$'
          },
          {
            title = '{40BFFF}Инструктор{FFFFFF} [5] - {ff0000}50.000$'
          },
          {
            title = '{40BFFF}Мл.Инструктор{ffffff} [4] - {ff0000}45.000$'
          },
          {
            title = '{40BFFF}Экзаменатор{ffffff} [3] - {ff0000}30.000$'
          },
          {
            title = '{40BFFF}Консультант{ffffff} [2] - {ff0000}25.000$'
          },
          {
            title = '{40BFFF}Стажер{ffffff} [1] - {ff0000}20.000$'
          }
        }
      },
      {
        title = 'Новости',
        submenu =
        {
          {
            title = '{FFFF80}Генеральный директор{ffffff} [10] - {ff0000}70.000$'
          },
          {
            title = '{FFFF80}Програмный директор{ffffff} [9] - {ff0000}60.000$'
          },
          {
            title = '{FFFF80}Технический директор{ffffff} [8] - {ff0000}55.000$'
          },
          {
            title = '{FFFF80}Главный редактор{ffffff} [7] - {ff0000}50.000$'
          },
          {
            title = '{FFFF80}Редактор{ffffff} [6] - {ff0000}45.000$'
          },
          {
            title = '{FFFF80}Ведущий{ffffff} [5] - {ff0000}40.000$'
          },
          {
            title = '{FFFF80}Репортер{ffffff} [4] - {ff0000}30.000$'
          },
          {
            title = '{FFFF80}Звукорежиссер{ffffff} [3] - {ff0000}25.000$'
          },
          {
            title = '{FFFF80}Звукооператор{ffffff} [2] - {ff0000}20.000$'
          },
          {
            title = '{FFFF80}Стажер{ffffff} [1] - {ff0000}15.000$'
          }
        }
      }
    }
  }
}
-----------
function ftext(message)
    sampAddChatMessage(string.format('%s %s', ctag, message), 0x0C2265)
end
--FUNCTIONS--
function update()
	local fpath = os.getenv('TEMP') .. '\\ftulsupd.json'
	downloadUrlToFile('https://raw.githubusercontent.com/WhackerH/kirya/master/ftulsupd.json', fpath, function(id, status, p1, p2)
		if status == dlstatus.STATUS_ENDDOWNLOADDATA then
            local f = io.open(fpath, 'r')
            if f then
			    local info = decodeJson(f:read('*a'))
                updatelink = info.updateurl
                updlist1 = info.updlist
                ttt = updlist1
			    if info and info.latest then
                    version = tonumber(info.latest)
                    if version > tonumber(thisScript().version) then
                        ftext('Обнаружено обновление {0C2265}FBI Tools{ffffff}. Для обновления нажмите кнопку в окошке.')
                        ftext('Примечание: Если у вас не появилось окошко введите /ft')
					    updwindows.v = true
                    else
                        ftext('Обновлений скрипта не обнаружено. Приятной игры.', -1)
                        update = false
				    end
			    end
		    end
	    end
    end)
end

--скачивание актуальной версии
function goupdate()
    ftext('Началось скачивание обновления. Скрипт перезагрузится через пару секунд.', -1)
    wait(300)
    downloadUrlToFile(updatelink, thisScript().path, function(id3, status1, p13, p23)
    if status1 == dlstatus.STATUS_ENDDOWNLOADDATA then
        showCursor(false)
	    thisScript():reload()
    end
end)
end
function getNameSphere(id)
    local names =
    {
      [1] = 'АВ',
      [2] = 'АШ',
      [3] = 'СФа',
      [4] = 'В',
      [5] = 'А',
      [6] = 'СФн',
      [7] = 'Тоннель',
      [8] = 'Мэрия',
      [9] = 'Хот-Доги',
      [10] = 'Больница ЛС',
      [11] = 'АВ',
      [12] = 'Мост',
      [13] = 'Перекресток',
      [14] = 'Развилка',
      [15] = 'В',
      [16] = 'А',
      [17] = 'В',
      [18] = 'С',
      [19] = 'КПП',
      [20] = 'Порт ЛС',
      [21] = 'Опасный район',
      [32] = 'КПП',
      [33] = 'D',
      [34] = 'Холл Мэрии'
    }
    return names[id]
end
checkstat = false
function checkStats()
    checkstat = true
    sampSendChat('/stats')
    while checkstat do wait(0) end
    sampCloseCurrentDialogWithButton(1)
    if rang == nil and frak == nil then
        ftext('Не удалось определить статистику персонажа. Повторить попытку?', -1)
        ftext('Подтвердить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
        opyatstat = true
    end
end
function shpf()
    if not doesFileExist('moonloader/fbitools/shp.txt') then
        local file = io.open("moonloader/fbitools/shp.txt", "w")
        file:write(shpt)
        file:close()
        file = nil
    end
end
function akf()
    if not doesFileExist('moonloader/fbitools/ak.txt') then
        local file = io.open("moonloader/fbitools/ak.txt", "w")
        file:write(akt)
        file:close()
        file = nil
    end
end

function ten()
    if not doesFileExist('moonloader/fbitools/ten.txt') then
        local file = io.open("moonloader/fbitools/ten.txt", "w")
        file:write(ten)
        file:close()
        file = nil
    end
end
function fpf()
    if not doesFileExist('moonloader/fbitools/fp.txt') then
        local file = io.open("moonloader/fbitools/fp.txt", "w")
        file:write(fpt)
        file:close()
        file = nil
    end
end

function ykf()
    if not doesFileExist('moonloader/fbitools/yk.txt') then
        local file = io.open("moonloader/fbitools/yk.txt", "w")
        file:write(ykt)
        file:close()
        file = nil
    end
end
function suf()
    if not doesFileExist('moonloader/fbitools/su.txt') then
        local file = io.open('moonloader/fbitools/su.txt', 'w')
        file:write(sut)
        file:close()
        file = nil
    end
end
function ysf()
    if not doesFileExist('moonloader/fbitools/ys.txt') then
        local file = io.open("moonloader/fbitools/ys.txt", "w")
        file:write(yst)
        file:close()
        file = nil
    end
end
function getClosestPlayerId()
    local minDist = 9999
    local closestId = -1
    local x, y, z = getCharCoordinates(PLAYER_PED)
    for i = 0, 999 do
        local streamed, pedID = sampGetCharHandleBySampPlayerId(i)
        if streamed then
            local xi, yi, zi = getCharCoordinates(pedID)
            local dist = math.sqrt( (xi - x) ^ 2 + (yi - y) ^ 2 + (zi - z) ^ 2 )
            if dist < minDist and getFraktionBySkin(i) ~= 'Полиция' and getFraktionBySkin(i) ~= 'FBI' then
                minDist = dist
                closestId = i
            end
        end
    end
    return closestId
end
function getClosestPlayerIDinCar()
    local minDist = 9999
    local closestId = -1
    local x, y, z = getCharCoordinates(PLAYER_PED)
    local veh = storeCarCharIsInNoSave(PLAYER_PED)
    for i = 0, 999 do
        local streamed, pedID = sampGetCharHandleBySampPlayerId(i)
        if streamed then
            local xi, yi, zi = getCharCoordinates(pedID)
            local dist = math.sqrt( (xi - x) ^ 2 + (yi - y) ^ 2 + (zi - z) ^ 2 )
            if dist < minDist and getFraktionBySkin(i) ~= 'Полиция' and getFraktionBySkin(i) ~= 'FBI' and isCharInAnyCar(pedID) and storeCarCharIsInNoSave(pedID) == veh then
                minDist = dist
                closestId = i
            end
        end
    end
    return closestId
end
function cuffk()
    local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE)
    if valid then
        result, targetid = sampGetPlayerIdByCharHandle(ped)
        if result then
            lua_thread.create(function()
                sampSendChat(string.format('/me %s руки преступника и %s наручники', cfg.main.male and 'заломал' or 'заломала', cfg.main.male and 'достал' or 'достала'))
                wait(1200)
                sampSendChat('/cuff '..targetid)
                gmegafhandle = ped
                gmegafid = targetid
                gmegaflvl = sampGetPlayerScore(targetid)
                gmegaffrak = getFraktionBySkin(targetid)
            end)
        end
    else
        local closeid = getClosestPlayerId()
        local result, closehandle = sampGetCharHandleBySampPlayerId(closeid)
        if closeid ~= -1 and doesCharExist(closehandle) then
            lua_thread.create(function()
                sampSendChat(string.format('/me %s руки преступника и %s наручники', cfg.main.male and 'заломал' or 'заломала', cfg.main.male and 'достал' or 'достала'))
                wait(1200)
                sampSendChat('/cuff '..closeid)
                gmegafhandle = closehandle
                gmegafid = closeid
                gmegaflvl = sampGetPlayerScore(closeid)
                gmegaffrak = getFraktionBySkin(closeid)
            end)
        end
    end
end
function uncuffk()
    local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE)
    if valid then
        result, targetid = sampGetPlayerIdByCharHandle(ped)
        if result then
            lua_thread.create(function()
                sampSendChat(string.format('/me %s наручники с преступника', cfg.main.male and 'снял' or 'сняла'))
                wait(1200)
                sampSendChat('/uncuff '..targetid)
                gmegafhandle = nil
                gmegafid = nil
                gmegaflvl = nil
                gmegaffrak = nil
            end)
        end
    else
        local closeid = getClosestPlayerId()
        local result, closehandle = sampGetCharHandleBySampPlayerId(closeid)
        if closeid ~= -1 and doesCharExist(closehandle) then
            lua_thread.create(function()
                sampSendChat(string.format('/me %s наручники с преступника', cfg.main.male and 'снял' or 'сняла'))
                wait(1200)
                sampSendChat('/uncuff '..closeid)
                gmegafhandle = nil
                gmegafid = nil
                gmegaflvl = nil
                gmegaffrak = nil
            end)
        end
    end
end
function followk()
    local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE)
    if valid then
        result, targetid = sampGetPlayerIdByCharHandle(ped)
        if result then
            lua_thread.create(function()
                sampSendChat(string.format('/me %s один из концов наручников к себе, после чего %s за собой преступника', cfg.main.male and 'пристегнул' or 'пристегнула', cfg.main.male and 'повел' or 'повела'))
                wait(1200)
                sampSendChat('/follow '..targetid)
                gmegafhandle = ped
                gmegafid = targetid
                gmegaflvl = sampGetPlayerScore(targetid)
                gmegaffrak = getFraktionBySkin(targetid)
            end)
        end
    else
        local closeid = getClosestPlayerId()
        local result, closehandle = sampGetCharHandleBySampPlayerId(closeid)
        if closeid ~= -1 and doesCharExist(closehandle) then
            lua_thread.create(function()
                sampSendChat(string.format('/me %s один из концов наручников к себе, после чего %s за собой преступника', cfg.main.male and 'пристегнул' or 'пристегнула', cfg.main.male and 'повел' or 'повела'))
                wait(1200)
                sampSendChat('/follow '..closeid)
                gmegafhandle = closehandle
                gmegafid = closeid
                gmegaflvl = sampGetPlayerScore(closeid)
                gmegaffrak = getFraktionBySkin(closeid)
            end)
        end
    end
end
function getFreeSeat()
    seat = 3
    if isCharInAnyCar(PLAYER_PED) then
        local veh = storeCarCharIsInNoSave(PLAYER_PED)
        for i = 1, 3 do
            if isCarPassengerSeatFree(veh, i) then
                seat = i
            end
        end
    end
    return seat
end
function cputk()
    local closeid = getClosestPlayerId()
    local result, closehandle = sampGetCharHandleBySampPlayerId(closeid)
    if closeid ~= -1 and doesCharExist(closehandle) then
        lua_thread.create(function()
            if isCharOnAnyBike(PLAYER_PED) then
                sampSendChat(string.format("/me %s преступника на сиденье мотоцикла", cfg.main.male and 'посадил' or 'посадила'))
                wait(1200)
                sampSendChat("/cput "..closeid.." 1", -1)
            else
                sampSendChat(string.format("/me %s дверь автомобиля и %s туда преступника", cfg.main.male and 'открыл' or 'открыла', cfg.main.male and 'затолкнул' or 'затолкнула'))
                wait(1200)
                sampSendChat("/cput "..closeid.." "..getFreeSeat(), -1)
            end
            gmegafhandle = closehandle
            gmegafid = closeid
            gmegaflvl = sampGetPlayerScore(closeid)
            gmegaffrak = getFraktionBySkin(closeid)
        end)
    end
end
function cejectk()
    local closestId = getClosestPlayerIDinCar()
    local result, closehandle = sampGetCharHandleBySampPlayerId(closestId)
    if closestId ~= -1 and doesCharExist(closehandle) then
        lua_thread.create(function()
            if isCharOnAnyBike(PLAYER_PED) then
                sampSendChat(string.format("/me %s преступника с мотоцикла", cfg.main.male and 'высадил' or 'высадила'))
                wait(1200)
                sampSendChat("/ceject "..closestId, -1)
            else
                sampSendChat(string.format("/me %s дверь автомобиля и %s преступника", cfg.main.male and 'открыл' or 'открыл', cfg.main.male and 'высадил' or 'высадила'))
                wait(1200)
                sampSendChat("/ceject "..closestId)
            end
            gmegafhandle = closehandle
            gmegafid = closestId
            gmegaflvl = sampGetPlayerScore(closestId)
            gmegaffrak = getFraktionBySkin(closestId)
        end)
    end
end
function takek()
    local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE)
    if valid then
        result, targetid = sampGetPlayerIdByCharHandle(ped)
        if result then
            lua_thread.create(function()
                sampSendChat(string.format('/me надев перчатки, %s руками по торсу', cfg.main.male and 'провел' or 'провела'))
                wait(1200)
                sampSendChat('/take '..targetid)
                gmegafhandle = ped
                gmegafid = targetid
                gmegaflvl = sampGetPlayerScore(targetid)
                gmegaffrak = getFraktionBySkin(targetid)
            end)
        end
    else
        local closeid = getClosestPlayerId()
        local result, closehandle = sampGetCharHandleBySampPlayerId(closeid)
        if closeid ~= -1 and doesCharExist(closehandle) then
            lua_thread.create(function()
                sampSendChat(string.format('/me надев перчатки, %s руками по торсу', cfg.main.male and 'провел' or 'провела'))
                wait(1200)
                sampSendChat('/take '..closeid)
                gmegafhandle = closehandle
                gmegafid = closeid
                gmegaflvl = sampGetPlayerScore(closeid)
                gmegaffrak = getFraktionBySkin(closeid)
            end)
        end
    end
end
function arrestk()
    local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE)
    if valid then
        result, targetid = sampGetPlayerIdByCharHandle(ped)
        if result then
            lua_thread.create(function()
                sampSendChat(string.format('/me %s камеру', cfg.main.male and 'открыл' or 'открыла'))
                wait(cfg.commands.zaderjka)
                sampSendChat(string.format('/me %s преступника в камеру', cfg.main.male and 'провел' or 'провела'))
                wait(cfg.commands.zaderjka)
                sampSendChat('/arrest '..targetid)
                wait(cfg.commands.zaderjka)
                sampSendChat(string.format('/me %s камеру', cfg.main.male and 'закрыл' or 'закрыла'))
                wait(1500)
                sampSendChat("/time")
                wait(500)
                setVirtualKeyDown(key.VK_F8, true)
                wait(150)
                setVirtualKeyDown(key.VK_F8, false)
				wait(1000)
                gmegafhandle = nil
                gmegafid = nil
                gmegaflvl = nil
                gmegaffrak = nil
            end)
        end
    else
        local closeid = getClosestPlayerId()
        local result, closehandle = sampGetCharHandleBySampPlayerId(closeid)
        if closeid ~= -1 and doesCharExist(closehandle) then
            lua_thread.create(function()
                sampSendChat(string.format('/me %s камеру', cfg.main.male and 'открыл' or 'открыла'))
                wait(cfg.commands.zaderjka)
                sampSendChat(string.format('/me %s преступника в камеру', cfg.main.male and 'провел' or 'провела'))
                wait(cfg.commands.zaderjka)
                sampSendChat('/arrest '..closeid)
                wait(cfg.commands.zaderjka)
                sampSendChat(string.format('/me %s камеру', cfg.main.male and 'закрыл' or 'закрыла'))
                wait(1500)
                sampSendChat("/time")
                wait(500)
                setVirtualKeyDown(key.VK_F8, true)
                wait(150)
                setVirtualKeyDown(key.VK_F8, false)
                gmegafhandle = nil
                gmegafid = nil
                gmegaflvl = nil
                gmegaffrak = nil
            end)
        end
    end
end
function getMaskList(forma)
	local mask = {
		['гражданского'] = 0,
		['полицейского'] = 1,
		['военного'] = 2,
		['лаборатория'] = 3,
		['медика'] = 3,
		['сотрудника мэрии'] = 4,
		['работника автошколы'] = 5,
		['работника новостей'] = 6,
		['ЧОП LCN'] = 7,
		['ЧОП Yakuza'] = 8,
		['ЧОП Russian Mafia'] = 9,
		['БК Rifa'] = 10,
		['БК Grove'] = 11,
		['БК Ballas'] = 12,
		['БК Vagos'] = 13,
		['БК Aztec'] = 14,
		['байкеров'] = 15
	}
	return mask[forma]
end
function oopchat()
    stext, sprefix, scolor, spcolor = sampGetChatString(99)
    if zaproop then
        if nikk ~= nil then
            if stext:find(nikk) and scolor == 4294935170 then
                local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
                local myname = sampGetPlayerNickname(myid)
                if not stext:find(myname) then
                    zaproop = false
                    nikk = nil
                    wait(100)
                    ftext('Команду выполнил другой сотрудник.', -1)
                end
            end
        end
    end
    if scolor == 4287467007 then
        if rang ~= 'Кадет' and rang ~= 'Офицер' and rang ~= 'Мл.Сержант' and  rang ~= 'Сержант' and  rang ~= 'Прапорщик' then
            if stext:find('Дело .+ рассмотрению не подлежит %- ООП.') then
                local name = stext:match('Дело (.+) рассмотрению не подлежит %- ООП.')
                zaproop = true
                nikk = name
                if nikk ~= nil then
                    wait(50)
                    ftext(string.format("Поступил запрос на объявление ООП игрока {0C2265}%s", nikk:gsub('_', ' ')), -1)
                    ftext('Подтвердить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
                else
                    zaproop = false
                end
            end
            if stext:find('Дело на имя .+ %(%d+%) рассмотрению не подлежит, ООП, объявите.') then
                local name, id = stext:match('Дело на имя (.+) %((%d+)%) рассмотрению не подлежит, ООП, объявите.')
                zaproop = true
                nikk = name
                if nikk ~= nil then
                    wait(50)
                    ftext(string.format("Поступил запрос на объявление ООП игрока {0C2265}%s", nikk:gsub('_', ' ')), -1)
                    ftext('Подтвердить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
                else
                    zaproop = false
                end
            end
			if stext:find('Дело на имя .+ %(%d+%) рассмотрению не подлежит, ООП, объявите.') then
                local name, id = stext:match('Дело на имя (.+) %((%d+)%) рассмотрению не подлежит, ООП, объявите.')
                zaproop = true
                nikk = name
                if nikk ~= nil then
                    wait(50)
                    ftext(string.format("Поступил запрос на объявление ООП игрока {0C2265}%s", nikk:gsub('_', ' ')), -1)
                    ftext('Подтвердить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
                else
                    zaproop = false
                end
            end
            if stext:find('Дело №%d+ на имя .+ рассмотрению не подлежит, ООП, объявите.') then
                local id, name = stext:match('Дело №(%d+) на имя (.+) рассмотрению не подлежит, ООП, объявите.')
                zaproop = true
                nikk = name
                if nikk ~= nil then
                    wait(50)
                    ftext(string.format("Поступил запрос на объявление ООП игрока {0C2265}%s", nikk:gsub('_', ' ')), -1)
                    ftext('Подтвердить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
                else
                    zaproop = false
                end
            end
        end
    end
    if nikk == nil then
        if aroop then aroop = false end
        if zaproop then zaproop = false end
        if dmoop then dmoop = false end
    end
end
function oopdakey()
	if msvidat then
		msda = true
		sampSendChat('/spy '..msid)
	end
	if mssnyat then
		sampSendChat('/spyoff '..msoffid)
		msoffid = nil
		mssnyat = false
	end
    if opyatstat then
        checkStats()
        opyatstat = false
    end
    if zaproop then
        sampSendChat(string.format('/d Mayor, дело на имя %s рассмотрению не подлежит, ООП', nikk:gsub('_', ' ')))
        zaproop = false
        nazhaloop = true
    end
    if dmoop then
        if frak == 'FBI' or frak == 'LSPD' or frak == 'SFPD' or frak == 'LVPD' then
            if rang == 'Кадет' or rang == 'Офицер' or rang == 'Мл.Сержант' or  rang == 'Сержант' or  rang == 'Прапорщик' then
                if not cfg.main.tarb then
                    sampSendChat(string.format('/r Дело на имя %s рассмотрению не подлежит, ООП.', nikk:gsub('_', ' ')))
                    dmoop = false
                else
                    sampSendChat(string.format('/r [%s]: Дело на имя %s рассмотрению не подлежит, ООП.', cfg.main.tar, nikk:gsub('_', ' ')))
                    dmoop = false
                end
            else
                sampSendChat(string.format('/d Mayor, дело на имя %s рассмотрению не подлежит, ООП КПЗ LSPD.', nikk:gsub('_', ' ')))
                dmoop = false
                nazhaloop = true
            end
        end
    end
    if aroop then
        if frak == 'FBI' or frak == 'LSPD' or frak == 'SFPD' or frak == 'LVPD' then
            if rang == 'Кадет' or rang == 'Офицер' or rang == 'Мл.Сержант' or  rang == 'Сержант' or  rang == 'Прапорщик' then
                if not cfg.main.tarb then
                    sampSendChat(string.format('/r Дело на имя %s рассмотрению не подлежит, ООП.', nikk:gsub('_', ' ')))
                    aroop = false
                    nikk = nil
                else
                    sampSendChat(string.format('/r [%s]: Дело на имя %s рассмотрению не подлежит, ООП.', cfg.main.tar, nikk:gsub('_', ' ')))
                    aroop = false
                    nikk = nil
                end
            else
                sampSendChat(string.format("/d Mayor, дело на имя %s рассмотрению не подлежит, ООП.", nikk:gsub('_', ' ')))
                aroop = false
                --nikk = nil
                nazhaloop = true
            end
        end
    end
end
function oopnetkey()
	msid = nil
	msda = false
	msvidat = nil
	mssnyat = false
	msoffid = nil
    if opyatstat then
        opyatstat = false
    end
    if dmoop == true then
        dmoop = false
        nikk = nil
        ftext("Рассмотр дела отменен.", -1)
    end
    if zaproop == true then
        zaproop = false
        nikk = nil
        ftext("Рассмотр дела отменен.", -1)
    end
    if aroop == true then
        aroop = false
        nikk = nil
        ftext("Рассмотр дела отменен.", -1)
    end
end
local russian_characters = {
    [168] = 'Ё', [184] = 'ё', [192] = 'А', [193] = 'Б', [194] = 'В', [195] = 'Г', [196] = 'Д', [197] = 'Е', [198] = 'Ж', [199] = 'З', [200] = 'И', [201] = 'Й', [202] = 'К', [203] = 'Л', [204] = 'М', [205] = 'Н', [206] = 'О', [207] = 'П', [208] = 'Р', [209] = 'С', [210] = 'Т', [211] = 'У', [212] = 'Ф', [213] = 'Х', [214] = 'Ц', [215] = 'Ч', [216] = 'Ш', [217] = 'Щ', [218] = 'Ъ', [219] = 'Ы', [220] = 'Ь', [221] = 'Э', [222] = 'Ю', [223] = 'Я', [224] = 'а', [225] = 'б', [226] = 'в', [227] = 'г', [228] = 'д', [229] = 'е', [230] = 'ж', [231] = 'з', [232] = 'и', [233] = 'й', [234] = 'к', [235] = 'л', [236] = 'м', [237] = 'н', [238] = 'о', [239] = 'п', [240] = 'р', [241] = 'с', [242] = 'т', [243] = 'у', [244] = 'ф', [245] = 'х', [246] = 'ц', [247] = 'ч', [248] = 'ш', [249] = 'щ', [250] = 'ъ', [251] = 'ы', [252] = 'ь', [253] = 'э', [254] = 'ю', [255] = 'я',
}
function string.rlower(s)
    s = s:lower()
    local strlen = s:len()
    if strlen == 0 then return s end
    s = s:lower()
    local output = ''
    for i = 1, strlen do
        local ch = s:byte(i)
        if ch >= 192 and ch <= 223 then -- upper russian characters
            output = output .. russian_characters[ch + 32]
        elseif ch == 168 then -- Ё
            output = output .. russian_characters[184]
        else
            output = output .. string.char(ch)
        end
    end
    return output
end
function string.rupper(s)
    s = s:upper()
    local strlen = s:len()
    if strlen == 0 then return s end
    s = s:upper()
    local output = ''
    for i = 1, strlen do
        local ch = s:byte(i)
        if ch >= 224 and ch <= 255 then -- lower russian characters
            output = output .. russian_characters[ch - 32]
        elseif ch == 184 then -- ё
            output = output .. russian_characters[168]
        else
            output = output .. string.char(ch)
        end
    end
    return output
end
function submenus_show(menu, caption, select_button, close_button, back_button)
    select_button, close_button, back_button = select_button or '»', close_button or 'x', back_button or '«'
    prev_menus = {}
    function display(menu, id, caption)
        local string_list = {}
        for i, v in ipairs(menu) do
            table.insert(string_list, type(v.submenu) == 'table' and v.title .. ' »' or v.title)
        end
        sampShowDialog(id, caption, table.concat(string_list, '\n'), select_button, (#prev_menus > 0) and back_button or close_button, sf.DIALOG_STYLE_LIST)
        repeat
            wait(0)
            local result, button, list = sampHasDialogRespond(id)
            if result then
                if button == 1 and list ~= -1 then
                    local item = menu[list + 1]
                    if type(item.submenu) == 'table' then -- submenu
                        table.insert(prev_menus, {menu = menu, caption = caption})
                        if type(item.onclick) == 'function' then
                            item.onclick(menu, list + 1, item.submenu)
                        end
                        return display(item.submenu, id + 1, item.submenu.title and item.submenu.title or item.title)
                    elseif type(item.onclick) == 'function' then
                        local result = item.onclick(menu, list + 1)
                        if not result then return result end
                        return display(menu, id, caption)
                    end
                else -- if button == 0
                    if #prev_menus > 0 then
                        local prev_menu = prev_menus[#prev_menus]
                        prev_menus[#prev_menus] = nil
                        return display(prev_menu.menu, id - 1, prev_menu.caption)
                    end
                    return false
                end
            end
        until result
    end
    return display(menu, 31337, caption or menu.title)
end
local yrisdkld1404 = {
    {
        title = '{ffffff}LSPD',
        onclick = function()
            sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
        end
    },
    {
        title = '{ffffff}SFPD',
        onclick = function()
            sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
        end
    }
}
local yrisdkld1405 = {
    {
        title = '{ffffff}LSPD',
        onclick = function()
            sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
        end
    },
    {
        title = '{ffffff}LVPD',
        onclick = function()
            sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
        end
    }
}
local yrisdkld1406 = {
    {
        title = '{ffffff}SFPD',
        onclick = function()
            sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
        end
    },
    {
        title = '{ffffff}LVPD',
        onclick = function()
            sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
        end
    }
}
function sumenu(args)
    return
    {
      {
        title = '{5b83c2}« Раздел №1 »',
        onclick = function()
        end
      },
      {
        title = '{ffffff}» Избиение - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Избиение")
        end
      },
      {
        title = '{ffffff}» Вооруженное нападение на гражданского - {ff0000}3 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 3 Вооруженное нападение на гражданского")
        end
      },
      {
        title = '{ffffff}» Вооруженное нападение на гос.служащего - {ff0000}6 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 6 Вооруженное нападение на ПО")
        end
      },
      {
        title = '{ffffff}» Убийство человека - {ff0000}3 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 3 Убийство человека")
        end
      },
      {
        title = '{ffffff}» Хулиганство - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Хулиганство")
        end
      },
      {
        title = '{ffffff}» Неадекватное поведение - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Неадекватное поведение")
        end
      },
      {
        title = '{ffffff}» Попрошайничество - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Попрошайничество")
        end
      },
      {
        title = '{ffffff}» Оскорбление - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Оскорбление")
        end
      },
      {
        title = '{ffffff}» Наезд на пешехода - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Наезд на пешехода")
        end
      },
      {
        title = '{ffffff}» Игнорирование спец.сигнала - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Игнорирование спец.сигнала")
        end
      },
      {
        title = '{ffffff}» Угон транспортного средства - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Угон транспортного средства")
        end
      },
      {
        title = '{ffffff}» Порча чужого имущества - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.. " 1 Порча чужого имущества")
        end
      },
      {
        title = '{ffffff}» Уничтожение чужого имущества - {ff0000}4 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 4 Уничтожение чужого имущества")
        end
      },
      {
        title = '{ffffff}» Неподчинение сотруднику ПО - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Неподчинение сотруднику ПО")
        end
      },
      {
        title = '{ffffff}» Уход от сотрудника ПО - {ff0000}2 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 2 Уход от сотрудника ПО")
        end
      },
      {
          title = '{ffffff}» Уход с места ДТП - {ff0000}3 уровень розыска',
          onclick = function()
            sampSendChat('/su '..args.. ' 3 Уход с места ДТП')
          end
      },
      {
        title = '{ffffff}» Побег из места заключения - {ff0000}6 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 6 Побег из места заключения")
        end
      },
      {
        title = '{ffffff}» Проникновение на охраняемую территорию - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Проникновение на охр. территорию")
        end
      },
      {
        title = '{ffffff}» Провокация - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Провокация")
        end
      },
      {
        title = '{ffffff}» Угрозы - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Угрозы")
        end
      },
      {
        title = '{ffffff}» Предложение интим. услуг - {ff0000}1 уровень розыска',
        onclick = function()
          sampSendChat('/su '..args..' 1 Предложение интимных услуг')
        end
      },
      {
        title = '{ffffff}» Изнасилование - {ff0000}3 уровень розыска',
        onclick = function()
          sampSendChat('/su '..args..' 3 Изнасилование')
        end
      },
      {
        title = '{ffffff}» Чистосердечное признание - {ff0000}1 уровень розыска.',
        onclick = function()
          local result = isCharInAnyCar(PLAYER_PED)
          if result then
            sampSendChat("/clear "..args)
            wait(1200)
            sampSendChat("/su "..args.." 1 Чистосердечное признание")
          else
            sampAddChatMessage("{0C2265}FBI Tools {FFFFFF}| You have to be in the car", -1)
          end
        end
      },
      {
        title = '{ffbc54}« Раздел №2 »',
        onclick = function()
        end
      },
      {
        title = '{ffffff}» Хранение материалов - {ff0000}3 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 3 Хранение материалов")
        end
      },
      {
        title = '{ffffff}» Хранение наркотиков - {ff0000}3 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 3 Хранение наркотиков")
        end
      },
      {
        title = '{ffffff}» Продажа ключей от камеры - {ff0000}6 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 6 Продажа ключей от камеры")
        end
      },
      {
        title = '{ffffff}» Употребление наркотиков - {ff0000}3 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 3 Употребление наркотиков")
        end
      },
      {
        title = '{ffffff}» Продажа наркотиков - {ff0000}2 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 2 Продажа наркотиков")
        end
      },
      {
        title = '{ffffff}» Покупка военной формы - {ff0000}2 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 2 Покупка военной формы")
        end
      },
      {
        title = '{ffffff}» Предложение взятки гос.служащему - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Предложение взятки гос.служащему")
        end
      },
      {
        title = '{ae0620}« Раздел №3 »',
        onclick = function()
        end
      },
      {
        title = '{ffffff}» Уход в AFK от ареста - {ff0000}6 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 6 Уход")
        end
      },
      {
        title = '{ffffff}» Совершение терракта - {ff0000}6 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 6 Совершение теракта")
        end
      },
      {
        title = '{ffffff}» Неуплата штрафа - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Неуплата штрафа")
        end
      },
      {
        title = '{ffffff}» Превышение полномочий адвоката - {ff0000}3 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 3 Превышение полномочий адвоката")
        end
      },
      {
        title = '{ffffff}» Похищение гражданского/гос.служащего - {ff0000}4 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 4 Похищение")
        end
      },
      {
        title = '{ffffff}» Статус ООП - {ff0000}6 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 6 ООП")
        end
      }
    }
end
function pkmmenu(id)
    return
    {
      {
        title = "{ffffff}» Надеть наручники",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me заломал руки "..sampGetPlayerNickname(id).." и достал наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/me заломала руки "..sampGetPlayerNickname(id).." и достала наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
        end
      },
      {
        title = "{ffffff}» Вести за собой",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me взял под руку "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/follow "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/me взяла под руку "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/follow "..id)
          end
        end
      },
      {
        title = "{ffffff}» Произвести обыск",
        onclick = function()
          if cfg.main.male == true then
			sampSendChat("/me достал перчатки")
            wait(3500)
			sampSendChat("/me надел перчатки")
            wait(3000)
			sampSendChat("/me похлопал по торсу задержанного")
            wait(3500)
            sampSendChat("/take "..id)
          end
          if cfg.main.male == false then
			sampSendChat("/do На руках спец. перчатки.")
            wait(7000)
			sampSendChat("/me похлопала по торсу "..sampGetPlayerNickname(id))
            wait(7000)
            sampSendChat("/take "..id)
          end
        end
      },
      {
        title = "{ffffff}» Произвести арест",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me достал ключи от камеры, открыв ее")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me затолкнул "..sampGetPlayerNickname(id).." в камеру")
            wait(cfg.commands.zaderjka)
            sampSendChat("/arrest "..id)
            wait(cfg.commands.zaderjka)
            sampSendChat("/me закрыл камеру, убрав ключи в карман")
          end
          if cfg.main.male == false then
            sampSendChat("/me достала ключи от камеры, открыв ее")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me затолкнула "..sampGetPlayerNickname(id).." в камеру")
            wait(cfg.commands.zaderjka)
            sampSendChat("/arrest "..id)
            wait(cfg.commands.zaderjka)
            sampSendChat("/me закрыла камеру, убрав ключи в карман")
          end
        end
      },
      {
        title = '{ffffff}» Снять наручники',
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me снял наручники с "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/uncuff "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/me сняла наручники с "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/uncuff "..id)
          end
        end
      },
      {
        title = "{ffffff}» Выдать розыск за проникновение",
        onclick = function()
          sampSendChat("/su "..id.." 2 Проникновение на охр. территорию")
        end
      },
      {
        title = "{ffffff}» Выдать розыск за хранение наркотиков",
        onclick = function()
          sampSendChat("/su "..id.." 3 Хранение наркотиков")
        end
      },
      {
        title = "{ffffff}» Выдать розыск за хранение материалов",
        onclick = function()
          sampSendChat("/su "..id.." 3 Хранение материалов")
        end
      },
      {
        title = "{ffffff}» Выдать розыск за продажу наркотиков",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/su "..id.." 2 Продажа наркотиков")
            wait(1200)
            sampSendChat("/me заломал руки "..sampGetPlayerNickname(id).." и достал наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/su "..id.." 2 Продажа наркотиков")
            wait(1200)
            sampSendChat("/me заломала руки "..sampGetPlayerNickname(id).." и достала наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
        end
      },
      {
        title = "{ffffff}» Выдать розыск за продажу оружия",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/su "..id.." 2 Продажа нелегального оружия")
            wait(1200)
            sampSendChat("/me заломал руки "..sampGetPlayerNickname(id).." и достал наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/su "..id.." 2 Продажа нелегального оружия")
            wait(1200)
            sampSendChat("/me заломала руки "..sampGetPlayerNickname(id).." и достала наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
        end
      },
	  {
        title = "{ffffff}» Выдать розыск за продажу ключей от камеры",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/su "..id.." 6 Продажа ключей от камеры")
            wait(1200)
            sampSendChat("/me заломал руки "..sampGetPlayerNickname(id).." и достал наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/su "..id.." 6 Продажа ключей от камеры")
            wait(1200)
            sampSendChat("/me заломала руки "..sampGetPlayerNickname(id).." и достала наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
        end
      },
      {
        title = "{ffffff}» Выдать розыск за вооруженное нападение на ПО",
        onclick = function()
          sampSendChat("/su "..id.. " 6 Вооруженное нападение на ПО")
        end
      },
      {
        title = "{ffffff}» Выдать розыск",
        onclick = function()
          pID = tonumber(args)
          submenus_show(sumenu(id), "{0C2265}FBI Tools {ffffff}| "..sampGetPlayerNickname(id).."["..id.."] ")
        end
      },
      {
        title = '{ffffff}» Данные о судимости',
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me достал мобильный компьютер")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me пробил "..sampGetPlayerNickname(id).." в базе данных")
            wait(cfg.commands.zaderjka)
            sampSendChat("/mdc "..id)
            wait(cfg.commands.zaderjka)
            sampSendChat("/me распечатал информацию")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me передал информацию человек напротив")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me убрал мобильный компьютер")
          end
        end
      },
	  {
        title = '{ffffff}» Сорвать маску',
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/offmask "..id)
          end
        end
      },
	  {
        title = '{ffffff}» Заполнить акт-задержания',
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me достал бланк задержания")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me заполнил бланк задержания на имя "..sampGetPlayerNickname(id).."")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me поставил подпись")
            wait(cfg.commands.zaderjka)
            sampSendChat("Расписываться будете?")
          end
        end
      },
	  {
        title = "{ffffff}» Аннулировать лицензию на вождение",
        onclick = function()
          if cfg.main.male == true then
			sampSendChat("/me достал КПК и аннулировал лицензию на вождение у "..sampGetPlayerNickname(id):gsub('_', ' '))
            wait(1200)
            sampSendChat("/take "..id)
          end
          if cfg.main.male == false then
			sampSendChat("/me достала КПК и аннулировала лицензию на вождение у "..sampGetPlayerNickname(id):gsub('_', ' '))
            wait(1200)
            sampSendChat("/take "..id)
          end
        end
      },
	  {
        title = "{ffffff}» Аннулировать лицензию на оружие",
        onclick = function()
          if cfg.main.male == true then
			sampSendChat("/me достал КПК и аннулировал лицензию на оружие у "..sampGetPlayerNickname(id):gsub('_', ' '))
            wait(1200)
            sampSendChat("/take "..id)
          end
          if cfg.main.male == false then
			sampSendChat("/me достала КПК и аннулировала лицензию на оружие у "..sampGetPlayerNickname(id):gsub('_', ' '))
            wait(1200)
            sampSendChat("/take "..id)
          end
        end
      }
    }
end
function commands()
    sampRegisterChatCommand('abp', function()
      cfg.main.autobp = not cfg.main.autobp
      ftext(("Авто-БП %s"):format(cfg.main.autobp and "включен" or "выключен"))      
    end)
	sampRegisterChatCommand('idn', function(text)
	local id = sampGetPlayerIdByNickname(text)
		if id then ftext(text..'['..id..']') end
	end)
	sampRegisterChatCommand('ttest5', ttest5)
	sampRegisterChatCommand('ttest3', ttest3)
	sampRegisterChatCommand('ttest2', ttest2)
	sampRegisterChatCommand('test', getpos)
	sampRegisterChatCommand('getcode', getcode)
	sampRegisterChatCommand('wa', warehouse)
    sampRegisterChatCommand('fkv', fkv)
	sampRegisterChatCommand('dklld', dklld)
	sampRegisterChatCommand('ttest', ttest)
	sampRegisterChatCommand('ttest1', ttest1)
	sampRegisterChatCommand('e', ers)
	sampRegisterChatCommand('mrs', mrs)
	sampRegisterChatCommand('mrs1', mrs1)
	sampRegisterChatCommand('mrs2', mrs2)
	sampRegisterChatCommand('prs', prs)
	sampRegisterChatCommand('m16', m16)
	sampRegisterChatCommand('rt', rt)
    sampRegisterChatCommand('ooplist', ooplist)
	sampRegisterChatCommand('cg', clearg)
	sampRegisterChatCommand('ud', udost)
    sampRegisterChatCommand('mb', members)
    sampRegisterChatCommand('ticket', ticket)
    sampRegisterChatCommand('dlog', dlog)
    sampRegisterChatCommand('rlog', rlog)
    sampRegisterChatCommand('sulog', sulog)
    sampRegisterChatCommand('smslog', smslog)
    sampRegisterChatCommand('ftazer', ftazer)
    sampRegisterChatCommand('kmdc', kmdc)
    sampRegisterChatCommand('su', su)
    sampRegisterChatCommand('ssu', ssu)
    sampRegisterChatCommand('megaf', megaf)
	sampRegisterChatCommand('dkll', dkll)
	sampRegisterChatCommand('ystp', ystp)
    sampRegisterChatCommand('tazer', tazer)
    sampRegisterChatCommand('keys', keys)
    sampRegisterChatCommand('oop', oop)
    sampRegisterChatCommand('cput', cput)
    sampRegisterChatCommand('ceject', ceject)
    if sampIsChatCommandDefined('st') then sampUnregisterChatCommand('st') end
    sampRegisterChatCommand('st', st)
    sampRegisterChatCommand('deject', deject)
    sampRegisterChatCommand('rh', rh)
    sampRegisterChatCommand('gr', gr)
    sampRegisterChatCommand('warn', warn)
    sampRegisterChatCommand('ms', ms)
    sampRegisterChatCommand('ar', ar)
    sampRegisterChatCommand('r', r)
    sampRegisterChatCommand('f', f)
    sampRegisterChatCommand('fthelp', fthelp)
    sampRegisterChatCommand("fst", fst)
    sampRegisterChatCommand("fsw", fsw)
    sampRegisterChatCommand('fshp', fshp)
    sampRegisterChatCommand('fyk', fyk)
    sampRegisterChatCommand('fys', fys)
    sampRegisterChatCommand('ffp', ffp)
    sampRegisterChatCommand('fak', fak)
	sampRegisterChatCommand('zbr', zbr)
    sampRegisterChatCommand('dmb', dmb)
    sampRegisterChatCommand('dkld', dkld)
    sampRegisterChatCommand('fvz', fvz)
    sampRegisterChatCommand('fbd', fbd)
    sampRegisterChatCommand('blg', blg)
    sampRegisterChatCommand('cc', cc)
    sampRegisterChatCommand('df', df)
    sampRegisterChatCommand('mcheck', mcheck)
    sampfuncsRegisterConsoleCommand('gppc', function() print(getCharCoordinates(PLAYER_PED)) end)
    sampRegisterChatCommand('yk', function() ykwindow.v = not ykwindow.v end)
    sampRegisterChatCommand('fp', function() fpwindow.v = not fpwindow.v end)
    sampRegisterChatCommand('ys', function() yswindow.v = not yswindow.v end)
    if sampIsChatCommandDefined('ak') then sampUnregisterChatCommand('ak') end
    sampRegisterChatCommand('ak', function() akwindow.v = not akwindow.v end)
	sampRegisterChatCommand('ten', function() tenwindow.v = not tenwindow.v end)
    sampRegisterChatCommand('shp',function() shpwindow.v = not shpwindow.v end)
    sampRegisterChatCommand('ft', function() mainwin.v = not mainwin.v end)
    sampRegisterChatCommand('hudpos', function()
        if cfg.main.hud then
            if not changetextpos then
                changetextpos = true
                ftext('По завешению введите команду еще раз.')
            else
                changetextpos = false
            end
        else
            ftext('Для начала включите инфо-бар.')
        end
    end)
    sampfuncsRegisterConsoleCommand('gppc', function() 
        local mxx, myy, mzz = getCharCoordinates(PLAYER_PED)
        print(string.format('%s, %s, %s', mxx, myy, mzz))
    end)
end
function getCarNamebyModel(model)
    local names = {
      [400] = 'Landstalker',
      [401] = 'Bravura',
      [402] = 'Buffalo',
      [403] = 'Linerunner',
      [404] = 'Perennial',
      [405] = 'Sentinel',
      [406] = 'Dumper',
      [407] = 'Firetruck',
      [408] = 'Trashmaster',
      [409] = 'Stretch',
      [410] = 'Manana',
      [411] = 'Infernus',
      [412] = 'Voodoo',
      [413] = 'Pony',
      [414] = 'Mule',
      [415] = 'Cheetah',
      [416] = 'Ambulance',
      [417] = 'Leviathan',
      [418] = 'Moonbeam',
      [419] = 'Esperanto',
      [420] = 'Taxi',
      [421] = 'Washington',
      [422] = 'Bobcat',
      [423] = 'Mr. Whoopee',
      [424] = 'BF Injection',
      [425] = 'Hunter',
      [426] = 'Premier',
      [427] = 'Enforcer',
      [428] = 'Securicar',
      [429] = 'Banshee',
      [430] = 'Predator',
      [431] = 'Bus',
      [432] = 'Rhino',
      [433] = 'Barracks',
      [434] = 'Hotknife',
      [435] = 'Article Trailer',
      [436] = 'Previon',
      [437] = 'Coach',
      [438] = 'Cabbie',
      [439] = 'Stallion',
      [440] = 'Rumpo',
      [441] = 'RC Bandit',
      [442] = 'Romero',
      [443] = 'Packer',
      [444] = 'Monster',
      [445] = 'Admiral',
      [446] = 'Squallo',
      [447] = 'Seaspamrow',
      [448] = 'Pizzaboy',
      [449] = 'Tram',
      [450] = 'Article Trailer 2',
      [451] = 'Turismo',
      [452] = 'Speeder',
      [453] = 'Reefer',
      [454] = 'Tropic',
      [455] = 'Flatbed',
      [456] = 'Yankee',
      [457] = 'Caddy',
      [458] = 'Solair',
      [459] = 'Topfun Van',
      [460] = 'Skimmer',
      [461] = 'PCJ-600',
      [462] = 'Faggio',
      [463] = 'Freeway',
      [464] = 'RC Baron',
      [465] = 'RC Raider',
      [466] = 'Glendale',
      [467] = 'Oceanic',
      [468] = 'Sanchez',
      [469] = 'Spamrow',
      [470] = 'Patriot',
      [471] = 'Quad',
      [472] = 'Coastguard',
      [473] = 'Dinghy',
      [474] = 'Hermes',
      [475] = 'Sabre',
      [476] = 'Rustler',
      [477] = 'ZR-350',
      [478] = 'Walton',
      [479] = 'Regina',
      [480] = 'Comet',
      [481] = 'BMX',
      [482] = 'Burrito',
      [483] = 'Camper',
      [484] = 'Marquis',
      [485] = 'Baggage',
      [486] = 'Dozer',
      [487] = 'Maverick',
      [488] = 'News Maverick',
      [489] = 'Rancher',
      [490] = 'FBI Rancher',
      [491] = 'Virgo',
      [492] = 'Greenwood',
      [493] = 'Jetmax',
      [494] = 'Hotring Racer',
      [495] = 'Sandking',
      [496] = 'Blista Compact',
      [497] = 'Police Maverick',
      [498] = 'Boxville',
      [499] = 'Benson',
      [500] = 'Mesa',
      [501] = 'RC Goblin',
      [502] = 'Hotring Racer A',
      [503] = 'Hotring Racer B',
      [504] = 'Bloodring Banger',
      [505] = 'Rancher',
      [506] = 'Super GT',
      [507] = 'Elegant',
      [508] = 'Journey',
      [509] = 'Bike',
      [510] = 'Mountain Bike',
      [511] = 'Beagle',
      [512] = 'Cropduster',
      [513] = 'Stuntplane',
      [514] = 'Tanker',
      [515] = 'Roadtrain',
      [516] = 'Nebula',
      [517] = 'Majestic',
      [518] = 'Buccaneer',
      [519] = 'Shamal',
      [520] = 'Hydra',
      [521] = 'FCR-900',
      [522] = 'NRG-500',
      [523] = 'HPV1000',
      [524] = 'Cement Truck',
      [525] = 'Towtruck',
      [526] = 'Fortune',
      [527] = 'Cadrona',
      [528] = 'FBI Truck',
      [529] = 'Willard',
      [530] = 'Forklift',
      [531] = 'Tractor',
      [532] = 'Combine',
      [533] = 'Feltzer',
      [534] = 'Remington',
      [535] = 'Slamvan',
      [536] = 'Blade',
      [537] = 'Train',
      [538] = 'Train',
      [539] = 'Vortex',
      [540] = 'Vincent',
      [541] = 'Bullet',
      [542] = 'Clover',
      [543] = 'Sadler',
      [544] = 'Firetruck',
      [545] = 'Hustler',
      [546] = 'Intruder',
      [547] = 'Primo',
      [548] = 'Cargobob',
      [549] = 'Tampa',
      [550] = 'Sunrise',
      [551] = 'Merit',
      [552] = 'Utility Van',
      [553] = 'Nevada',
      [554] = 'Yosemite',
      [555] = 'Windsor',
      [556] = 'Monster A',
      [557] = 'Monster B',
      [558] = 'Uranus',
      [559] = 'Jester',
      [560] = 'Sultan',
      [561] = 'Stratum',
      [562] = 'Elegy',
      [563] = 'Raindance',
      [564] = 'RC Tiger',
      [565] = 'Flash',
      [566] = 'Tahoma',
      [567] = 'Savanna',
      [568] = 'Bandito',
      [569] = 'Train',
      [570] = 'Train',
      [571] = 'Kart',
      [572] = 'Mower',
      [573] = 'Dune',
      [574] = 'Sweeper',
      [575] = 'Broadway',
      [576] = 'Tornado',
      [577] = 'AT400',
      [578] = 'DFT-30',
      [579] = 'Huntley',
      [580] = 'Stafford',
      [581] = 'BF-400',
      [582] = 'Newsvan',
      [583] = 'Tug',
      [584] = 'Petrol Trailer',
      [585] = 'Emperor',
      [586] = 'Wayfarer',
      [587] = 'Euros',
      [588] = 'Hotdog',
      [589] = 'Club',
      [590] = 'Train',
      [591] = 'Article Trailer 3',
      [592] = 'Andromada',
      [593] = 'Dodo',
      [594] = 'RC Cam',
      [595] = 'Launch',
      [596] = 'Police Car LS',
      [597] = 'Police Car SF',
      [598] = 'Police Car LV',
      [599] = 'Police Ranger',
      [600] = 'Picador',
      [601] = 'S.W.A.T.',
      [602] = 'Alpha',
      [603] = 'Phoenix',
      [604] = 'Glendale',
      [605] = 'Sadler',
      [606] = 'Baggage Trailer',
      [607] = 'Baggage Trailer',
      [608] = 'Tug Stairs Trailer',
      [609] = 'Boxville',
      [610] = 'Farm Trailer',
      [611] = 'Utility Traileraw '
    }
    return names[model]
end
function getFraktionBySkin(playerid)
    fraks = {
        [0] = 'Гражданский',
        [1] = 'Гражданский',
        [2] = 'Гражданский',
        [3] = 'Гражданский',
        [4] = 'Гражданский',
        [5] = 'Гражданский',
        [6] = 'Гражданский',
        [7] = 'Гражданский',
        [8] = 'Гражданский',
        [9] = 'Гражданский',
        [10] = 'Гражданский',
        [11] = 'Гражданский',
        [12] = 'Гражданский',
        [13] = 'Гражданский',
        [14] = 'Гражданский',
        [15] = 'Гражданский',
        [16] = 'Гражданский',
        [17] = 'Гражданский',
        [18] = 'Гражданский',
        [19] = 'Гражданский',
        [20] = 'Гражданский',
        [21] = 'Ballas',
        [22] = 'Гражданский',
        [23] = 'Гражданский',
        [24] = 'Гражданский',
        [25] = 'Гражданский',
        [26] = 'Гражданский',
        [27] = 'Гражданский',
        [28] = 'Гражданский',
        [29] = 'Гражданский',
        [30] = 'Rifa',
        [31] = 'Гражданский',
        [32] = 'Гражданский',
        [33] = 'Гражданский',
        [34] = 'Гражданский',
        [35] = 'Гражданский',
        [36] = 'Гражданский',
        [37] = 'Гражданский',
        [38] = 'Гражданский',
        [39] = 'Гражданский',
        [40] = 'Гражданский',
        [41] = 'Aztec',
        [42] = 'Гражданский',
        [43] = 'Гражданский',
        [44] = 'Aztec',
        [45] = 'Гражданский',
        [46] = 'Гражданский',
        [47] = 'Vagos',
        [48] = 'Aztec',
        [49] = 'Гражданский',
        [50] = 'Гражданский',
        [51] = 'Гражданский',
        [52] = 'Гражданский',
        [53] = 'Гражданский',
        [54] = 'Гражданский',
        [55] = 'Гражданский',
        [56] = 'Grove',
        [57] = 'Мэрия',
        [58] = 'Гражданский',
        [59] = 'Автошкола',
        [60] = 'Гражданский',
        [61] = 'Армия',
        [62] = 'Гражданский',
        [63] = 'Гражданский',
        [64] = 'Гражданский',
        [65] = 'Гражданский', -- над подумать
        [66] = 'Гражданский',
        [67] = 'Гражданский',
        [68] = 'Гражданский',
        [69] = 'Гражданский',
        [70] = 'МОН',
        [71] = 'Гражданский',
        [72] = 'Гражданский',
        [73] = 'Army',
        [74] = 'Гражданский',
        [75] = 'Гражданский',
        [76] = 'Гражданский',
        [77] = 'Гражданский',
        [78] = 'Гражданский',
        [79] = 'Гражданский',
        [80] = 'Гражданский',
        [81] = 'Гражданский',
        [82] = 'Гражданский',
        [83] = 'Гражданский',
        [84] = 'Гражданский',
        [85] = 'Гражданский',
        [86] = 'Grove',
        [87] = 'Гражданский',
        [88] = 'Гражданский',
        [89] = 'Гражданский',
        [90] = 'Гражданский',
        [91] = 'Гражданский', -- под вопросом
        [92] = 'Гражданский',
        [93] = 'Гражданский',
        [94] = 'Гражданский',
        [95] = 'Гражданский',
        [96] = 'Гражданский',
        [97] = 'Гражданский',
        [98] = 'Мэрия',
        [99] = 'Гражданский',
        [100] = 'Байкер',
        [101] = 'Гражданский',
        [102] = 'Ballas',
        [103] = 'Ballas',
        [104] = 'Ballas',
        [105] = 'Grove',
        [106] = 'Grove',
        [107] = 'Grove',
        [108] = 'Vagos',
        [109] = 'Vagos',
        [110] = 'Vagos',
        [111] = 'RM',
        [112] = 'RM',
        [113] = 'LCN',
        [114] = 'Aztec',
        [115] = 'Aztec',
        [116] = 'Aztec',
        [117] = 'Yakuza',
        [118] = 'Yakuza',
        [119] = 'Rifa',
        [120] = 'Yakuza',
        [121] = 'Гражданский',
        [122] = 'Гражданский',
        [123] = 'Yakuza',
        [124] = 'LCN',
        [125] = 'RM',
        [126] = 'RM',
        [127] = 'LCN',
        [128] = 'Гражданский',
        [129] = 'Гражданский',
        [130] = 'Гражданский',
        [131] = 'Гражданский',
        [132] = 'Гражданский',
        [133] = 'Гражданский',
        [134] = 'Гражданский',
        [135] = 'Гражданский',
        [136] = 'Гражданский',
        [137] = 'Гражданский',
        [138] = 'Гражданский',
        [139] = 'Гражданский',
        [140] = 'Гражданский',
        [141] = 'FBI',
        [142] = 'Гражданский',
        [143] = 'Гражданский',
        [144] = 'Гражданский',
        [145] = 'Гражданский',
        [146] = 'Гражданский',
        [147] = 'Мэрия',
        [148] = 'Гражданский',
        [149] = 'Grove',
        [150] = 'Мэрия',
        [151] = 'Гражданский',
        [152] = 'Гражданский',
        [153] = 'Гражданский',
        [154] = 'Гражданский',
        [155] = 'Гражданский',
        [156] = 'Гражданский',
        [157] = 'Гражданский',
        [158] = 'Гражданский',
        [159] = 'Гражданский',
        [160] = 'Гражданский',
        [161] = 'Гражданский',
        [162] = 'Гражданский',
        [163] = 'FBI',
        [164] = 'FBI',
        [165] = 'FBI',
        [166] = 'FBI',
        [167] = 'Гражданский',
        [168] = 'Гражданский',
        [169] = 'Yakuza',
        [170] = 'Гражданский',
        [171] = 'Гражданский',
        [172] = 'Гражданский',
        [173] = 'Rifa',
        [174] = 'Rifa',
        [175] = 'Rifa',
        [176] = 'Гражданский',
        [177] = 'Гражданский',
        [178] = 'Гражданский',
        [179] = 'Army',
        [180] = 'Гражданский',
        [181] = 'Байкер',
        [182] = 'Гражданский',
        [183] = 'Гражданский',
        [184] = 'Гражданский',
        [185] = 'Гражданский',
        [186] = 'Yakuza',
        [187] = 'Мэрия',
        [188] = 'СМИ',
        [189] = 'Гражданский',
        [190] = 'Vagos',
        [191] = 'Army',
        [192] = 'Гражданский',
        [193] = 'Aztec',
        [194] = 'Гражданский',
        [195] = 'Ballas',
        [196] = 'Гражданский',
        [197] = 'Гражданский',
        [198] = 'Гражданский',
        [199] = 'Гражданский',
        [200] = 'Гражданский',
        [201] = 'Гражданский',
        [202] = 'Гражданский',
        [203] = 'Гражданский',
        [204] = 'Гражданский',
        [205] = 'Гражданский',
        [206] = 'Гражданский',
        [207] = 'Гражданский',
        [208] = 'Yakuza',
        [209] = 'Гражданский',
        [210] = 'Гражданский',
        [211] = 'СМИ',
        [212] = 'Гражданский',
        [213] = 'Гражданский',
        [214] = 'LCN',
        [215] = 'Гражданский',
        [216] = 'Гражданский',
        [217] = 'СМИ',
        [218] = 'Гражданский',
        [219] = 'МОН',
        [220] = 'Гражданский',
        [221] = 'Гражданский',
        [222] = 'Гражданский',
        [223] = 'LCN',
        [224] = 'Гражданский',
        [225] = 'Гражданский',
        [226] = 'Rifa',
        [227] = 'Мэрия',
        [228] = 'Гражданский',
        [229] = 'Гражданский',
        [230] = 'Гражданский',
        [231] = 'Гражданский',
        [232] = 'Гражданский',
        [233] = 'Гражданский',
        [234] = 'Гражданский',
        [235] = 'Гражданский',
        [236] = 'Гражданский',
        [237] = 'Гражданский',
        [238] = 'Гражданский',
        [239] = 'Гражданский',
        [240] = 'Автошкола',
        [241] = 'Гражданский',
        [242] = 'Гражданский',
        [243] = 'Гражданский',
        [244] = 'Гражданский',
        [245] = 'Гражданский',
        [246] = 'Байкер',
        [247] = 'Байкер',
        [248] = 'Байкер',
        [249] = 'Гражданский',
        [250] = 'СМИ',
        [251] = 'Гражданский',
        [252] = 'Army',
        [253] = 'Гражданский',
        [254] = 'Байкер',
        [255] = 'Army',
        [256] = 'Гражданский',
        [257] = 'Гражданский',
        [258] = 'Гражданский',
        [259] = 'Гражданский',
        [260] = 'Гражданский',
        [261] = 'СМИ',
        [262] = 'Гражданский',
        [263] = 'Гражданский',
        [264] = 'Гражданский',
        [265] = 'Полиция',
        [266] = 'Полиция',
        [267] = 'Полиция',
        [268] = 'Гражданский',
        [269] = 'Grove',
        [270] = 'Grove',
        [271] = 'Grove',
        [272] = 'RM',
        [273] = 'Гражданский', -- надо подумать
        [274] = 'МОН',
        [275] = 'МОН',
        [276] = 'МОН',
        [277] = 'Гражданский',
        [278] = 'Гражданский',
        [279] = 'Гражданский',
        [280] = 'Полиция',
        [281] = 'Полиция',
        [282] = 'Полиция',
        [283] = 'Полиция',
        [284] = 'Полиция',
        [285] = 'Полиция',
        [286] = 'FBI',
        [287] = 'Army',
        [288] = 'Полиция',
        [289] = 'Гражданский',
        [290] = 'Гражданский',
        [291] = 'Гражданский',
        [292] = 'Aztec',
        [293] = 'Гражданский',
        [294] = 'Гражданский',
        [295] = 'Гражданский',
        [296] = 'Гражданский',
        [297] = 'Grove',
        [298] = 'Гражданский',
        [299] = 'Гражданский',
        [300] = 'Полиция',
        [301] = 'Полиция',
        [302] = 'Полиция',
        [303] = 'Полиция',
        [304] = 'Полиция',
        [305] = 'Полиция',
        [306] = 'Полиция',
        [307] = 'Полиция',
        [308] = 'МОН',
        [309] = 'Полиция',
        [310] = 'Полиция',
        [311] = 'Полиция'
    }
    if sampIsPlayerConnected(playerid) then
        local result, handle = sampGetCharHandleBySampPlayerId(playerid)
        local skin = getCharModel(handle)
        return fraks[skin]
    end
end
function kvadrat()
    local KV = {
        [1] = "А",
        [2] = "Б",
        [3] = "В",
        [4] = "Г",
        [5] = "Д",
        [6] = "Ж",
        [7] = "З",
        [8] = "И",
        [9] = "К",
        [10] = "Л",
        [11] = "М",
        [12] = "Н",
        [13] = "О",
        [14] = "П",
        [15] = "Р",
        [16] = "С",
        [17] = "Т",
        [18] = "У",
        [19] = "Ф",
        [20] = "Х",
        [21] = "Ц",
        [22] = "Ч",
        [23] = "Ш",
        [24] = "Я",
    }
    local X, Y, Z = getCharCoordinates(playerPed)
    X = math.ceil((X + 3000) / 250)
    Y = math.ceil((Y * - 1 + 3000) / 250)
    Y = KV[Y]
    local KVX = (Y.."-"..X)
    return KVX
end
function kvadrat1(param)
    local KV = {
        ["А"] = 1,
        ["Б"] = 2,
        ["В"] = 3,
        ["Г"] = 4,
        ["Д"] = 5,
        ["Ж"] = 6,
        ["З"] = 7,
        ["И"] = 8,
        ["К"] = 9,
        ["Л"] = 10,
        ["М"] = 11,
        ["Н"] = 12,
        ["О"] = 13,
        ["П"] = 14,
        ["Р"] = 15,
        ["С"] = 16,
        ["Т"] = 17,
        ["У"] = 18,
        ["Ф"] = 19,
        ["Х"] = 20,
        ["Ц"] = 21,
        ["Ч"] = 22,
        ["Ш"] = 23,
        ["Я"] = 24,
        ["а"] = 1,
        ["б"] = 2,
        ["в"] = 3,
        ["г"] = 4,
        ["д"] = 5,
        ["ж"] = 6,
        ["з"] = 7,
        ["и"] = 8,
        ["к"] = 9,
        ["л"] = 10,
        ["м"] = 11,
        ["н"] = 12,
        ["о"] = 13,
        ["п"] = 14,
        ["р"] = 15,
        ["с"] = 16,
        ["т"] = 17,
        ["у"] = 18,
        ["ф"] = 19,
        ["х"] = 20,
        ["ц"] = 21,
        ["ч"] = 22,
        ["ш"] = 23,
        ["я"] = 24,
    }
    return KV[param]
end
function longtoshort(long)
    local short =
    {
      ['Армия ЛВ'] = 'LVa',
      ['Армия СФ'] = 'SFa',
      ['ФБР'] = 'FBI'
    }
    return short[long]
end
local osnova =
{
  {
    title = "Лаборатория",
    onclick = function()
      local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
      if cfg.main.male == true then
        sampSendChat("/r Переоделся в сотрудника лаборатории.")
        wait(1200)
        sampSendChat("/rb "..myid)
      end
      if cfg.main.male == false then
        sampSendChat("/r Переоделась в сотрудника лаборатории.")
        wait(1200)
        sampSendChat("/rb "..myid)
      end
    end
  },
  {
    title = 'Гражданский',
    onclick = function()
      sampShowDialog(1385, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Полиция',
    onclick = function()
      sampShowDialog(1386, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Армия',
    onclick = function()
      sampShowDialog(1387, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'МЧС',
    onclick = function()
      sampShowDialog(1388, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Мэрия',
    onclick = function()
      sampShowDialog(1389, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Автошкола',
    onclick = function()
      sampShowDialog(1390, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'News',
    onclick = function()
      sampShowDialog(1391, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'LCN',
    onclick = function()
      sampShowDialog(1392, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Yakuza',
    onclick = function()
      sampShowDialog(1393, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Russian Mafia',
    onclick = function()
      sampShowDialog(1394, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Rifa',
    onclick = function()
      sampShowDialog(1395, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Grove Street',
    onclick = function()
      sampShowDialog(1396, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Ballas',
    onclick = function()
      sampShowDialog(1397, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Vagos',
    onclick = function()
      sampShowDialog(1398, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Aztec',
    onclick = function()
      sampShowDialog(1399, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = "Байкеры",
    onclick = function()
      sampShowDialog(1400, '{0C2265}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  }
}
local fthelpsub = 
{
    {
        title = '{0C2265}/ft {ffffff}- Открыть меню скрипта',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/ft')
        end
    },
    {
        title = '{0C2265}/st [id]{ffffff} - Попросить игрока заглушить свое Т/С через мегафон [/m]',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/st ')
        end
    },
    {
        title = '{0C2265}/oop [id]{ffffff} - Написать в волну департамента об ООП',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/oop ')
        end
    },
    {
        title = '{0C2265}/warn [id]{ffffff} - Предупредить игрока в волну департамента о нарушении подачи в розыск',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/warn ')
        end
    },
    {
        title = '{0C2265}/su [id]{ffffff} - Выдать розыск через диалог',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/su ')
        end
    },
    {
        title = '{0C2265}/ssu [id]{ffffff} - Выдать розыск через серверную команду',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/ssu ')
        end
    },
    {
        title = '{0C2265}/cput [id] [seat]{ffffff} - РП отыгровка посадки преступника в автомобиль/мото',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/cput ')
        end
    },
    {
        title = '{0C2265}/ceject [id]{ffffff} - РП отыгровка высадки преступника из автомобиля/мото',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/ceject ')
        end
    },
    {
        title = '{0C2265}/deject [id]{ffffff} - РП отыгровка вытаскивания преступника из автомобиля/мото',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/deject ')
        end
    },
    {
        title = '{0C2265}/ms [type]{ffffff} - РП отыгровка взятия маскировки',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/ms ')
        end
    },
    {
        title = '{0C2265}/keys{ffffff} - РП отыгровка сравнения ключей от КПЗ',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/keys')
        end
    },
    {
        title = '{0C2265}/rh [departament]{ffffff} - Запросить патрульный экипаж в текущий квадрат',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/rh ')
        end
    },
    {
        title = '{0C2265}/tazer{ffffff} - РП тайзер',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/tazer')
        end
    },
    {
        title = '{0C2265}/gr [departament] [reason]{ffffff} - Написать в волну департамента о пересечении юрисдикции',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/gr ')
        end
    },
    {
        title = '{0C2265}/df{ffffff} - Открыть диалог с разминированием бомб',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/df')
        end
    },
    {
        title = '{0C2265}/dmb{ffffff} - Открыть /members в диалоге',
        onclick = function()
            sampSetChatInputText('/dmb')
            sampSetChatInputEnabled(true)
        end
    },
    {
        title = '{ffffff}Продолжение',
        submenu =
        {
            {
                title = '{0C2265}/ar [army]{ffffff} - Попросить разрешение на въезд на военную территорию в волну департамента',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/ar ')
                end
            },
            {
                title = '{0C2265}/kmdc [id]{ffffff} - РП отыгровка фотографии человека через КПК',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/kmdc ')
                end
            },
            {
                title = '{0C2265}/ftazer [type]{ffffff} - РП отыгровка ftazer',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/ftazer ')
                end
            },
            {
                title = '{0C2265}/fvz [id]{ffffff} - Вызвать игрока в офис ФБР со старшими',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/fvz ')
                end
            },
            {
                title = '{0C2265}/fbd [id]{ffffff} - Запросить причину изменения БД по волне департамента',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/fbd ')
                end
            },
            {
                title = '{0C2265}/blg [id] [Фракция] [За что. За-]{ffffff} - Выразить благодарность по волне департамента',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/blg ')
                end
            },
			{
                title = '{0C2265}/zbr [id] [Фракция]{ffffff} - Забрал, не теряйте',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/zbr ')
                end
            },
            {
                title = '{0C2265}/r и /f{ffffff} - Автотег в рацию'
            },
            {
                title = '{0C2265}/ys{ffffff} - Открыть шпору УСТАВ',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/ys')
                end
            },
            {
                title = '{0C2265}/yk{ffffff} - Открыть шпору УК',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/yk')
                end
            },
            {
                title = '{0C2265}/fp{ffffff} - Открыть шпору ФП',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/fp')
                end
            },
            {
                title = '{0C2265}/ak{ffffff} - Открыть шпору АК',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/ak')
                end
            },
			{
                title = '{0C2265}/ten{ffffff} - Открыть шпору Тен-Кодов',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/ten')
                end
            },
            {
                title = '{0C2265}/shp{ffffff} - Открыть настраиваемую шпору',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/shp')
                end
            },
            {
                title = '{0C2265}/fyk{ffffff} - Поиск по УК шпоре',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/fyk')
                end
            },
            {
                title = '{0C2265}/ffp{ffffff} - Поиск по ФП шпоре',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/ffp')
                end
            },
            {
                title = '{0C2265}/fak{ffffff} - Поиск по АК шпоре',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/fak')
                end
            },
            {
                title = '{0C2265}/fshp{ffffff} - Поиск по настраиваемой шпоре',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/fshp')
                end
            },
            {
                title = '{0C2265}/fst{ffffff} - Изменить время',
                onclick = function()
                    sampSetChatInputEnabled(true)
                    sampSetChatInputText('/fst')
                end
            },
            {
                title = 'Продолжение',
                submenu = 
                {
                    {
                        title = '{0C2265}/fsw{ffffff} - Изменить погоду',
                        onclick = function()
                            sampSetChatInputEnabled(true)
                            sampSetChatInputText('/fsw')
                        end
                    },
                    {
                        title = '{0C2265}/cc{ffffff} - Очистить чат',
                        onclick = function()
                            sampSetChatInputEnabled(true)
                            sampSetChatInputText('/cc')
                        end
                    },
                    {
                        title = '{0C2265}/dkld{ffffff} - Сделать доклад',
                        onclick = function()
                            sampSetChatInputEnabled(true)
                            sampSetChatInputText('/dkld')
                        end
                    },
                    {
                        title = '{0C2265}/mcheck{ffffff} - Пробить по /mdc всех на расстоянии 200 метров',
                        onclick = function()
                            sampSetChatInputEnabled(true)
                            sampSetChatInputText('/mcheck')
                        end
                    },
                    {
                        title = '{0C2265}/megaf{ffffff} - Мегафон с автоопределением авто',
                        onclick = function()
                            sampSetChatInputEnabled(true)
                            sampSetChatInputText('/megaf')
                        end
                    },
                    {
                        title = '{0C2265}/rlog{ffffff} - Открыть лог 25 последних сообщений в рацию',
                        onclick = function()
                            sampSetChatInputText('/rlog')
                            sampSetChatInputEnabled(true)
                        end
                    },
                    {
                        title = '{0C2265}/dlog{ffffff} - Открыть лог 25 последних сообщений в департамент',
                        onclick = function()
                            sampSetChatInputText('/dlog')
                            sampSetChatInputEnabled(true)
                        end
                    },
                    {
                        title = '{0C2265}/sulog{ffffff} - Открыть лог 25 последних выдачи розыска',
                        onclick = function()
                            sampSetChatInputText('/sulog')
                            sampSetChatInputEnabled(true)
                        end
                    },
					{
					title = '{0C2265}/ooplist [id(не опционально)]{ffffff} - Список ООП',
                        onclick = function()
                            sampSetChatInputText('/ooplist ')
                            sampSetChatInputEnabled(true)
                        end
                    },
                    {
                        title = '{0C2265}/smslog{ffffff} - Открыть лог 25 последних SMS',
                        onclick = function()
                            sampSetChatInputText('/smslog')
                            sampSetChatInputEnabled(true)
                        end
                    }
                }
            }
        }
    }
}
function apply_custom_style()
  imgui.SwitchContext()
  local style = imgui.GetStyle()
  local colors = style.Colors
  local clr = imgui.Col
  local ImVec4 = imgui.ImVec4
  local ImVec2 = imgui.ImVec2

  style.WindowPadding = imgui.ImVec2(10, 10)
  style.FramePadding = imgui.ImVec2(4, 4)
  style.WindowRounding = 0
  style.ChildWindowRounding = 0
  style.ItemSpacing = imgui.ImVec2(8.0, 5.0)
  style.ItemInnerSpacing = imgui.ImVec2(8, 6)
  style.ScrollbarSize = 13.0
  style.ScrollbarRounding = 0
  style.IndentSpacing = 25.0

  colors[clr.Text] = ImVec4(1.00, 1.00, 1.00, 1.00)
  colors[clr.TextDisabled] = ImVec4(0.60, 0.60, 0.60, 1.00)
  colors[clr.WindowBg] = ImVec4(0.11, 0.10, 0.11, 1.00)
  colors[clr.ChildWindowBg] = ImVec4(0.00, 0.00, 0.00, 0.00)
  colors[clr.PopupBg] = ImVec4(0.11, 0.10, 0.11, 1.00)
  colors[clr.Border] = ImVec4(0.86, 0.86, 0.86, 1.00)
  colors[clr.BorderShadow] = ImVec4(0.00, 0.00, 0.00, 0.00)
  colors[clr.FrameBg] = ImVec4(0.21, 0.20, 0.21, 0.60)
  colors[clr.FrameBgHovered] = ImVec4(0.68, 0.25, 0.25, 0.75)
  colors[clr.FrameBgActive] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.TitleBg] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.TitleBgCollapsed] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.TitleBgActive] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.MenuBarBg] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.ScrollbarBg] = ImVec4(0.56, 0.56, 0.58, 0.00)
  colors[clr.ScrollbarGrab] = ImVec4(0.56, 0.56, 0.58, 0.44)
  colors[clr.ScrollbarGrabHovered] = ImVec4(0.56, 0.56, 0.58, 0.74)
  colors[clr.ScrollbarGrabActive] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.ComboBg] = ImVec4(0.15, 0.14, 0.15, 1.00)
  colors[clr.CheckMark] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.SliderGrab] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.SliderGrabActive] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.Button] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.ButtonHovered] = ImVec4(0.68, 0.25, 0.25, 0.75)
  colors[clr.ButtonActive] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.Header] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.HeaderHovered] = ImVec4(0.68, 0.25, 0.25, 0.75)
  colors[clr.HeaderActive] = ImVec4(0.68, 0.25, 0.25, 1.00)
  colors[clr.ResizeGrip] = ImVec4(1.00, 1.00, 1.00, 0.30)
  colors[clr.ResizeGripHovered] = ImVec4(1.00, 1.00, 1.00, 0.60)
  colors[clr.ResizeGripActive] = ImVec4(1.00, 1.00, 1.00, 0.90)
  colors[clr.CloseButton] = ImVec4(0.56, 0.56, 0.58, 0.75)
  colors[clr.CloseButtonHovered] = ImVec4(0.56, 0.56, 0.58, 1.00)
  colors[clr.CloseButtonActive] = ImVec4(0.56, 0.56, 0.58, 1.00)
  colors[clr.PlotLines] = ImVec4(0.00, 0.00, 0.00, 0.00)
  colors[clr.PlotLinesHovered] = ImVec4(0.00, 0.00, 0.00, 0.00)
  colors[clr.PlotHistogram] = ImVec4(0.00, 0.00, 0.00, 0.00)
  colors[clr.PlotHistogramHovered] = ImVec4(0.00, 0.00, 0.00, 0.00)
  colors[clr.TextSelectedBg] = ImVec4(0.00, 0.00, 0.00, 0.00)
  colors[clr.ModalWindowDarkening] = ImVec4(0.00, 0.00, 0.00, 0.00)
end
function getZones(zone)
  local names = {
    ["SUNMA"] = "Bayside Marina",
    ["SUNNN"] = "Bayside",
    ["BATTP"] = "Battery Point",
    ["PARA"] = "Paradiso",
    ["CIVI"] = "Santa Flora",
    ["BAYV"] = "Palisades",
    ["CITYS"] = "City Hall",
    ["OCEAF"] = "Ocean Flats",
    ["OCEAF"] = "Ocean Flats",
    ["OCEAF"] = "Ocean Flats",
    ["SILLY"] = "Foster Valley",
    ["SILLY"] = "Foster Valley",
    ["HASH"] = "Hashbury",
    ["JUNIHO"] = "Juniper Hollow",
    ["ESPN"] = "Esplanade North",
    ["ESPN"] = "Esplanade North",
    ["ESPN"] = "Esplanade North",
    ["FINA"] = "Financial",
    ["CALT"] = "Calton Heights",
    ["SFDWT"] = "Downtown",
    ["SFDWT"] = "Downtown",
    ["SFDWT"] = "Downtown",
    ["SFDWT"] = "Downtown",
    ["JUNIHI"] = "Juniper Hill",
    ["CHINA"] = "Chinatown",
    ["SFDWT"] = "Downtown",
    ["THEA"] = "King's",
    ["THEA"] = "King's",
    ["THEA"] = "King's",
    ["GARC"] = "Garcia",
    ["DOH"] = "Doherty",
    ["DOH"] = "Doherty",
    ["SFDWT"] = "Downtown",
    ["SFAIR"] = "Easter Bay Airport",
    ["EASB"] = "Easter Basin",
    ["EASB"] = "Easter Basin",
    ["ESPE"] = "Esplanade East",
    ["ESPE"] = "Esplanade East",
    ["ESPE"] = "Esplanade East",
    ["ANGPI"] = "Angel Pine",
    ["SHACA"] = "Shady Cabin",
    ["BACKO"] = "Back o Beyond",
    ["LEAFY"] = "Leafy Hollow",
    ["FLINTR"] = "Flint Range",
    ["HAUL"] = "Fallen Tree",
    ["FARM"] = "The Farm",
    ["ELQUE"] = "El Quebrados",
    ["ALDEA"] = "Aldea Malvada",
    ["DAM"] = "The Sherman Dam",
    ["BARRA"] = "Las Barrancas",
    ["CARSO"] = "Fort Carson",
    ["QUARY"] = "Hunter Quarry",
    ["OCTAN"] = "Octane Springs",
    ["PALMS"] = "Green Palms",
    ["TOM"] = "Regular Tom",
    ["BRUJA"] = "Las Brujas",
    ["MEAD"] = "Verdant Meadows",
    ["PAYAS"] = "Las Payasadas",
    ["ARCO"] = "Arco del Oeste",
    ["SFAIR"] = "Easter Bay Airport",
    ["HANKY"] = "Hankypanky Point",
    ["PALO"] = "Palomino Creek",
    ["NROCK"] = "North Rock",
    ["MONT"] = "Montgomery",
    ["MONT"] = "Montgomery",
    ["HBARNS"] = "Hampton Barns",
    ["FERN"] = "Fern Ridge",
    ["DILLI"] = "Dillimore",
    ["TOPFA"] = "Hilltop Farm",
    ["BLUEB"] = "Blueberry",
    ["BLUEB"] = "Blueberry",
    ["PANOP"] = "The Panopticon",
    ["FRED"] = "Frederick Bridge",
    ["MAKO"] = "The Mako Span",
    ["BLUAC"] = "Blueberry Acres",
    ["MART"] = "Martin Bridge",
    ["FALLO"] = "Fallow Bridge",
    ["CREEK"] = "Shady Creeks",
    ["CREEK"] = "Shady Creeks",
    ["WESTP"] = "Queens",
    ["WESTP"] = "Queens",
    ["WESTP"] = "Queens",
    ["LA"] = "Los Santos",
    ["VE"] = "Las Venturas",
    ["BONE"] = "Bone County",
    ["ROBAD"] = "Tierra Robada",
    ["GANTB"] = "Gant Bridge",
    ["GANTB"] = "Gant Bridge",
    ["SF"] = "San Fierro",
    ["ROBAD"] = "Tierra Robada",
    ["RED"] = "Red County",
    ["FLINTC"] = "Flint County",
    ["EBAY"] = "Easter Bay Chemicals",
    ["EBAY"] = "Easter Bay Chemicals",
    ["SFAIR"] = "Easter Bay Airport",
    ["SILLY"] = "Foster Valley",
    ["SILLY"] = "Foster Valley",
    ["SFAIR"] = "Easter Bay Airport",
    ["SFAIR"] = "Easter Bay Airport",
    ["WHET"] = "Whetstone",
    ["LAIR"] = "Los Santos International",
    ["LAIR"] = "Los Santos International",
    ["BLUF"] = "Verdant Bluffs",
    ["ELCO"] = "El Corona",
    ["LIND"] = "Willowfield",
    ["LIND"] = "Willowfield",
    ["LIND"] = "Willowfield",
    ["LIND"] = "Willowfield",
    ["LDOC"] = "Ocean Docks",
    ["LDOC"] = "Ocean Docks",
    ["MAR"] = "Marina",
    ["VERO"] = "Verona Beach",
    ["VERO"] = "Verona Beach",
    ["BLUF"] = "Verdant Bluffs",
    ["BLUF"] = "Verdant Bluffs",
    ["ELCO"] = "El Corona",
    ["VERO"] = "Verona Beach",
    ["MAR"] = "Marina",
    ["MAR"] = "Marina",
    ["VERO"] = "Verona Beach",
    ["VERO"] = "Verona Beach",
    ["CONF"] = "Conference Center",
    ["CONF"] = "Conference Center",
    ["COM"] = "Commerce",
    ["COM"] = "Commerce",
    ["COM"] = "Commerce",
    ["COM"] = "Commerce",
    ["PER1"] = "Pershing Square",
    ["COM"] = "Commerce",
    ["LMEX"] = "Little Mexico",
    ["LMEX"] = "Little Mexico",
    ["COM"] = "Commerce",
    ["IWD"] = "Idlewood",
    ["IWD"] = "Idlewood",
    ["IWD"] = "Idlewood",
    ["IWD"] = "Idlewood",
    ["IWD"] = "Idlewood",
    ["GLN"] = "Glen Park",
    ["GLN"] = "Glen Park",
    ["JEF"] = "Jefferson",
    ["JEF"] = "Jefferson",
    ["JEF"] = "Jefferson",
    ["JEF"] = "Jefferson",
    ["JEF"] = "Jefferson",
    ["CHC"] = "Las Colinas",
    ["CHC"] = "Las Colinas",
    ["CHC"] = "Las Colinas",
    ["CHC"] = "Las Colinas",
    ["IWD"] = "Idlewood",
    ["GAN"] = "Ganton",
    ["GAN"] = "Ganton",
    ["LIND"] = "Willowfield",
    ["EBE"] = "East Beach",
    ["EBE"] = "East Beach",
    ["EBE"] = "East Beach",
    ["ELS"] = "East Los Santos",
    ["ELS"] = "East Los Santos",
    ["JEF"] = "Jefferson",
    ["ELS"] = "East Los Santos",
    ["ELS"] = "East Los Santos",
    ["ELS"] = "East Los Santos",
    ["ELS"] = "East Los Santos",
    ["ELS"] = "East Los Santos",
    ["LFL"] = "Los Flores",
    ["LFL"] = "Los Flores",
    ["EBE"] = "East Beach",
    ["CHC"] = "Las Colinas",
    ["CHC"] = "Las Colinas",
    ["CHC"] = "Las Colinas",
    ["LDT"] = "Downtown Los Santos",
    ["LDT"] = "Downtown Los Santos",
    ["LDT"] = "Downtown Los Santos",
    ["LDT"] = "Downtown Los Santos",
    ["LDT"] = "Downtown Los Santos",
    ["MULINT"] = "Mulholland Intersection",
    ["MUL"] = "Mulholland",
    ["MUL"] = "Mulholland",
    ["MUL"] = "Mulholland",
    ["MKT"] = "Market",
    ["VIN"] = "Vinewood",
    ["MKT"] = "Market",
    ["LDT"] = "Downtown Los Santos",
    ["LDT"] = "Downtown Los Santos",
    ["LDT"] = "Downtown Los Santos",
    ["SUN"] = "Temple",
    ["SUN"] = "Temple",
    ["SUN"] = "Temple",
    ["MUL"] = "Mulholland",
    ["MUL"] = "Mulholland",
    ["MUL"] = "Mulholland",
    ["VIN"] = "Vinewood",
    ["SUN"] = "Temple",
    ["SUN"] = "Temple",
    ["SUN"] = "Temple",
    ["MUL"] = "Mulholland",
    ["MUL"] = "Mulholland",
    ["MUL"] = "Mulholland",
    ["MUL"] = "Mulholland",
    ["MUL"] = "Mulholland",
    ["MUL"] = "Mulholland",
    ["MUL"] = "Mulholland",
    ["SMB"] = "Santa Maria Beach",
    ["SMB"] = "Santa Maria Beach",
    ["ROD"] = "Rodeo",
    ["ROD"] = "Rodeo",
    ["ROD"] = "Rodeo",
    ["ROD"] = "Rodeo",
    ["ROD"] = "Rodeo",
    ["ROD"] = "Rodeo",
    ["ROD"] = "Rodeo",
    ["ROD"] = "Rodeo",
    ["ROD"] = "Rodeo",
    ["ROD"] = "Rodeo",
    ["VIN"] = "Vinewood",
    ["RIH"] = "Richman",
    ["RIH"] = "Richman",
    ["ROD"] = "Rodeo",
    ["ROD"] = "Rodeo",
    ["RIH"] = "Richman",
    ["RIH"] = "Richman",
    ["RIH"] = "Richman",
    ["RIH"] = "Richman",
    ["RIH"] = "Richman",
    ["RIH"] = "Richman",
    ["RIH"] = "Richman",
    ["RIH"] = "Richman",
    ["STRIP"] = "The Strip",
    ["STRIP"] = "The Strip",
    ["DRAG"] = "The Four Dragons Casino",
    ["PINK"] = "The Pink Swan",
    ["HIGH"] = "The High Roller",
    ["PIRA"] = "Pirates in Men's Pants",
    ["VISA"] = "The Visage",
    ["VISA"] = "The Visage",
    ["JTS"] = "Julius Thruway South",
    ["JTW"] = "Julius Thruway West",
    ["JTS"] = "Julius Thruway South",
    ["RSE"] = "Rockshore East",
    ["LOT"] = "Come-A-Lot",
    ["CAM"] = "The Camel's Toe",
    ["ROY"] = "Royal Casino",
    ["CALI"] = "Caligula's Palace",
    ["CALI"] = "Caligula's Palace",
    ["PILL"] = "Pilgrim",
    ["STAR"] = "Starfish Casino",
    ["STRIP"] = "The Strip",
    ["STRIP"] = "The Strip",
    ["ISLE"] = "The Emerald Isle",
    ["OVS"] = "Old Venturas Strip",
    ["KACC"] = "K.A.C.C. Military Fuels",
    ["CREE"] = "Creek",
    ["SRY"] = "Sobell Rail Yards",
    ["LST"] = "Linden Station",
    ["JTE"] = "Julius Thruway East",
    ["LDS"] = "Linden Side",
    ["JTE"] = "Julius Thruway East",
    ["JTN"] = "Julius Thruway North",
    ["JTE"] = "Julius Thruway East",
    ["JTE"] = "Julius Thruway East",
    ["JTN"] = "Julius Thruway North",
    ["JTN"] = "Julius Thruway North",
    ["JTN"] = "Julius Thruway North",
    ["JTN"] = "Julius Thruway North",
    ["JTW"] = "Julius Thruway West",
    ["JTN"] = "Julius Thruway North",
    ["HGP"] = "Harry Gold Parkway",
    ["REDE"] = "Redsands East",
    ["REDE"] = "Redsands East",
    ["REDE"] = "Redsands East",
    ["JTN"] = "Julius Thruway North",
    ["REDW"] = "Redsands West",
    ["REDW"] = "Redsands West",
    ["REDW"] = "Redsands West",
    ["REDW"] = "Redsands West",
    ["VAIR"] = "Las Venturas Airport",
    ["VAIR"] = "Las Venturas Airport",
    ["VAIR"] = "Las Venturas Airport",
    ["LVA"] = "LVA Freight Depot",
    ["BINT"] = "Blackfield Intersection",
    ["BINT"] = "Blackfield Intersection",
    ["BINT"] = "Blackfield Intersection",
    ["BINT"] = "Blackfield Intersection",
    ["LVA"] = "LVA Freight Depot",
    ["LVA"] = "LVA Freight Depot",
    ["LVA"] = "LVA Freight Depot",
    ["LVA"] = "LVA Freight Depot",
    ["GGC"] = "Greenglass College",
    ["GGC"] = "Greenglass College",
    ["BFLD"] = "Blackfield",
    ["BFLD"] = "Blackfield",
    ["ROCE"] = "Roca Escalante",
    ["ROCE"] = "Roca Escalante",
    ["LDM"] = "Last Dime Motel",
    ["RSW"] = "Rockshore West",
    ["RSW"] = "Rockshore West",
    ["RIE"] = "Randolph Industrial Estate",
    ["BFC"] = "Blackfield Chapel",
    ["BFC"] = "Blackfield Chapel",
    ["JTN"] = "Julius Thruway North",
    ["PINT"] = "Pilson Intersection",
    ["WWE"] = "Whitewood Estates",
    ["PRP"] = "Prickle Pine",
    ["PRP"] = "Prickle Pine",
    ["PRP"] = "Prickle Pine",
    ["SPIN"] = "Spinybed",
    ["PRP"] = "Prickle Pine",
    ["PILL"] = "Pilgrim",
    ["SASO"] = "San Andreas Sound",
    ["FISH"] = "Fisher's Lagoon",
    ["GARV"] = "Garver Bridge",
    ["GARV"] = "Garver Bridge",
    ["GARV"] = "Garver Bridge",
    ["KINC"] = "Kincaid Bridge",
    ["KINC"] = "Kincaid Bridge",
    ["KINC"] = "Kincaid Bridge",
    ["LSINL"] = "Los Santos Inlet",
    ["SHERR"] = "Sherman Reservoir",
    ["FLINW"] = "Flint Water",
    ["ETUNN"] = "Easter Tunnel",
    ["BYTUN"] = "Bayside Tunnel",
    ["BIGE"] = "'The Big Ear'",
    ["PROBE"] = "Lil' Probe Inn",
    ["VALLE"] = "Valle Ocultado",
    ["GLN"] = "Glen Park",
    ["LDOC"] = "Ocean Docks",
    ["LINDEN"] = "Linden Station",
    ["UNITY"] = "Unity Station",
    ["VIN"] = "Vinewood",
    ["MARKST"] = "Market Station",
    ["CRANB"] = "Cranberry Station",
    ["YELLOW"] = "Yellow Bell Station",
    ["SANB"] = "San Fierro Bay",
    ["SANB"] = "San Fierro Bay",
    ["ELCA"] = "El Castillo del Diablo",
    ["ELCA"] = "El Castillo del Diablo",
    ["ELCA"] = "El Castillo del Diablo",
    ["REST"] = "Restricted Area",
    ["MONINT"] = "Montgomery Intersection",
    ["MONINT"] = "Montgomery Intersection",
    ["ROBINT"] = "Robada Intersection",
    ["FLINTI"] = "Flint Intersection",
    ["SFAIR"] = "Easter Bay Airport",
    ["SFAIR"] = "Easter Bay Airport",
    ["SFAIR"] = "Easter Bay Airport",
    ["MKT"] = "Market",
    ["MKT"] = "Market",
    ["CUNTC"] = "Avispa Country Club",
    ["CUNTC"] = "Avispa Country Club",
    ["HILLP"] = "Missionary Hill",
    ["MTCHI"] = "Mount Chiliad",
    ["MTCHI"] = "Mount Chiliad",
    ["MTCHI"] = "Mount Chiliad",
    ["MTCHI"] = "Mount Chiliad",
    ["YBELL"] = "Yellow Bell Golf Course",
    ["YBELL"] = "Yellow Bell Golf Course",
    ["VAIR"] = "Las Venturas Airport",
    ["LDOC"] = "Ocean Docks",
    ["LAIR"] = "Los Santos International",
    ["LDOC"] = "Ocean Docks",
    ["LAIR"] = "Los Santos International",
    ["LAIR"] = "Los Santos International",
    ["LAIR"] = "Los Santos International",
    ["STAR"] = "Starfish Casino",
    ["BEACO"] = "Beacon Hill",
    ["CUNTC"] = "Avispa Country Club",
    ["CUNTC"] = "Avispa Country Club",
    ["GARC"] = "Garcia",
    ["CUNTC"] = "Avispa Country Club",
    ["CUNTC"] = "Avispa Country Club",
    ["PLS"] = "Playa del Seville",
    ["LDOC"] = "Ocean Docks",
    ["STAR"] = "Starfish Casino",
    ["RING"] = "The Clown's Pocket",
    ["LDOC"] = "Ocean Docks",
    ["LIND"] = "Willowfield",
    ["LIND"] = "Willowfield",
    ["WWE"] = "Whitewood Estates",
    ["LDT"] = "Downtown Los Santos"
  }
  if names[zone] == nil then return "Не определено" end
  return names[zone]
end
function getweaponname(weapon)
    local names = {
    [0] = "Fist",
    [1] = "Brass Knuckles",
    [2] = "Golf Club",
    [3] = "Nightstick",
    [4] = "Knife",
    [5] = "Baseball Bat",
    [6] = "Shovel",
    [7] = "Pool Cue",
    [8] = "Katana",
    [9] = "Chainsaw",
    [10] = "Purple Dildo",
    [11] = "Dildo",
    [12] = "Vibrator",
    [13] = "Silver Vibrator",
    [14] = "Flowers",
    [15] = "Cane",
    [16] = "Grenade",
    [17] = "Tear Gas",
    [18] = "Molotov Cocktail",
    [22] = "9mm",
    [23] = "Silenced 9mm",
    [24] = "Desert Eagle",
    [25] = "Shotgun",
    [26] = "Sawnoff Shotgun",
    [27] = "Combat Shotgun",
    [28] = "Micro SMG/Uzi",
    [29] = "MP5",
    [30] = "AK-47",
    [31] = "M4",
    [32] = "Tec-9",
    [33] = "Country Rifle",
    [34] = "Sniper Rifle",
    [35] = "RPG",
    [36] = "HS Rocket",
    [37] = "Flamethrower",
    [38] = "Minigun",
    [39] = "Satchel Charge",
    [40] = "Detonator",
    [41] = "Spraycan",
    [42] = "Fire Extinguisher",
    [43] = "Camera",
    [44] = "Night Vis Goggles",
    [45] = "Thermal Goggles",
    [46] = "Parachute" }
    return names[weapon]
end
local tEditData = {
	id = -1,
	inputActive = false
}
local fileb = getWorkingDirectory() .. "\\config\\fbitools.bind"
local tBindList = {}
if doesFileExist(fileb) then
        local f = io.open(fileb, "r")
        if f then
            tBindList = decodeJson(f:read())
            f:close()
        end
    else
        tBindList = {
            [1] = {
                text = "",
                v = {},
                name = 'Бинд1'
            },
            [2] = {
                text = "",
                v = {},
                name = 'Бинд2'
            },
            [3] = {
                text = "",
                v = {},
                name = 'Бинд3'
            }
        }
    end
function onScriptTerminate(scr)
    if scr == script.this then
		if doesFileExist(fileb) then
			os.remove(fileb)
		end
		local f = io.open(fileb, "w")
		if f then
			f:write(encodeJson(tBindList))
			f:close()
        end
        local fa = io.open("moonloader/config/fbitools/keys.json", "w")
        if fa then
            fa:write(encodeJson(config_keys))
            fa:close()
        end
	end
end
-------------
--HOOKS--
function sp.onPlayerQuit(id, reason)
    if id == gmegafid then
        sampAddChatMessage(' {ffffff}~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~', 0x0C2265)
		sampAddChatMessage('', 0x0C2265)
		sampAddChatMessage(' {ffffff}Игрок: {0C2265}'..sampGetPlayerNickname(gmegafid)..'['..gmegafid..'] {ffffff}вышел из игры', 0x0C2265)
		sampAddChatMessage(' {ffffff}Уровень: {0C2265}'..gmegaflvl, 0x0C2265)
		sampAddChatMessage(' {ffffff}Фракция: {0C2265}'..gmegaffrak, 0x0C2265)
		sampAddChatMessage('', 0x0C2265)
        sampAddChatMessage(' {ffffff}~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~', 0x0C2265)
        gmegafid = nil
        gmegaflvl = nil
        gmegaffrak = nil
    end
end
function sp.onSendSpawn()
    if cfg.main.clistb and rabden then
        lua_thread.create(function()
            wait(1200)
            ftext('Цвет ника сменен на: {0C2265}' .. cfg.main.clist)
            sampSendChat('/clist '..cfg.main.clist)
        end)
    end
end
function sp.onServerMessage(color, text)
    if color == -8224086 then
        local colors = ("{%06X}"):format(bit.rshift(color, 8))
        table.insert(departament, os.date(colors.."[%H:%M:%S] ") .. text)
    end
		if nazhaloop then
            if text:match('Посылать сообщение в /d можно раз в 10 секунд!') then
                zaproop = true
                ftext('Не удалось подать в ООП игрока {9966cc}'..nikk..'{ffffff}. Повторить попытку?')
                ftext('Подтвердить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "))
            end
            if nikk == nil then
                dmoop = false
                nikk = nil
                zaproop = false
                aroop = false
                nazhaloop = false
            end
            if color == -8224086 and text:find(nikk) then
                dmoop = false
                nikk = nil
                zaproop = false
                aroop = false
                nazhaloop = false
                ftext("Рассмотр дела отменен.", -1)
            end
        end
        if (text:match('дело на имя .+ рассмотрению не подлежит, ООП') or text:match('дело .+ рассмотрению не подлежит %- ООП.')) and color == -8224086 then
            local ooptext = text:match('Mayor, (.+)')
            table.insert(ooplistt, ooptext)
        end
	if check then
		if color == -65366 and text:find('%[Телефон%] .+: .+') then
			local nick, text = text:match('%[Телефон%] (.+): (.+)')
			if bNotf then
				notf.addNotification('Прослушка телефона\n'..nick..'\nСообщение: '..text, 5,2)
			end
			sampSendChat('/r [Прослушка телефона]: "'..text..'"')
		end
	end
	if text:find('начал преследование за преступником') then
	local pnick, snick, sroz = text:match('Полицейский (.+) начал преследование за преступником (.+) %(Уровень розыска: (.+)%)')
	local id = sampGetPlayerIdByNickname(snick)
	local mynick = sampGetPlayerNickname(sampGetPlayerIdByCharHandle(PLAYER_PED))
		lua_thread.create(function()
            local peds = getAllChars()
            if #peds ~= 0 then
				local result, ped = sampGetCharHandleBySampPlayerId(id)
				if not result then return end
				if playerMarker ~= nil then
					removeBlip(playerMarker)
					playerMarkerId = nil
				end
				if text:find('Преследование закончено!') then
					removeBlip(playerMarker)
					playerMarker = nil
					playerMarkerId = nil
					ftext('Вы достигли цели.')
					return
				end
				if text:find('Патрулирование закончено, вы догнали преступника!') then return end
				if pnick ~= mynick then
					playerMarkerId = id
					playerMarker = addBlipForChar(ped)
					local px, py, pz = getCharCoordinates(ped)
					changeBlipColour(playerMarker, 0xFF0000FF)
					repeat wait(0)
						if doesCharExist(ped) then
							local posX, posY, posZ = getCharCoordinates(ped)
							local pPosX, pPosY, pPosZ = getCharCoordinates(PLAYER_PED)
							local distance = getDistanceBetweenCoords2d(pPosX, pPosY, posX, posY)
								if distance <= 200000000 and distance >= 3 then
									if isPointOnScreen(posX, posY, posZ, 0.0) then
										local wPosX, wPosY = convert3DCoordsToScreen(posX, posY, posZ)
										local wPosX1, wPosY1 = convert3DCoordsToScreen(pPosX, pPosY, pPosZ)
										renderDrawLine(wPosX1, wPosY1, wPosX, wPosY, 2, 0xFFEE0000)
										renderDrawPolygon(wPosX, wPosY, 10, 10, 14, 0.0, 0xFFEE0000)
									end
								else
									removeBlip(playerMarker)
									playerMarker = nil
									playerMarkerId = nil
									ftext('Вы достигли цели.')
								return
								end
						end
					until false
				return
				end
			end
		end)
	end
	--[[if text:find('начал преследование за преступником') then
		local pnick, snick, sroz = text:match('Полицейский (.+) начал преследование за преступником (.+) %(Уровень розыска: (.+)%)')
		local hisid = sampGetPlayerIdByNickname(snick)
	end]]
	if check then
		if text:find('Абонент положил(а) трубку') then
			if bNotf then
				notf.addNotification('Вы проводите тест', 5,2)
			end
			check = false
		end
	end
	if text:match("Новый баланс на домашнем счету: $.+") then
		local balance = tonumber(text:match("Новый баланс на домашнем счету%: $(.+)"))
		ftext("balance = "..balance)
	end
	--[[if getcode then
		if text:find('ab') then
			lua_thread.create(function()
				local nick, code = text:match('(.+): (.+)')
				wait(2000)
				sampSendChat('/b I find next code: '..code)
			end)
		end
	end]]
    if color == -1920073984 and (text:match('.+ .+%: .+') or text:match('%(%( .+ .+%: .+ %)%)')) then
        local colors = ("{%06X}"):format(bit.rshift(color, 8))
        table.insert(radio, os.date(colors.."[%H:%M:%S] ") .. text)
    end
    if color == -3669760 and text:match('%[Wanted %d+: .+%] %[Сообщает%: .+%] %[.+%]') then
        local colors = ("{%06X}"):format(bit.rshift(color, 8))
        table.insert(wanted, os.date(colors.."[%H:%M:%S] ") .. text)
    end
    if color == -65366 and (text:match('SMS%: .+. Отправитель%: .+')) then
		local text, nick = text:match('SMS%: (.+). Отправитель%: (.+)')
        local colors = ("{%06X}"):format(bit.rshift(color, 8))
		if bNotf then
			notf.addNotification('Вам пришло сообщение от '..nick..'\nСообщение: '..text, 5,2)
		end
    end
	if color == -65366 and (text:match('SMS%: .+. Отправитель%: .+') or text:match('SMS%: .+. Получатель%: .+')) then
            if text:match('SMS%: .+. Отправитель%: .+%[%d+%]') then smsid = text:match('SMS%: .+. Отправитель%: .+%[(%d+)%]') elseif text:match('SMS%: .+. Получатель%: .+%[%d+%]') then smstoid = text:match('SMS%: .+. Получатель%: .+%[(%d+)%]') end
            local colors = ("{%06X}"):format(bit.rshift(color, 8))
            table.insert(sms, os.date(colors.."[%H:%M:%S] ") .. text)
        end
    if mcheckb then
        if text:find('========================================') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('Имя:') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('Организация:') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('Преступление:') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('Сообщил:') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('Уровень розыска:') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('---============================================---') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:write(' \n')
            open:close()
        end
    end
    if text:find('Вы посадили в тюрьму') then
        local nik, sek = text:match('Вы посадили в тюрьму (.+) на (.+) секунд')
        if sek == '3600' or sek == '3000'  then
            lua_thread.create(function()
                nikk = nik:gsub('_', ' ')
                aroop = true
                wait(3000)
                ftext(string.format("Запретить рассмотр дела на имя %s", nikk:gsub('_', ' ')), -1)
                ftext('Подтвердить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
            end)
        end
    end
	--[[if text:find('Ваш мобильник звонит. Введите (/P)ickup. Звонит:') then
		local nick, text = text:match('[Телефон] (.+): (.+)')
		lua_thread.create(function()
			ftext(string.format('++ %s %s', nick, text))
			ftext('+')
		end)
	end]]
    if text:find('Вы посадили преступника на') then
        local sekk = text:match('Вы посадили преступника на (.+) секунд!')
        if sekk == '3000' or sekk == '3600' then
            lua_thread.create(function()
                nikk = sampGetPlayerNickname(tdmg)
                dmoop = true
                wait(50)
                ftext(string.format("Запретить рассмотр дела на имя %s", nikk:gsub('_', ' ')), -1)
                ftext('Подтвердить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {0C2265}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
            end)
        end
    end
    if status then
		if text:match('ID: .+ | .+: .+ %- .+') and not fstatus then
			gosmb = true
			local id, nick, rang, stat = text:match('ID: (%d+) | (.+): (.+) %- (.+)')
			local color = ("%06X"):format(bit.band(sampGetPlayerColor(id), 0xFFFFFF))
			table.insert(players2, string.format('{'..color..'}%s[%s]{ffffff}\t%s\t%s', nick, id, rang, stat))
			return false
		end
		if text:match('Всего: %d+ человек') then
			local count = text:match('Всего: (%d+) человек')
			gcount = count
			gotovo = true
			return false
		end
		if color == -1 then
			return false
		end
		if color == 647175338 then
			return false
        end
        if text:match('ID: .+ | .+: .+') and not fstatus then
			krimemb = true
			local id, nick, rang = text:match('ID: (%d+) | (.+): (.+)')
			local color = ("%06X"):format(bit.band(sampGetPlayerColor(id), 0xFFFFFF))
			table.insert(players1, string.format('{'..color..'}%s[%s]{ffffff}\t%s', nick, id, rang))
			return false
        end
    end
    if warnst then
        if text:find('Организация:') then
            local wcfrac = text:match('Организация: (.+)')
		    wfrac = wcfrac
            if wcfrac == 'Армия СФ' or wcfrac == 'Армия ЛВ' or wcfrac == 'ФБР' then
                wfrac = longtoshort(wcfrac)
            end
        end
    end
    if text:find('Рабочий день начат') and color ~= -1 then
        if cfg.main.clistb then
            lua_thread.create(function()
                wait(100)
                ftext(cfg.main.clist)
                sampSendChat('/clist '..tonumber(cfg.main.clist))
                rabden = true
            end)
        end
    end
    if text:find('Рабочий день окончен') and color ~= -1 then
        rabden = false
    end
    if text:find('Вы поменяли пули на резиновые') then
        tazer = true
    end
    if text:find('Вы поменяли пули на обычные') then
        tazer = false
    end
    if cfg.main.nclear then
        if text:find('удалил из розыскиваемых') then
            local chist, jertva = text:match('%[Clear%] (.+) удалил из розыскиваемых (.+)')
            printStringNow(chist..' cleared '..jertva..' from BD', 3000)
        end
    end
    if text:find('Wanted') and text:find('Сообщает') then
        local id, prestp, police, prichin = text:match('%[Wanted (%d+): (.+)%] %[Сообщает: (.+)%] %[(.+)%]')
        if not cfg.main.offwntd then
            if cfg.main.nwanted then
                return {0x0C2265FF, ' [{ffffff}Wanted '..id..': '..prestp..'{0C2265}] [{ffffff}Сообщает: '..police..'{0C2265}] [{ffffff}'..prichin..'{0C2265}]'}
            end
        else
            local mynick = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)))
            if police ~= mynick then
                return false
            else
                if cfg.main.nwanted then
                    return {0x0C2265FF, ' [{ffffff}Wanted '..id..': '..prestp..'{0C2265}] [{ffffff}Сообщает: '..police..'{0C2265}] [{ffffff}'..prichin..'{0C2265}]'}
                end
            end
        end
    end
    if text:find('начал преследование за преступником') then
        local polic, prest, yrvn = text:match('Полицейский (.+) начал преследование за преступником (.+) %(Уровень розыска: (.+)%)')
        if not cfg.main.offptrl then
            if cfg.main.nwanted then
                return {0xFFFFFFFF, ' Полицейский {0C2265}'..polic..' {ffffff}начал преследование за {0C2265}'..prest..' {ffffff}(Уровень розыска: {0C2265}'..yrvn..'{ffffff})'}
            end
        else
            local mynick = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)))
            if polic ~= mynick then
                return false
            else
                if cfg.main.nwanted then
                    return {0xFFFFFFFF, ' Полицейский {0C2265}'..polic..' {ffffff}начал преследование за {0C2265}'..prest..' {ffffff}(Уровень розыска: {0C2265}'..yrvn..'{ffffff})'}
                end
            end
        end
    end
    if cfg.main.nwanted then
        if text:find('удалил из розыскиваемых') then
            local chist, jertva = text:match('%[Clear%] (.+) удалил из розыскиваемых (.+)')
            return {0x0C2265FF, ' [{ffffff}Clear{0C2265}] '..chist..'{ffffff} удалил из розыскиваемых {0C2265}'..jertva}
        end
        if text:find('<<') and text:find('Офицер') and text:find('арестовал') and text:find('>>') then
            local arr, arre = text:match('<< Офицер (.+) арестовал (.+) >>')
            return {0xFFFFFFFF, ' « Офицер {0C2265}'..arr..' {ffffff}арестовал {0C2265}'..arre..' {ffffff}»'}
        end
        if text:find('<<') and text:find('Агент FBI') and text:find('арестовал') and text:find('>>') then
            local arrr, arrre = text:match('<< Агент FBI (.+) арестовал (.+) >>')
            return {0xFFFFFFFF, ' « Агент FBI {0C2265}'..arrr..' {ffffff}арестовал {0C2265}'..arrre..' {ffffff}»'}
        end
        if text:find('Вы посадили преступника на') then
            local sekund = text:match('Вы посадили преступника на (%d+) секунд!')
            return {0xFFFFFFFF, ' Вы посадили преступника на {0C2265}'..sekund..' {ffffff}секунд!'}
        end
    end
end
function sp.onShowDialog(id, style, title, button1, button2, text)
    if id == 1 and cfg.main.parolb then
        sampSendDialogResponse(id, 1, _, cfg.main.parol)
        return false
    end
	if dialogid == 5225 then
		-- 0 - deagle, 1 - shot, 3 - m4, 4 - rifle, 5 - bron'
		local guns = {0, 0, 1, 1, 3, 3, 4, 4, 5}
		lua_thread.create(function()
		  wait(250)
		  if autoBP == #guns + 1 then
			autoBP = 1
			sampCloseCurrentDialogWithButton(0)
			return
		  end
		  sampSendDialogResponse(5225, 1, guns[autoBP], "")
		  autoBP = autoBP + 1
		  return
		end)
	  end
	if id == 40224 and cfg.main.parolb then
		sampSendDialogResponse(id, 1, _, seckey)
		return false
	end
    if id == 0 and checkstat then
        frak = text:match('.+Организация%:%s+(.+)%s+Ранг')
        rang = text:match('.+Ранг%:%s+(.+)%s+Работа')
        sampCloseCurrentDialogWithButton(0)
        print(text)
        print(frak)
        print(rang)
        checkstat = false
    end
end
function sp.onSendGiveDamage(playerId, damage, weapon, bodypart)
    tdmg = playerId
end
function mcheckf()
    if not doesFileExist('moonloader/fbitools/mcheck.txt') then
        local file = io.open("moonloader/fbitools/mcheck.txt", "w")
        file:close()
        file = nil
    end
end
---------
--CONFIG--
local fbitools =
{
  main =
  {
    posX = 1596,
    posY = 916,
    widehud = 320,
    male = true,
	houseplata = 0,
    wanted = false,
    clear = false,
    hud = false,
    tar = 'тэг',
    parol = 'пароль',
	seckey = 'googlecode',
    parolb = false,
	seckey2 = false,
    tarb = false,
    clistb = false,
    spzamen = false,
    clist = 0,
    offptrl = false,
	autobp = false,
    offwntd = false
  },
  commands =
  {
    cput = true,
    ceject = true,
    deject = true,
    ftazer = true,
    zaderjka = 1200,
    ticket = true
  }
}
local fthmenu = {
    {
        title = '{ffffff}» Запросить поддержку в текущий квадрат',
        onclick = function()
            if cfg.main.tarb then
                sampSendChat(string.format('/r [%s]: Нужна поддержка в квадрат %s', cfg.main.tar, kvadrat()))
            else
                sampSendChat(string.format('/r Нужна поддержка в квадрат %s', kvadrat()))
            end
        end
    },
    {
        title = '{ffffff}» Запросить эвакуацию в текущий квадрат',
        onclick = function()
            sampShowDialog(1401, '{0C2265}FBI Tools {ffffff}| Эвакуация', '{ffffff}Введите: кол-во мест\nПример: 3 места', 'Отправить', 'Отмена', 1)
        end
    },
    {
        title = '{ffffff}» Цены выкупа',
        onclick = function()
            submenus_show(fcmenu, '{0C2265}FBI Tools {ffffff}| Цены выкупа')
        end
    }
}
megaftimer = nil
----------

function getserial()
    local ffi = require("ffi")
    ffi.cdef[[
    int __stdcall GetVolumeInformationA(
    const char* lpRootPathName,
    char* lpVolumeNameBuffer,
    uint32_t nVolumeNameSize,
    uint32_t* lpVolumeSerialNumber,
    uint32_t* lpMaximumComponentLength,
    uint32_t* lpFileSystemFlags,
    char* lpFileSystemNameBuffer,
    uint32_t nFileSystemNameSize
    );
    ]]
    local serial = ffi.new("unsigned long[1]", 0)
    ffi.C.GetVolumeInformationA(nil, nil, 0, serial, nil, nil, nil, 0)
	local ser = serial[0]
	--sampAddChatMessage('Ваш серийный номер: '..ser, 0x0C2265)
    return serial[0]
end
function ttest53()
	lua_thread.create(function()
	while true do wait(1000)
		pInfo.info.weekWorkOnline = pInfo.info.weekWorkOnline + 1
		pInfo.info.dayWorkOnline = pInfo.info.dayWorkOnline + 1
		pInfo.info.dayOnline = pInfo.info.dayOnline + 1
		pInfo.info.weekOnline = pInfo.info.weekOnline + 1
		pInfo.info.dayAFK = pInfo.info.dayAFK + (os.time() - sInfo.updateAFK - 1)
		sInfo.updateAFK = os.time()
	end
	end)
end
function isKeyCheckAvailable()
	if not isSampLoaded() then
		return true
	end
	if not isSampfuncsLoaded() then
		return not sampIsChatInputActive() and not sampIsDialogActive()
	end
	return not sampIsChatInputActive() and not sampIsDialogActive() and not isSampfuncsConsoleActive()
end
local libs = {'sphere.lua', 'rkeys.lua', 'imcustom/hotkey.lua', 'imgui.lua', 'MoonImGui.dll', 'imgui_addons.lua'}
function main()
    while not isSampAvailable() do wait(0) end
    if bNotf then
		notf.addNotification("Уведомление. \n\nFBI Tools успешно загружен.", 5,2)
	end
	var1 = 0
	var2 = 0 
	var3 = 0
	var4 = 1054
	addOneOffSound(var1, var2, var3, var4)
	ftext('FBI Tools был успешно загружен')
    if not doesDirectoryExist('moonloader\\config') then createDirectory('moonloader\\config') end
    if not doesDirectoryExist('moonloader\\config\\fbitools') then createDirectory('moonloader\\config\\fbitools') end
    if not doesDirectoryExist('moonloader/fbitools') then createDirectory('moonloader/fbitools') end
    cfg = inicfg.load(fbitools, 'fbitools/config.ini')
    if not doesDirectoryExist('moonloader/lib/imcustom') then createDirectory('moonloader/lib/imcustom') end
    for k, v in pairs(libs) do
        if not doesFileExist('moonloader/lib/'..v) then
            downloadUrlToFile('https://raw.githubusercontent.com/WhackerH/kirya/master/lib/'..v, getWorkingDirectory()..'\\lib\\'..v)
            print('Загружается библиотека '..v)
        end
    end
	if os.time(os.date("!*t")) > cfg.main.houseplata - (3600 * 24 * 3) and cfg.main.houseplata > 0 then -- Unix Timestamp
		ftext("Внимание! На домашнем счёту осталось слишком мало денег. Успейте пополнить счёт")
    end
	local day = os.date("%d.%m.%y")
    if pInfo.info.thisWeek == 0 then pInfo.info.thisWeek = os.date("%W") end
    -- Начался новый день
    if pInfo.info.day ~= day and tonumber(os.date("%H")) > 4 and pInfo.info.dayOnline > 0 then
      local weeknum = dateToWeekNumber(pInfo.info.day)
      if weeknum == 0 then weeknum = 7 end
      pInfo.weeks[weeknum] = pInfo.info.dayOnline
      ftext(string.format("Начался новый день. Итоги предыдущего дня (%s): %s", pInfo.info.day, secToTime(pInfo.info.dayOnline)))
      -----------------
      -- Началась новая идея
      if tonumber(pInfo.info.thisWeek) ~= tonumber(os.date("%W")) then
        ftext("Началась новая неделя. Итоги предыдущей недели: "..secToTime(pInfo.info.weekOnline))
        debug_log("(info) Новая неделя. (weekOnline = "..secToTime(pInfo.info.weekOnline)..")")
        -- Очищаем все счётчики, кроме настроек
        for key in pairs(pInfo) do
          if key ~= "settings" and key ~= "gov" then
            for k in pairs(pInfo[key]) do
              pInfo[key][k] = 0
            end
          end
        end
        pInfo.info.thisWeek = os.date("%W")
      end
      debug_log("(info) Новый день. (dayOnline = "..secToTime(pInfo.info.dayOnline)..")")
      pInfo.info.day = day
      pInfo.info.dayPM = 0
      pInfo.info.dayAFK = 0
      pInfo.info.dayOnline = 0
      pInfo.info.dayWorkOnline = 0
    end
      local cx, cy, cz = getCharCoordinates(PLAYER_PED)
      local zcode = getNameOfZone(cx, cy, cz)
      playerZone = getZones(zcode)
    if not doesFileExist("moonloader/config/fbitools/keys.json") then
        local fa = io.open("moonloader/config/fbitools/keys.json", "w")
        fa:close()
    else
        local fa = io.open("moonloader/config/fbitools/keys.json", 'r')
        if fa then
            config_keys = decodeJson(fa:read('*a'))
            if config_keys.megafkey == nil then config_keys.megafkey = { v = {18,77}} end
            if config_keys.dkldkey == nil then config_keys.dkldkey = { v = {18,80}} end
            if config_keys.cuffkey == nil then config_keys.cuffkey = { v = {}} end
            if config_keys.followkey == nil then config_keys.followkey = { v = {}} end
            if config_keys.cputkey == nil then config_keys.cputkey = { v = {}} end
            if config_keys.cejectkey == nil then config_keys.cejectkey = { v = {}} end
            if config_keys.takekey == nil then config_keys.takekey = { v = {}} end
            if config_keys.arrestkey == nil then config_keys.arrestkey = { v = {}} end
            if config_keys.uncuffkey == nil then config_keys.uncuffkey = { v = {}} end
        end
    end
    while not sampIsLocalPlayerSpawned() do wait(0) end
    while not doesFileExist('moonloader\\lib\\sphere.lua') or not doesFileExist('moonloader\\lib\\rkeys.lua') or not doesFileExist('moonloader\\lib\\imcustom\\hotkey.lua') or not doesFileExist('moonloader\\lib\\imgui.lua') or not doesFileExist('moonloader\\lib\\MoonImGui.dll') or not doesFileExist('moonloader\\lib\\imgui_addons.lua') do wait(0) end
    rkeys = require 'rkeys'
    hk = require 'lib.imcustom.hotkey'
    wm = require 'lib.windows.message'
    gk = require 'game.keys'
    Sphere = require 'Sphere'
    imgui = require 'imgui'
	getserial()
	ttest53()
    mainwin = imgui.ImBool(false)
    setwindows = imgui.ImBool(false)
    shpwindow = imgui.ImBool(false)
    ykwindow = imgui.ImBool(false)
    fpwindow = imgui.ImBool(false)
    akwindow = imgui.ImBool(false)
	tenwindow = imgui.ImBool(false)
    yswindow = imgui.ImBool(false)
    pozivn = imgui.ImBool(false)
    updwindows = imgui.ImBool(false)
    bMainWindow = imgui.ImBool(false)
    sInputEdit = imgui.ImBuffer(256)
    bIsEnterEdit = imgui.ImBool(false)
    imgui.HotKey = require('imgui_addons').HotKey
    apply_custom_style()
    addEventHandler("onWindowMessage", function (msg, wparam, lparam)
        if msg == wm.WM_KEYDOWN or msg == wm.WM_SYSKEYDOWN then
            if tEditData.id > -1 then
                if wparam == key.VK_ESCAPE then
                    tEditData.id = -1
                    consumeWindowMessage(true, true)
                elseif wparam == key.VK_TAB then
                    bIsEnterEdit.v = not bIsEnterEdit.v
                    consumeWindowMessage(true, true)
                end
            end
        end
    end)
	lua_thread.create(upd_locals)
    Sphere.createSphere(-1984.6375732422, 106.85540008545, 27.42943572998, 50.0)-- -1984.6375732422 106.85540008545 27.42943572998 -- АВСФ [1]
    Sphere.createSphere(-2055.283203125, -84.472702026367, 35.064281463623, 50.0)-- -2055.283203125 -84.472702026367 35.064281463623 -- АШ [2]
    Sphere.createSphere(-1521.4412841797, 503.20678710938, 6.7215604782104, 40.0)-- -1521.4412841797 503.20678710938 6.7215604782104 -- СФа [3]
    Sphere.createSphere(-1702.3824462891, 684.79150390625, 25.01790618896, 30.0)-- -1702.3824462891 684.79150390625 25.017906188965 -- Пост В СФПД [4]
    Sphere.createSphere(-1574.4406738281, 662.24047851563, 7.3254537582397, 20.0)-- -1574.4406738281 662.24047851563 7.3254537582397 Пост А СФПД [5]
    Sphere.createSphere(-2013.1629638672, 464.77380371094, 35.313331604004, 30.0)-- -2013.1629638672 464.77380371094 35.313331604004 -- СФн [6]
    Sphere.createSphere(-1749.7822265625, -591.34033203125, 16.62273979187, 100.0)-- -1749.7822265625 -591.34033203125 16.62273979187 -- Тоннель [7]
    Sphere.createSphere(1481.77734375, -1739.9536132813, 13.546875, 70.0)-- 1481.77734375 -1739.9536132813 13.546875 -- Мэрия [8]
    Sphere.createSphere(-2448.3591308594, 725.09326171875, 34.756977081299, 70.0)-- -2448.3591308594 725.09326171875 34.756977081299 -- Хот-Доги [9]
    Sphere.createSphere(1186.5642089844, -1322.2257080078,13.098788261414, 50.0)-- 1186.5642089844 -1322.2257080078 13.098788261414 -- Больница ЛС [10]
    Sphere.createSphere(1195.8181152344, -1741.1024169922, 13.131011962891, 70.0)-- 1195.8181152344 -1741.1024169922 13.131011962891 -- АВ ЛС [11]
    Sphere.createSphere(1667.1462402344, -768.31890869141, 54.092594146729, 70.0)-- 1667.1462402344 -768.31890869141 54.092594146729 -- Мост ЛС-ЛВ [12]
    Sphere.createSphere(1766.12109375,   874.89379882813,   10.887091636658, 70.0)-- 1820.5036621094 816.41632080078 10.8203125 -- Перекросток LVPD [13]
    Sphere.createSphere(1155.6971435547, 831.9443359375, 10.409364700317, 80.0)-- 1155.6971435547 831.9443359375 10.409364700317 Развилка LVPD [14]
    Sphere.createSphere(2033.3028564453, 1007.163269043, 10.8203125, 50.0)-- 2033.3028564453 1007.163269043 10.8203125 Постовой В LVPD [4 Дракона] [15]
    Sphere.createSphere(2824.7353515625, 1292.9085693359, 10.764576911926, 50.0)-- 2824.7353515625 1292.9085693359 10.764576911926 Постовой А LVPD [АВЛВ] [16]
    Sphere.createSphere(2180.99609375, 1676.2248535156, 11.060985565186, 50.0)-- 2180.99609375 1676.2248535156 11.060985565186 Постовой В LVPD [Каллигула] [17]
    Sphere.createSphere(1727.3302001953, 1618.9171142578, 9.8169927597046, 50.0)-- 1727.3302001953 1618.9171142578 9.8169927597046 -- Пост С LVPD [18]
    Sphere.createSphere(1545.6296386719, -1631.2828369141, 13.3828125, 50.0)-- 1545.6296386719 -1631.2828369141 13.3828125 -- КПП ЛСПД [19]
    Sphere.createSphere(2753.5388183594, -2432.2268066406, 13.64318561554, 80.0)-- 2753.5388183594 -2432.2268066406 13.64318561554 -- Порт ЛС[20]
    Sphere.createSphere(2293.4145507813, -1584.8774414063, 3.5703411102295, 670.0)--  2293.4145507813 -1584.8774414063 3.5703411102295 -- Патруль гетто [21]
    Sphere.createSphere(186.95843505859, 1901.0294189453, 17.640625, 300.0)-- 186.95843505859 1901.0294189453 17.640625 -- Патруль ЛВа [22]
    Sphere.createSphere(-422, -1195, 60, 500.0)-- -422 -1195 60 --Юрисдикция ЛС - СФ [23]
    Sphere.createSphere(1644, -25, 36, 300.0)-- 1644 -25 36 --Юрисдикция ЛС - ЛВ [24]
    Sphere.createSphere(413, 625, 18, 300.0)-- 413 625 18 Юрисдикция ЛС- ЛВ 2 [25]
    Sphere.createSphere(-129, 518, 8, 300.0)-- -129 518 8 Юрисдикция ЛС - ЛВ 3 [26]
    Sphere.createSphere(-1003, 1285, 40, 300.0)-- -1003 1285 40 Юрисдикция СФ - ЛВ [27]
    Sphere.createSphere(-2126, 2654, 53, 300.0)-- -2126 2654 53 Юрисдикция СФ - ЛВ 2 [28]
    Sphere.createSphere(-1006, -442, 36, 300.0)-- -1006 -442 36 Юрисдикция ЛС - СФ 2 [29]
    Sphere.createSphere(-1126, -2574, 72, 300.0)-- -1126 -2574 72 Юрисдикция ЛС - СФ 3 [30]
    Sphere.createSphere(-1248, -2867, 64, 300.0)-- -1248 -2867 64 Юрисдикция ЛС- СФ 4 [31]
    Sphere.createSphere(2238.6533203125,   2449.4895019531,   11.037217140198, 10.0) -- 2238.6533203125   2449.4895019531   11.037217140198 -- КПП ЛВПД [32]
    Sphere.createSphere(2458.4575195313,   1340.5772705078,   10.9765625, 30) -- 2458.4575195313   1340.5772705078   10.9765625 -- LVPD D [33]
    Sphere.createSphere(373.66720581055,   173.75173950195,   1008.3893432617, 30) -- 373.66720581055,   173.75173950195,   1008.3893432617 -- Холл мэрии [34]
    commands()
    mcheckf()
    shpf()
    ykf()
    akf()
    fpf()
    ysf()
	ten()
	suf()
    wait(1000)
	for k, v in pairs(tBindList) do
		rkeys.registerHotKey(v.v, true, onHotKey)
    end
    tazerbind = rkeys.registerHotKey(config_keys.tazerkey.v, true, function() sampSendChat('/tazer') end)
    fastmenubind = rkeys.registerHotKey(config_keys.fastmenukey.v, true, function() lua_thread.create(function() submenus_show(fthmenu, '{0C2265}FBI Tools') end) end)
    oopdabind = rkeys.registerHotKey(config_keys.oopda.v, true, oopdakey)
    oopnetbind = rkeys.registerHotKey(config_keys.oopnet.v, true, oopnetkey)
    megafbind = rkeys.registerHotKey(config_keys.megafkey.v, true, megaf)
    dkldbind = rkeys.registerHotKey(config_keys.dkldkey.v, true, dkld)
    cuffbind = rkeys.registerHotKey(config_keys.cuffkey.v, true, cuffk)
    followbind = rkeys.registerHotKey(config_keys.followkey.v, true, followk)
    cputbind = rkeys.registerHotKey(config_keys.cputkey.v, true, cputk)
    cejectbind = rkeys.registerHotKey(config_keys.cejectkey.v, true, cejectk)
    takebind = rkeys.registerHotKey(config_keys.takekey.v, true, takek)
    arrestbind = rkeys.registerHotKey(config_keys.arrestkey.v, true, arrestk)
    uncuffbind = rkeys.registerHotKey(config_keys.uncuffkey.v, true, uncuffk)
    nizfont = renderCreateFont('Ariel', 10, 9)
    if not sampIsDialogActive() then
        checkStats()
    else
        while sampIsDialogActive() do wait(0) end
        checkStats()
    end
    while true do wait(0)
        if #departament > 25 then table.remove(departament, 1) end
        if #radio > 25 then table.remove(radio, 1) end
        if #wanted > 25 then table.remove(wanted, 1) end
        if #sms > 25 then table.remove(sms, 1) end
        infbar = imgui.ImBool(cfg.main.hud)
        imgui.Process = mainwin.v or infbar.v or shpwindow.v or ykwindow.v or fpwindow.v or akwindow.v or yswindow.v or tenwindow.v
        function imgui.CentrText(text)
            local width = imgui.GetWindowWidth()
            local calc = imgui.CalcTextSize(text)
            imgui.SetCursorPosX( width / 2 - calc.x / 2 )
            imgui.Text(text)
        end
		if sampIsDialogActive() == false and not isPauseMenuActive() and isPlayerPlaying(playerHandle) and sampIsChatInputActive() == false then
            if coordX ~= nil and coordY ~= nil then
                cX, cY, cZ = getCharCoordinates(playerPed)
                cX = math.ceil(cX)
                cY = math.ceil(cY)
                cZ = math.ceil(cZ)
                ftext('Метка установлена на '..kvadY..'-'..kvadX)
                placeWaypoint(coordX, coordY, 0)
                coordX = nil
                coordY = nil
            end
        end
        function imgui.CustomButton(name, color, colorHovered, colorActive, size)
            local clr = imgui.Col
            imgui.PushStyleColor(clr.Button, color)
            imgui.PushStyleColor(clr.ButtonHovered, colorHovered)
            imgui.PushStyleColor(clr.ButtonActive, colorActive)
            if not size then size = imgui.ImVec2(0, 0) end
            local result = imgui.Button(name, size)
            imgui.PopStyleColor(3)
            return result
        end
        function imgui.OnDrawFrame()
            if infbar.v then
                imgui.ShowCursor = false
                _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
                local myname = sampGetPlayerNickname(myid)
                local myping = sampGetPlayerPing(myid)
                local myweapon = getCurrentCharWeapon(PLAYER_PED)
                local myweaponammo = getAmmoInCharWeapon(PLAYER_PED, myweapon)
                local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE)
                local myweaponname = getweaponname(myweapon)
                imgui.SetNextWindowPos(imgui.ImVec2(cfg.main.posX, cfg.main.posY), imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(cfg.main.widehud, 140), imgui.Cond.FirstUseEver)
                imgui.Begin('FBI ONE LOVE IN MY HEART <3', infbar, imgui.WindowFlags.NoResize + imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoTitleBar)
                --imgui.CentrText('FBI ONE LOVE IN MY HEART <3')
                --imgui.Separator()
                imgui.Text(u8('Ваше имя: '..myname..'['..myid..'] | Пинг: '..myping)) -- простой текст внутри этого окна
                imgui.Text(u8('Текущее оружие: '..myweaponname..'['..myweaponammo..']'))
                if isCharInAnyCar(playerPed) then
                    local vHandle = storeCarCharIsInNoSave(playerPed)
                    local result, vID = sampGetVehicleIdByCarHandle(vHandle)
                    local vHP = getCarHealth(vHandle)
                    local carspeed = getCarSpeed(vHandle)
                    local speed = math.floor(carspeed)
                    local vehName = getCarNamebyModel(getCarModel(storeCarCharIsInNoSave(playerPed)))
                    local ncspeed = math.floor(carspeed*2)
                    imgui.Text(u8('Т/С: '..vehName..'['..vID..'] | ХП: '..vHP..' | Скорость: '..ncspeed))
                else
                    imgui.Text(u8('Т/С: Нет'))
                end
                if valid and doesCharExist(ped) then -- если цель есть и персонаж существует
                    local result, id = sampGetPlayerIdByCharHandle(ped) -- получить samp-ид игрока по хендлу персонажа
                    if result then
                        local targetname = sampGetPlayerNickname(id) -- проверить, прошло ли получение ида успешно
                        local targetscore = sampGetPlayerScore(id)
                        imgui.Text(u8('Таргет: '..targetname..'['..id..'] | ЛВЛ: '..targetscore))
                    end
                else
                    imgui.Text(u8('Таргет: Нет'))
                end
                imgui.Text(u8('Сектор: '..kvadrat()..'| Локация: '..playerZone))
                imgui.Text(u8('Текущее время: '..os.date('%H:%M:%S')))
                if tazer == true then
                    imgui.Text(u8('Тайзер: Вкл'))
                else
                    imgui.Text(u8('Тайзер: Выкл'))
                end
                imgui.End()
            end
            if bMainWindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(800, 525), imgui.Cond.FirstUseEver)
                imgui.Begin(u8("FBI Tools | Биндер##main"), bMainWindow, imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoResize)
                imgui.Text(u8'Для корректной работы биндера рекомендуется перезагрузить скрипт после изменения настроек биндера.')
                imgui.Separator()
                imgui.BeginChild("##bindlist", imgui.ImVec2(795, 442))
                for k, v in ipairs(tBindList) do
                    if hk.HotKey("##HK" .. k, v, tLastKeys, 100) then
                        if not rkeys.isHotKeyDefined(v.v) then
                            if rkeys.isHotKeyDefined(tLastKeys.v) then
                                rkeys.unRegisterHotKey(tLastKeys.v)
                            end
                            rkeys.registerHotKey(v.v, true, onHotKey)
                        end
                    end
                    imgui.SameLine()
                    if tEditData.id ~= k then
                        local sText = v.text:gsub("%[enter%]$", "")
                        imgui.BeginChild("##cliclzone" .. k, imgui.ImVec2(500, 21))
                        imgui.AlignTextToFramePadding()
                        if sText:len() > 0 then
                            imgui.Text(u8(sText))
                        else
                            imgui.TextDisabled(u8("Пустое сообщение ..."))
                        end
                        imgui.EndChild()
                        if imgui.IsItemClicked() then
                            sInputEdit.v = sText:len() > 0 and u8(sText) or ""
                            bIsEnterEdit.v = string.match(v.text, "(.)%[enter%]$") ~= nil
                            tEditData.id = k
                            tEditData.inputActve = true
                        end
                    else
                        imgui.PushAllowKeyboardFocus(false)
                        imgui.PushItemWidth(500)
                        local save = imgui.InputText(k.."##Edit" .. k, sInputEdit, imgui.InputTextFlags.EnterReturnsTrue)
                        imgui.PopItemWidth()
                        imgui.PopAllowKeyboardFocus()
                        imgui.SameLine()
                        imgui.Checkbox(u8("Ввод") .. "##editCH" .. k, bIsEnterEdit)
                        if save then
                            tBindList[tEditData.id].text = u8:decode(sInputEdit.v) .. (bIsEnterEdit.v and "[enter]" or "")
                            tEditData.id = -1
                        end
                        if tEditData.inputActve then
                            tEditData.inputActve = false
                            imgui.SetKeyboardFocusHere(-1)
                        end
                    end
                end
                imgui.EndChild()
                imgui.Separator()
                if imgui.Button(u8"Добавить клавишу") then
                    tBindList[#tBindList + 1] = {text = "", v = {}}
                end
            imgui.End()
            end
            if setwindows.v then
                local cput =  imgui.ImBool(cfg.commands.cput)
                local ceject = imgui.ImBool(cfg.commands.ceject)
                local ftazer = imgui.ImBool(cfg.commands.ftazer)
                local deject = imgui.ImBool(cfg.commands.deject)
                local stateb = imgui.ImBool(cfg.main.male)
				local autobp = imgui.ImBool(cfg.main.autobp)
                local tagf = imgui.ImBuffer(u8(cfg.main.tar), 256)
                local parolf = imgui.ImBuffer(u8(cfg.main.parol), 256)
				local seckey1 = imgui.ImBuffer(u8(cfg.main.seckey), 256)
                local tagb = imgui.ImBool(cfg.main.tarb)
                local xcord = imgui.ImInt(cfg.main.posX)
                local ycord = imgui.ImInt(cfg.main.posY)
                local clistbuffer = imgui.ImInt(cfg.main.clist)
                local waitbuffer = imgui.ImInt(cfg.commands.zaderjka)
                local clistb = imgui.ImBool(cfg.main.clistb)
                local parolb = imgui.ImBool(cfg.main.parolb)
				local seckey2 = imgui.ImBool(cfg.main.seckey2)
                local offptrlb = imgui.ImBool(cfg.main.offptrl)
                local offwntdb = imgui.ImBool(cfg.main.offwntd)
                local ticketb = imgui.ImBool(cfg.commands.ticket)
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(15,6))
                imgui.Begin(u8'Настройки##1', setwindows)
                imgui.BeginChild('##set', imgui.ImVec2(140, 400), true)
                if imgui.Selectable(u8'Основные') then show = 1 end
                if imgui.Selectable(u8'Команды') then show = 2 end
                if imgui.Selectable(u8'Клавиши') then show = 5 end
                if parolb.v then
                    if imgui.Selectable(u8'Авто логин') then show = 3 end
                end
				if seckey2.v then
					if imgui.Selectable(u8'Статистика') then show = 4 end
				end
                imgui.EndChild()
                imgui.SameLine()
                imgui.BeginChild('##set1', imgui.ImVec2(800, 400), true)
                if show == 1 then
                    if imgui.Checkbox(u8'Скрывать сообщения о начале преследования', offptrlb) then
                        cfg.main.offptrl = not cfg.main.offptrl
                    end
                    if imgui.Checkbox(u8'Скрывать сообщения о выдаче розыска', offwntdb) then
                        cfg.main.offwntd = not cfg.main.offwntd
                    end
                    if imgui.Checkbox(u8'Мужские отыгровки', stateb) then
                        cfg.main.male = not cfg.main.male
                    end
                    if imgui.Checkbox(u8'Использовать автотег', tagb) then
                        cfg.main.tarb = not cfg.main.tarb
                    end
					if imgui.Checkbox(u8'Авто-взятие боеприпасов.', autobp) then
                        cfg.main.autobp = not cfg.main.autobp
					end
                    if tagb.v then
                        if imgui.InputText(u8'Введите ваш Тег.', tagf) then
                            cfg.main.tar = u8:decode(tagf.v)
                        end
                    end
                    if imgui.Checkbox(u8'Использовать авто логин', parolb) then
                        cfg.main.parolb = not cfg.main.parolb
                    end
					if imgui.Checkbox(u8'Использовать авто googlecode', seckey2) then
                        cfg.main.seckey2 = not cfg.main.seckey2
                    end
                    if imgui.Checkbox(u8'Использовать автоклист', clistb) then
                        cfg.main.clistb = not cfg.main.clistb
                    end
                    if clistb.v then
                        if imgui.SliderInt(u8"Выберите значение клиста", clistbuffer, 0, 33) then
                            cfg.main.clist = clistbuffer.v
                        end
                    end
                    if imgui.InputInt(u8'Задержка в отыгровках', waitbuffer) then
                        cfg.commands.zaderjka = waitbuffer.v
                    end
                end
                if show == 2 then
                    if imgui.Checkbox(u8('Отыгровка /cput'), cput) then
                        cfg.commands.cput = not cfg.commands.cput
                    end
                    if imgui.Checkbox(u8('Отыгровка /ceject'), ceject) then
                        cfg.commands.ceject = not cfg.commands.ceject
                    end
                    if imgui.Checkbox(u8('Отыгровка /ftazer'), ftazer) then
                        cfg.commands.ftazer = not cfg.commands.ftazer
                    end
                    if imgui.Checkbox(u8('Отыгровка /deject'), deject) then
                        cfg.commands.deject = not cfg.commands.deject
                    end
                    if imgui.Checkbox(u8('Отыгровка /ticket'), ticketb) then
                        cfg.commands.ticket = not cfg.commands.ticket
                    end
                end
                if show == 3 then
                    if imgui.InputText(u8'Введите ваш пароль.', parolf, imgui.InputTextFlags.Password) then
                        cfg.main.parol = u8:decode(parolf.v)
                    end
                    if imgui.Button(u8'Узнать пароль') then
                        ftext('Ваш пароль: '..cfg.main.parol)
                    end
                end
				if show == 4 then
				    imgui.Text(u8"Отыграно за сегодня:"); imgui.SameLine(spacing); imgui.Text(('%s'):format(secToTime(pInfo.info.dayOnline)))
					imgui.Text(u8"Из них на работе:"); imgui.SameLine(spacing); imgui.Text(('%s'):format(secToTime(pInfo.info.dayWorkOnline)))
					imgui.Text(u8"AFK за сегодня:"); imgui.SameLine(spacing); imgui.Text(('%s'):format(secToTime(pInfo.info.dayAFK)))
					imgui.Separator()
					imgui.Text(u8"Отыграно за неделю:"); imgui.SameLine(spacing); imgui.Text(('%s'):format(secToTime(pInfo.info.weekOnline)))
					imgui.Text(u8"Из них на работе:"); imgui.SameLine(spacing); imgui.Text(('%s'):format(secToTime(pInfo.info.weekWorkOnline)))
                end
                if show == 5 then
                    if imgui.HotKey(u8'##Клавиша быстрого тазера', config_keys.tazerkey, tLastKeys, 100) then
                        rkeys.changeHotKey(tazerbind, config_keys.tazerkey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.tazerkey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8'Клавиша быстрого тазера')
                    if imgui.HotKey('##fastmenu', config_keys.fastmenukey, tLastKeys, 100) then
                        rkeys.changeHotKey(fastmenubind, config_keys.fastmenukey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.fastmenukey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Клавиша быстрого меню'))
                    if imgui.HotKey('##oopda', config_keys.oopda, tLastKeys, 100) then
                        rkeys.changeHotKey(oopdabind, config_keys.oopda.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.oopda.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Клавиша подтверждения'))
                    if imgui.HotKey('##oopnet', config_keys.oopnet, tLastKeys, 100) then
                        rkeys.changeHotKey(oopnetbind, config_keys.oopnet.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Клавиша отмены'))
                    if imgui.HotKey('##megaf', config_keys.megafkey, tLastKeys, 100) then
                        rkeys.changeHotKey(megafbind, config_keys.megafkey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.megafkey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Клавиша мегафона'))
                    if imgui.HotKey('##dkld', config_keys.dkldkey, tLastKeys, 100) then
                        rkeys.changeHotKey(dkldbind, config_keys.dkldkey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.dkldkey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Клавиша доклада'))
                    if imgui.HotKey('##cuff', config_keys.cuffkey, tLastKeys, 100) then
                        rkeys.changeHotKey(cuffbind, config_keys.cuffkey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.cuffkey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Надеть наручники на преступника'))
                    if imgui.HotKey('##uncuff', config_keys.uncuffkey, tLastKeys, 100) then
                        rkeys.changeHotKey(uncuffbind, config_keys.uncuffkey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.uncuffkey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Снять наручники'))
                    if imgui.HotKey('##follow', config_keys.followkey, tLastKeys, 100) then
                        rkeys.changeHotKey(followbind, config_keys.followkey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.followkey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Вести преступника за собой'))
                    if imgui.HotKey('##cput', config_keys.cputkey, tLastKeys, 100) then
                        rkeys.changeHotKey(cputbind, config_keys.cputkey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.cputkey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Посадить преступника в авто'))
                    if imgui.HotKey('##ceject', config_keys.cejectkey, tLastKeys, 100) then
                        rkeys.changeHotKey(cejectbind, config_keys.cejectkey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.cejectkey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Высадить преступника в участок'))
                    if imgui.HotKey('##take', config_keys.takekey, tLastKeys, 100) then
                        rkeys.changeHotKey(takebind, config_keys.takekey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.takekey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Обыскать преступника'))
                    if imgui.HotKey('##arrest', config_keys.arrestkey, tLastKeys, 100) then
                        rkeys.changeHotKey(arrestbind, config_keys.arrestkey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.arrestkey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Арестовать преступника'))
                end
                imgui.EndChild()
                imgui.End()
            end
            if mainwin.v then
				imgui.LockPlayer = true
                imgui.ShowCursor = true
                local x, y = getScreenResolution()
                local btn_size = imgui.ImVec2(-0.1, 0)
                imgui.SetNextWindowSize(imgui.ImVec2(300, 300), imgui.Cond.FirstUseEver)
                imgui.SetNextWindowPos(imgui.ImVec2(x/2, y/2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.Begin(u8'Главное меню', mainwin)
                if imgui.Button(u8'Биндер', btn_size) then
                    bMainWindow.v = not bMainWindow.v
                end
                if imgui.Button(u8(cfg.main.hud and 'Выключить инфо-бар' or 'Включить инфобар'), btn_size) then
                    cfg.main.hud = not cfg.main.hud
                    ftext(cfg.main.hud and 'Инфо-бар включен' or 'Инфо-бар выключен')
                end
                if imgui.Button(u8(cfg.main.nwanted and 'Выключить обновленный Wanted' or 'Включить обновленный Wanted'), btn_size) then
                    cfg.main.nwanted = not cfg.main.nwanted
                    ftext(cfg.main.nwanted and 'Обновленый Wanted включен' or 'Обновленый Wanted выключен')
                end
                if imgui.Button(u8(cfg.main.nclear and 'Выключить дополненый Clear' or 'Включить дополненый Clear'), btn_size) then --дополненый Clear
                    cfg.main.nclear = not cfg.main.nclear
                    ftext(cfg.main.nclear and 'Дополненый Clear включен' or 'Дополненый Clear выключен')
                end
                if imgui.Button(u8'Настройки скрипта', btn_size) then
                    setwindows.v = not setwindows.v
                end
                --[[colors[clr.Button]                 = ImVec4(0.26, 0.59, 0.98, 0.40)
                    colors[clr.ButtonHovered]          = ImVec4(0.26, 0.59, 0.98, 1.00)
                    colors[clr.ButtonActive]           = ImVec4(0.06, 0.53, 0.98, 1.00)]]
                if imgui.CustomButton(u8('Сохранить настройки'), imgui.ImVec4(0.61, 0.10, 0.11, 0.40), imgui.ImVec4(0.61, 0.10, 0.11, 1.00), imgui.ImVec4(0.61, 0.10, 0.11, 0.76), btn_size) then
                    inicfg.save(fbitools, 'fbitools/config.ini')
					ftext('Настройки успешно сохранены.')
                end
                if imgui.Button(u8'Перезагрузить скрипт', btn_size) then
                    showCursor(false)
                    thisScript():reload()
                end
                imgui.End()
            end
            if shpwindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(iScreenWidth/2, iScreenHeight / 2), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Шпора'), shpwindow)
                for line in io.lines('moonloader\\fbitools\\shp.txt') do
                    imgui.TextWrapped(u8(line))
                end
                imgui.End()
            end
            if akwindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(iScreenWidth/2, iScreenHeight / 2), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Административный кодекс'), akwindow)
                for line in io.lines('moonloader\\fbitools\\ak.txt') do
                    imgui.TextWrapped(u8(line))
                end
                imgui.End()
            end
            if fpwindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(iScreenWidth/2, iScreenHeight / 2), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Федеральное постановление'), fpwindow)
                for line in io.lines('moonloader\\fbitools\\fp.txt') do
                    imgui.TextWrapped(u8(line))
                end
                imgui.End()
            end
            if ykwindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(iScreenWidth/2, iScreenHeight / 2), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Уголовный кодекс'), ykwindow)
                for line in io.lines('moonloader\\fbitools\\yk.txt') do
                    imgui.TextWrapped(u8(line))
                end
                imgui.End()
            end
			if tenwindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(iScreenWidth/2, iScreenHeight / 2), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Тен-Коды'), tenwindow)
                for line in io.lines('moonloader\\fbitools\\ten.txt') do
                    imgui.TextWrapped(u8(line))
                end
                imgui.End()
            end
            if yswindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(iScreenWidth/2, iScreenHeight / 2), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Устав'), yswindow)
                for line in io.lines('moonloader\\fbitools\\ys.txt') do
                    imgui.TextWrapped(u8(line))
                end
                imgui.End()
            end
            if updwindows.v then
                local updlist = ttt
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(700, 290), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Обновление'), updwindows, imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoResize)
                imgui.Text(u8('Вышло обновление скрипта FBI Tools! Что бы обновиться нажмите кнопку внизу. Список изменений:'))
                imgui.Separator()
                imgui.BeginChild("uuupdate", imgui.ImVec2(690, 200))
                for line in ttt:gmatch('[^\r\n]+') do
                    imgui.Text(line)
                end
                imgui.EndChild()
                imgui.Separator()
                imgui.PushItemWidth(305)
                if imgui.Button(u8("Обновить"), imgui.ImVec2(339, 25)) then
                    lua_thread.create(goupdate)
                    updwindows.v = false
                end
                imgui.SameLine()
                if imgui.Button(u8("Отложить обновление"), imgui.ImVec2(339, 25)) then
                    updwindows.v = false
                end
                imgui.End()
            end
        end
        function rkeys.onHotKey(id, keys)
            if sampIsChatInputActive() or sampIsDialogActive() or isSampfuncsConsoleActive() then
                return false
            end
        end
        function Sphere.onEnterSphere(id)
            post = id
        end
        function Sphere.onExitSphere(id)
              post = nil
        end
        local myskin = getCharModel(PLAYER_PED)
        local mmx, mmy, mmz = getCharCoordinates(PLAYER_PED)
        if megaftimer ~= nil then
            if megaftimer <= os.time() then
                ftext('Время погони истекло')
                gmegafid = nil
                gmegaflvl = nil
                gmegaffrak = nil
                megaftimer = nil
                gmegafhandle = nil
            end
        end
        if not doesCharExist(gmegafhandle) and gmegafhandle ~= nil then
            ftext(string.format('Игрок {0C2265}%s [%s] {ffffff}потерян из поля зрения', sampGetPlayerNickname(gmegafid), gmegafid))
            gmegafid = -1
			gmegaflvl = nil
			gmegaffrak = nil
            gmegafhandle = nil
        end
        if myskin == 280 or myskin == 265 or myskin == 266 or myskin == 267 or myskin == 281 or myskin == 282 or myskin == 288 or myskin == 284 or myskin == 285 or myskin == 304 or myskin == 305 or myskin == 306 or myskin == 307 or myskin == 309 or myskin == 283 or myskin == 286 or myskin == 287 or myskin == 252 or myskin == 279 or myskin == 163 or myskin == 164 or myskin == 165 or myskin == 166 then
            rabden = true
        end
		if check then
			sampSendClickTextdraw(2168)
			wait(200)
			sampSendClickTextdraw(2172)
			wait(200)
			sampSendClickTextdraw(2171)
			wait(200)
			sampSendClickTextdraw(2169)
			wait(200)
			sampSendClickTextdraw(2170)
		end
        if changetextpos then
            sampToggleCursor(true)
            local CPX, CPY = getCursorPos()
            cfg.main.posX = CPX
            cfg.main.posY = CPY
        end
        local myhp = getCharHealth(PLAYER_PED)
        local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE)
        if valid and doesCharExist(ped) then
            local result, id = sampGetPlayerIdByCharHandle(ped)
            if result and wasKeyPressed(key.VK_E) then
                gmegafhandle = ped
                gmegafid = id
                gmegaflvl = sampGetPlayerScore(id)
                gmegaffrak = getFraktionBySkin(id)
                --[[ftext(gmegafid)
                ftext(gmegaflvl)
                ftext(gmegaffrak)]]
				megaftimer = os.time() + 300
                submenus_show(pkmmenu(id), "{0C2265}FBI Tools {ffffff}| "..sampGetPlayerNickname(id).."["..id.."] ")
            end
        end
        oopchat()
        local result, button, list, input = sampHasDialogRespond(1385)
        local result1, button, list, input = sampHasDialogRespond(1386)
        local result2, button, list, input = sampHasDialogRespond(1387)
        local result3, button, list, input = sampHasDialogRespond(1388)
        local result4, button, list, input = sampHasDialogRespond(1389)
        local result5, button, list, input = sampHasDialogRespond(1390)
        local result6, button, list, input = sampHasDialogRespond(1391)
        local result7, button, list, input = sampHasDialogRespond(1392)
        local result8, button, list, input = sampHasDialogRespond(1393)
        local result9, button, list, input = sampHasDialogRespond(1394)
        local result10, button, list, input = sampHasDialogRespond(1395)
        local result11, button, list, input = sampHasDialogRespond(1396)
        local result12, button, list, input = sampHasDialogRespond(1397)
        local result13, button, list, input = sampHasDialogRespond(1398)
        local result14, button, list, input = sampHasDialogRespond(1399)
        local result15, button, list, input = sampHasDialogRespond(1400)
        local result16, button, list, input = sampHasDialogRespond(1401)
        local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
        if result16 then
            if input ~= '' and button == 1 then
                if cfg.main.tarb then
                    sampSendChat(string.format('/r [%s] Запрашиваю эвакуацию в квадрат %s на %s', cfg.main.tar, kvadrat(), input))
                else
                    sampSendChat(string.format('/r Запрашиваю эвакуацию в квадрат %s на %s', kvadrat(), input))
                end
            end
        end
        if result then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в одежду гражданского. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в одежду гражданского. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result1 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму полицейского. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму полицейского. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result2 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму армейского. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму армейского. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result3 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму медика. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму медика. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result4 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму работника мэрии. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму работника мэрии. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result5 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму работника автошколы. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму работника автошколы. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result6 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму работника новостей. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму работника новостей. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result7 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму ЧОП LCN. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму ЧОП LCN. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result8 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму ЧОП Yakuza. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму ЧОП Yakuza. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result9 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму ЧОП РМ. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму ЧОП РМ. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result10 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму БК Rifa. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму БК Rifa. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result11 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму БК Grove. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму БК Grove. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result12 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму БК Ballas. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму БК Ballas. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result13 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму БК Vagos. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму БК Vagos. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result14 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму БК Aztec. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделся в форму БК Aztec. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result15 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в одежду байкеров. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в одежду байкеров. Причина: "..input)
                    wait(1200)
                    sampSendChat("/rb "..myid)
                end
            end
        end
    end
end
function onHotKey(id, keys)
	local sKeys = tostring(table.concat(keys, " "))
	for k, v in pairs(tBindList) do
		if sKeys == tostring(table.concat(v.v, " ")) then
			if tostring(v.text):len() > 0 then
				local bIsEnter = string.match(v.text, "(.)%[enter%]$") ~= nil
				if bIsEnter then
					sampProcessChatInput(v.text:gsub("%[enter%]$", ""))
				else
					sampSetChatInputText(v.text)
					sampSetChatInputEnabled(true)
				end
			end
		end
	end
end

--COMMANDS--
function su(pam)
    pID = tonumber(pam)
    if pID ~= nil then
        if sampIsPlayerConnected(pID) then
            lua_thread.create(function()
                submenus_show(sumenu(pID), "{0C2265}FBI Tools {ffffff}| "..sampGetPlayerNickname(pID).."["..pID.."] ")
            end)
        else
            ftext("Игрок с ID: "..pID.." не подключен к серверу")
        end
    else
        ftext("Введите: /su [id]")
    end
end
function ssu(pam)
    local id, zv, orichina = pam:match('(%d+) (%d+) (.+)')
    if id and zv and orichina then
        sampSendChat(string.format('/su %s %s %s', id, zv, orichina))
    else
        ftext('Введите: /ssu [id] [кол-во звезд] [причина]')
    end
end
function tazer()
    if cfg.main.male == true then
        lua_thread.create(function()
            sampSendChat("/tazer")
            wait(1200)
            sampSendChat("/me сменил тип патронов")
        end)
    end
    if cfg.main.male == false then
        lua_thread.create(function()
            sampSendChat("/tazer")
            wait(1200)
            sampSendChat("/me сменила тип патронов")
        end)
    end
end
function keys()
    if cfg.main.male == true then
        lua_thread.create(function()
            sampSendChat("/me взял ключ")
            wait(cfg.commands.zaderjka)
            sampSendChat("/try ключи схожы с ключами от КПЗ")
        end)
    end
    if cfg.main.male == false then
        lua_thread.create(function()
            sampSendChat("/me взяла ключ")
            wait(cfg.commands.zaderjka)
            sampSendChat("/try ключи схожы с ключами от КПЗ")
        end)
    end
end
function oop(pam)
    pID = tonumber(pam)
    if frak == 'FBI' or frak == 'LSPD' or frak == 'SFPD' or frak == 'LVPD' then
        if rang == 'Кадет' or rang == 'Офицер' or rang == 'Мл.Сержант' or  rang == 'Сержант' or  rang == 'Прапорщик' then
            if pID == nil then
                ftext("Введите: /oop [id]")
            end
            if pID ~= nil and sampIsPlayerConnected(pID) then
                if not cfg.main.tarb then
                    sampSendChat("/r Дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." ("..pID..") рассмотрению не подлежит, ООП, объявите.")
                else
                    sampSendChat("/r ["..cfg.main.tar.."]: Дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." ("..pID..") рассмотрению не подлежит, ООП, объявите.")
                end
            end
            if pID ~= nil and not sampIsPlayerConnected(pID) then
                ftext("Игрок с ID: "..pID.." не подключен к серверу")
            end
        else
            if pID == nil then
                ftext("Введите: /oop [id]", -1)
            end
            if pID ~= nil and sampIsPlayerConnected(pID) then
                sampSendChat("/d Mayor, дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." рассмотрению не подлежит, ООП.")
            else
                ftext("Игрок с ID: "..pID.." не подключен к серверу")
            end
        end
    else
        ftext("Вы не сотрудник ПД/FBI")
    end
end
function cput(pam)
    local id, seat = string.match(pam, '(%d+)%s*(%d*)')
    if cfg.commands.cput == true then
        if cfg.main.male == true then
            if id == nil or seat == nil then
                ftext("Введите: /cput [id] [seat]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                if seat == "" or seat < "1" or seat > "3" then
                    ftext("Введите: /cput [id] [seat(1-3]", -1)
                elseif seat == "1" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадил "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(1200)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыл дверь автомобиля и затолкнул туда "..sampGetPlayerNickname(id))
                            wait(1200)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    end
                elseif seat =="2" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадил "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(1200)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыл дверь автомобиля и затолкнул туда "..sampGetPlayerNickname(id))
                            wait(1200)
                            sampSendChat("/cput "..id.." 2", -1)
                        end)
                    end
                elseif seat == "3" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадил "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(1200)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыл дверь автомобиля и затолкнул туда "..sampGetPlayerNickname(id))
                            wait(1200)
                            sampSendChat("/cput "..id.." 3", -1)
                        end)
                    end
                end
            end
        end
        if cfg.main.male == false then
            if id == nil or seat == nil then
                ftext("Введите: /cput [id] [seat]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                if seat == "" or seat < "1" or seat > "3" then
                    ftext("Введите: /cput [id] [seat]")
                elseif seat == "1" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадила "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(1200)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыла дверь автомобиля и затолкнула туда "..sampGetPlayerNickname(id))
                            wait(1200)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    end
                elseif seat =="2" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадила "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(1200)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыла дверь автомобиля и затолкнула туда "..sampGetPlayerNickname(id))
                            wait(1200)
                            sampSendChat("/cput "..id.." 2", -1)
                        end)
                    end
                elseif seat == "3" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадила "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(1200)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыла дверь автомобиля и затолкнула туда "..sampGetPlayerNickname(id))
                            wait(1200)
                            sampSendChat("/cput "..id.." 3", -1)
                        end)
                    end
                end
            end
        end
    else
        if pam ~= nil then
            sampSendChat('/cput '..pam)
        else
            ftext("Введите: /cput [id] [seat]")
        end
    end
end
function get_pickup_model(id, handle)
  local stPickup = sampGetPickupPoolPtr()
  local handle = id * 20
  local result = handle + 61444
  local result = result + stPickup
  local modelid = readMemory(result, 4, true)
  return modelid
end
function ceject(pam)
    local id = tonumber(pam)
    if cfg.commands.ceject == true then
        if cfg.main.male == true then
            if id == nil then
                ftext("Введите: /ceject [id]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                if isCharOnAnyBike(playerPed) then
                    lua_thread.create(function()
                        sampSendChat("/me высадил "..sampGetPlayerNickname(id).." из мотоцикла")
                        wait(1200)
                        sampSendChat("/ceject "..id, -1)
                    end)
                else
                    lua_thread.create(function()
                        sampSendChat("/me открыл дверь автомобиля и высадил "..sampGetPlayerNickname(id))
                        wait(1200)
                        sampSendChat("/ceject "..id)
                    end)
                end
            end
        end
        if cfg.main.male == false then
            if id == nil then
                ftext("Введите: /ceject [id]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                if isCharOnAnyBike(playerPed) then
                    lua_thread.create(function()
                        sampSendChat("/me высадила "..sampGetPlayerNickname(id).." из мотоцикла")
                        wait(1200)
                        sampSendChat("/ceject "..id, -1)
                    end)
                else
                    lua_thread.create(function()
                        sampSendChat("/me открыла дверь автомобиля и высадила "..sampGetPlayerNickname(id))
                        wait(1200)
                        sampSendChat("/ceject "..id)
                    end)
                end
            end
        end
    else
        if pam ~= nil then
            sampSendChat('/ceject '..pam)
        else
            ftext("Введите: /ceject [id]")
        end
    end
end
function st(pam)
    local id = tonumber(pam)
    local result, ped = sampGetCharHandleBySampPlayerId(id)
    if id == nil then
        sampSendChat('/m ['..frak..'] Водитель, снизьте скорость и прижмитесь к обочине или мы откроем огонь!')
    end
    if id ~= nil and not sampIsPlayerConnected(id) then
        ftext(string.format('Игрок с ID: %s не подключен к серверу', id), -1)
    end
    if result and not doesCharExist(ped) then
        local stname = sampGetPlayerNickname(id)
        ftext(string.format('Игрок %s[%s] не доступен', stname, id), -1)
    end
    if result and doesCharExist(ped) and not isCharInAnyCar(ped) then
        local stnaame = sampGetPlayerNickname(id)
        ftext(string.format('Игрок %s[%s] не в транспорте', stnaame, id), -1)
    end
    if result and doesCharExist(ped) and isCharInAnyCar(ped) then
        local vehName = getCarNamebyModel(getCarModel(storeCarCharIsInNoSave(ped)))
        sampSendChat("/m Водитель Т/C "..vehName.." с гос.номером [EVL"..id.."X], прижмитесь к обочине и остановите своё Т/С")
    end
end
function deject(pam)
    local id = tonumber(pam)
    if cfg.commands.deject == true then
        if cfg.main.male == true then
            if id == nil then
                ftext("Введите: /deject [id]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                local result, ped = sampGetCharHandleBySampPlayerId(id)
                if result then
                    if isCharInFlyingVehicle(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me открыл дверь вертолёта и вытащил "..sampGetPlayerNickname(id))
                            wait(1200)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInModel(ped, 481) or isCharInModel(ped, 510) then
                        lua_thread.create(function()
                            sampSendChat("/me скинул "..sampGetPlayerNickname(id).." с велосипеда")
                            wait(1200)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInModel(ped, 462) then
                        lua_thread.create(function()
                            sampSendChat("/me скинул "..sampGetPlayerNickname(id).." со скутера")
                            wait(1200)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharOnAnyBike(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me скинул "..sampGetPlayerNickname(id).." с мотоцикла")
                            wait(1200)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInAnyCar(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me разбил окно и вытолкнул "..sampGetPlayerNickname(id).." из машины")
                            wait(1200)
                            sampSendChat("/deject "..id)
                        end)
                    end
                end
            end
        end
        if cfg.main.male == false then
            if id == nil then
                ftext("Введите: /deject [id]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                local result, ped = sampGetCharHandleBySampPlayerId(id)
                if result then
                    if isCharInFlyingVehicle(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me открыла дверь вертолёта и вытащила "..sampGetPlayerNickname(id))
                            wait(1200)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInModel(ped, 481) or isCharInModel(ped, 510) then
                        lua_thread.create(function()
                            sampSendChat("/me скинула "..sampGetPlayerNickname(id).." с велосипеда")
                            wait(1200)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInModel(ped, 462) then
                        lua_thread.create(function()
                            sampSendChat("/me скинула "..sampGetPlayerNickname(id).." со скутера")
                            wait(1200)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharOnAnyBike(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me скинула "..sampGetPlayerNickname(id).." с мотоцикла")
                            wait(1200)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInAnyCar(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me разбила окно и вытолкнула "..sampGetPlayerNickname(id).." из машины")
                            wait(1200)
                            sampSendChat("/deject "..id)
                        end)
                    end
                end
            end
        end
    else
        if pam ~= nil then
            sampSendChat('/deject '..pam)
        else
            ftext("Введите: /deject [id]")
        end
    end
end
function rh(id)
    local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
    if id == "" or id < "1" or id > "3" or id == nil then
        ftext("Введите: /rh Департамент", -1)
        ftext("1 - LSPD | 2 - SFPD | 3 - LVPD", -1)
    elseif id == "1" then
        sampSendChat("/d LSPD, запрашиваю патрульный экипаж в "..kvadrat()..", как приняли? Ответ на пдж."..myid)
    elseif id == "2" then
        sampSendChat("/d SFPD, запрашиваю патрульный экипаж в "..kvadrat()..", как приняли? Ответ на пдж."..myid)
    elseif id == "3" then
        sampSendChat("/d LVPD, запрашиваю патрульный экипаж в "..kvadrat()..", как приняли? Ответ на пдж."..myid)
    end
end
function gr(pam)
    local dep, reason = pam:match('(%d+)%s+(.+)')
    if dep == nil or reason == nil then
        ftext("Введите: /gr [1-3] [Причина]")
        ftext("1 - LSPD | 2 - SFPD | 3 - LVPD")
    end
    if dep ~= nil then
        if dep == "" or dep < "1" or dep > "3" then
            ftext("{0C2265}FBI Tools {FFFFFF}| Введите: /gr [1-3] [Причина]")
            ftext("{0C2265}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD")
        elseif dep == "1" then
            sampSendChat("/d LSPD, пересекаю вашу юрисдикцию, "..reason)
        elseif dep == "2" then
            sampSendChat("/d SFPD, пересекаю вашу юрисдикцию, "..reason)
        elseif dep == "3" then
            sampSendChat("/d LVPD, пересекаю вашу юрисдикцию, "..reason)
        end
    end
end
function warn(pam)
    local id = tonumber(pam)
    if frak == 'FBI' then
        if id == nil then
            ftext('Введите /warn ID')
        end
        if id ~= nil and sampIsPlayerConnected(id) then
            lua_thread.create(function()
                warnst = true
                sampSendChat('/mdc '..id)
                wait(1200)
                if wfrac == 'LSPD' or wfrac == 'SFPD' or wfrac == 'LVPD' then
                    sampSendChat(string.format('/d %s, %s получает предупреждение за неправильную подачу в розыск.', wfrac, sampGetPlayerNickname(id):gsub('_', ' ')))
					wait(1200)
                    sampSendChat("/time")
                    wait(500)
                    setVirtualKeyDown(key.VK_F8, true)
                    wait(150)
                    setVirtualKeyDown(key.VK_F8, false)
                else
                    ftext('Человек не является сотрудником PD')
                end
                wfrac = nil
                warnst = false
            end)
        end
    else
        ftext("Вы не сотрудник ФБР")
    end
end
function ms(pam)
    local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
    if frak == 'FBI' then
        if cfg.main.male == true then
            if pam == "" or pam < "0" or pam > "3" or pam == nil then
                ftext("Введите: /ms [Тип]", -1)
                ftext("0 - Снять маскировку | 1 - Офис | 2 - Багажник | 3 - Сумка", -1)
            elseif pam == "1" then
                lua_thread.create(function()
                    sampSendChat("/me снял с себя костюм агента и повесил на вешалку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me открыл ящик, после чего достал комплект маскировки")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me надел на себя маскировку и закрыл ящик")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{0C2265}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "2" then
                lua_thread.create(function()
                    sampSendChat("/me открыл багажник автомобиля")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me снял с себя костюм агента и убрал в багажник")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me достал из багажника комплект маскировки и надел на себя")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me закрыл багажник")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{0C2265}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "3" then
                lua_thread.create(function()
                    sampSendChat("/do на плече агента висит сумка")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me открыв сумку, снял костюм агента и убрал туда")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me достал из сумки комплект маскировки и надел на себя")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me закрыл сумку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{0C2265}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "0" then
                lua_thread.create(function()
                    sampSendChat("/me снял с себя маскировку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me надел на себя костюм агента")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/r Переоделся в костюм агента")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end)
            end
        end
        if cfg.main.male == false then
            if pam == "" or pam < "0" or pam > "3" or pam == nil then
                ftext("Введите: /ms Тип", -1)
                ftext("0 - Снять маскировку | 1 - Офис | 2 - Багажник | 3 - Сумка", -1)
            elseif pam == "1" then
                lua_thread.create(function()
                    sampSendChat("/me сняла с себя костюм агента и повесила на вешалку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me открыла ящик, после чего достала комплект маскировки")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me надела на себя маскировку и закрыла ящик")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{0C2265}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "2" then
                lua_thread.create(function()
                    sampSendChat("/me открыла багажник автомобиля")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me сняла с себя костюм агента и убрала в багажник")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me достала из багажника комплект маскировки и надела на себя")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me закрыла багажник")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{0C2265}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "3" then
                lua_thread.create(function()
                    sampSendChat("/do на плече агента висит сумка")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me открыв сумку, сняла костюм агента и убрала туда")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me достала из сумки комплект маскировки и надела на себя")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me закрыла сумку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{0C2265}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "0" then
                lua_thread.create(function()
                    sampSendChat("/me сняла с себя маскировку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me надела на себя костюм агента")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/r Переоделась в костюм агента")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end)
            end
        end
    else
        ftext('Вы не сотрудник FBI')
    end
end

function ar(id)
    if id == "" or id < "1" or id > "2" or id == nil then
        ftext("Введите: /ar [1-2]", -1)
        ftext("1 - LVa | 2 - SFa", -1)
    elseif id == "1" then
        sampSendChat("/d LVa, разрешите въезд на вашу территорию, поимка преступника.")
    elseif id == "2" then
        sampSendChat("/d SFa, разрешите въезд на вашу территорию, поимка преступника.")
    end
end

function prs(pam)
    if #pam ~= 0 then
        if cfg.main.tarb then
            sampSendChat(string.format('/r [Прослушка телефона]: * %s *', pam))
        else
            sampSendChat(string.format('/r [Прослушка телефона]: * %s * ', pam))
        end
    else
        ftext('Введите /prs [текст]')
		ftext('Прослушка телефона: /prs [Текст]')
    end
end
function mrs(pam)
    if #pam ~= 0 then
        if cfg.main.tarb then
            sampSendChat(string.format('/r [Мини-передатчик]: * %s *', pam))
        else
            sampSendChat(string.format('/r [Мини-передатчик]: * %s *', pam))
        end
    else
        ftext('Введите /mrs [текст]')
		ftext('Текст передатчика: /mrs [Текст]')
    end
end
function mrs1(pam)
    if #pam ~= 0 then
        if cfg.main.tarb then
            sampSendChat(string.format('/r [Мини-передатчик]: *шепотом* %s ', pam))
        else
            sampSendChat(string.format('/r [Мини-передатчик]: *шепотом* %s ', pam))
        end
    else
        ftext('Введите /mrs1 [текст]')
		ftext('Текст шепотом: /mrs1 [Текст]')
    end
end
function setSymbolsBetweenNumbers(num, symbol)
  assert(type(num) == "number", "a not number value (1st argument)")
  assert(type(symbol) == "string", "a not string value (2nd argument)")
  return tostring(num):gsub("(%d)(%d)", "%1"..symbol.."%2"):gsub("(%d)(%d)", "%1"..symbol.."%2")
end
function mrs2(pam)
	local _, myid = sampGetPlayerIdByCharHandle(playerPed)
	local ide = (setSymbolsBetweenNumbers(myid, "-"))
    if #pam ~= 0 then
        if cfg.main.tarb then
            sampSendChat(string.format('/r *шум вертолёта* Борт номер '..ide..': %s ', pam))
			urh = getCharHeightAboveGround(PLAYER_PED)
			x1, x2 = math.modf(urh)
			sampSendChat('/b Ваша высота: '..x1)
        else
            sampSendChat(string.format('/r *шум вертолёта* Борт номер '..ide..': %s ', pam))
        end
    else
        ftext('Введите /mrs2 [текст]')
		ftext('Шум вертолёта: /mrs2 [Текст]')
    end
end
function ers(pam)
    if #pam ~= 0 then
        if cfg.main.tarb then
            sampSendChat(string.format('[Голос из-под маски]: %s', pam))
        else
            sampSendChat(string.format('[Голос из-под маски]: %s ', pam))
        end
    else
        ftext('Введите /e [текст]')
    end
end
function r(pam)
    if #pam ~= 0 then
        if cfg.main.tarb then
            sampSendChat(string.format('/r [%s]: %s', cfg.main.tar, pam))
        else
            sampSendChat(string.format('/r %s', pam))
        end
    else
        ftext('Введите /r [текст]')
    end
end
function f(pam)
    if #pam ~= 0 then
        if cfg.main.tarb then
            sampSendChat(string.format('/f [%s]: %s', cfg.main.tar, pam))
        else
            sampSendChat(string.format('/f %s', pam))
        end
    else
        ftext('Введите /f [текст]')
    end
end
function fthelp()
    lua_thread.create(function()
        submenus_show(fthelpsub, '{0C2265}FBI Tools {ffffff}| Help')
    end)
end
function fst(param)
    local hour = tonumber(param)
    if hour ~= nil and hour >= 0 and hour <= 23 then
        time = hour
        patch_samp_time_set(true)
        if time then
            setTimeOfDay(time, 0)
            ftext('Время изменено на: {0C2265}'..time, -1)
        end
    else
        ftext('Значение времени должно быть в диапазоне от 0 до 23.', -1)
        patch_samp_time_set(false)
        time = nil
    end
end

function fsw(param)
    local weather = tonumber(param)
    if weather ~= nil and weather >= 0 and weather <= 45 then
        forceWeatherNow(weather)
        ftext('Погода изменена на: {0C2265}'..weather, -1)
    else
        ftext('Значение погоды должно быть в диапазоне от 0 до 45.', -1)
    end
end

function patch_samp_time_set(enable)
    if enable and default == nil then
        default = readMemory(sampGetBase() + 0x9C0A0, 4, true)
        writeMemory(sampGetBase() + 0x9C0A0, 4, 0x000008C2, true)
    elseif enable == false and default ~= nil then
        writeMemory(sampGetBase() + 0x9C0A0, 4, default, true)
        default = nil
    end
end
------------
function fshp(pam)
    if #pam ~= 0 then
        local f = io.open('moonloader\\fbitools\\shp.txt')
        for line in f:lines() do
            if string.find(line, pam) or string.rlower(line):find(pam) or string.rupper(line):find(pam) then
                sampAddChatMessage(' '..line, -1)
            end
        end
        f:close()
    else
        ftext('Введите /fshp [текст]')
    end
end
function fyk(pam)
    if #pam ~= 0 then
        local f = io.open('moonloader\\fbitools\\yk.txt')
        for line in f:lines() do
            if string.find(line, pam) or string.rlower(line):find(pam) or string.rupper(line):find(pam) then
                sampAddChatMessage(' '..line, -1)
            end
        end
        f:close()
    else
        ftext('Введите /fyk [текст]')
    end
end
function fys(pam)
    if #pam ~= 0 then
        local f = io.open('moonloader\\fbitools\\ys.txt')
        for line in f:lines() do
            if string.find(line, pam) or string.rlower(line):find(pam) or string.rupper(line):find(pam) then
                sampAddChatMessage(' '..line, -1)
            end
        end
        f:close()
    else
        ftext('Введите /fys [текст]')
    end
end
function ffp(pam)
    if #pam ~= 0 then
        local f = io.open('moonloader\\fbitools\\fp.txt')
        for line in f:lines() do
            if string.find(line, pam) or string.rlower(line):find(pam) or string.rupper(line):find(pam) then
                sampAddChatMessage(' '..line, -1)
            end
        end
        f:close()
    else
        ftext('Введите /ffp [текст]')
    end
end

function fak(pam)
    if #pam ~= 0 then
        local f = io.open('moonloader\\fbitools\\ak.txt')
        for line in f:lines() do
            if string.find(line, pam) or string.rlower(line):find(pam) or string.rupper(line):find(pam) then
                sampAddChatMessage(' '..line, -1)
            end
        end
        f:close()
    else
        ftext('Введите /fak [текст]')
    end
end
players1 = {'{ffffff}Ник\t{ffffff}Ранг'}
players2 = {'{ffffff}Дата вступления | {ffffff}Ник\t{ffffff}Ранг\t{ffffff}Статус'}
function dmb()
	lua_thread.create(function()
		status = true
		sampSendChat('/members')
		while not gotovo do wait(0) end
		if gosmb then
			sampShowDialog(716, "{ffffff}В сети: "..gcount.." | {ae433d}Организация", table.concat(players2, "\n"), "x", _, 5) -- Показываем информацию.
		elseif krimemb then
			sampShowDialog(716, "{ffffff}В сети: "..gcount.." | {ae433d}Организация", table.concat(players1, "\n"), "x", _, 5) -- Показываем информацию.
		end
		gosmb = false
		krimemb = false
		gotovo = false
		status = false
		players2 = {'{ffffff}Дата вступления | {ffffff}Ник\t{ffffff}Ранг\t{ffffff}Статус'}
		players1 = {'{ffffff}Ник\t{ffffff}Ранг'}
		gcount = nil
	end)
end
function megaf()
    lua_thread.create(function()
        if isCharInAnyCar(playerPed) then
            local peds = getAllChars()
            local _, myvodil = sampGetPlayerIdByCharHandle(getDriverOfCar(storeCarCharIsInNoSave(playerPed)))
            if #peds ~= 0 then
                for _, hm in pairs(peds) do
                    local _ , megafid = sampGetPlayerIdByCharHandle(hm)
                    local _ , m = sampGetPlayerIdByCharHandle(PLAYER_PED)
                    if megafid ~= -1 and megafid ~= m and doesCharExist(hm) and sampIsPlayerConnected(megafid) then
                        local x, y, z = getCharCoordinates(hm)
                        local mx, my, mz = getCharCoordinates(PLAYER_PED)
                        local dist = getDistanceBetweenCoords3d(mx, my, mz, x, y, z)
                        local hskin = getCharModel(hm)
                        if dist <= 65 then
                            if isCharInAnyCar(hm) then
                                if getFraktionBySkin(megafid) ~= 'FBI' and getFraktionBySkin(megafid) ~= 'Полиция' then
                                    if storeCarCharIsInNoSave(hm) ~= storeCarCharIsInNoSave(playerPed) then
                                        local _, myvodil = sampGetPlayerIdByCharHandle(getDriverOfCar(storeCarCharIsInNoSave(hm)))
                                        if megafid == myvodil then
                                            local carh = storeCarCharIsInNoSave(hm)
                                            local nameofcar = getNameOfVehicleModel(getCarModel(carh))
                                            local _ , idofplayercar = sampGetPlayerIdByCharHandle(hm)
                                            sampSendChat(string.format("/m Водитель а/м %s с гос. номером [EVL%sX] прижмитесь к обочине", getCarNamebyModel(getCarModel(carh)), megafid), -1)
                                            wait(1200)
                                            sampSendChat('/m В противном случае нам придется открыть по вам огонь! ', -1)
											wait(300)
                                            sampAddChatMessage(' {ffffff}~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~', 0x0C2265)
											sampAddChatMessage('', 0x0C2265)
											sampAddChatMessage(' {ffffff}Ник: {0C2265}'..sampGetPlayerNickname(megafid)..'['..megafid..']', 0x0C2265)
											sampAddChatMessage(' {ffffff}Уровень: {0C2265}'..sampGetPlayerScore(megafid), 0x0C2265)
											sampAddChatMessage(' {ffffff}Фракция: {0C2265}'..getFraktionBySkin(megafid), 0x0C2265)
											sampAddChatMessage('', 0x0C2265)
                                            sampAddChatMessage(' {ffffff}~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~', 0x0C2265)
                                            gmegafid = megafid
                                            gmegaflvl = sampGetPlayerScore(megafid)
                                            gmegaffrak = getFraktionBySkin(megafid)
                                            break
                                        end
                                    end
                                end
                            end
						else
							ftext("Для объявления в мегафон о нарушении вам необходимо быть не более 65 метров от нарушителя.")
						end
					end
                end
            end
        else
            ftext("Вам необходимо сидеть в транспорте правоохранительных органов.")
        end
    end)
end
function dkll()
    lua_thread.create(function()
        if isCharInAnyCar(playerPed) then
            local peds = getAllChars()
            local _, myvodil = sampGetPlayerIdByCharHandle(getDriverOfCar(storeCarCharIsInNoSave(playerPed)))
            if #peds ~= 0 then
                for _, hm in pairs(peds) do
                    local _ , megafid = sampGetPlayerIdByCharHandle(hm)
                    local _ , m = sampGetPlayerIdByCharHandle(PLAYER_PED)
                    if megafid ~= -1 and megafid ~= m and doesCharExist(hm) and sampIsPlayerConnected(megafid) then
                        local x, y, z = getCharCoordinates(hm)
                        local mx, my, mz = getCharCoordinates(PLAYER_PED)
                        local dist = getDistanceBetweenCoords3d(mx, my, mz, x, y, z)
                        local hskin = getCharModel(hm)
                        if dist <= 65 then
                            if isCharInAnyCar(hm) then
                                if getFraktionBySkin(megafid) ~= 'FBI' and getFraktionBySkin(megafid) ~= 'Полиция' then
                                    if storeCarCharIsInNoSave(hm) ~= storeCarCharIsInNoSave(playerPed) then
                                        local _, myvodil = sampGetPlayerIdByCharHandle(getDriverOfCar(storeCarCharIsInNoSave(hm)))
                                        if megafid == myvodil then
                                            local carh = storeCarCharIsInNoSave(hm)
                                            local nameofcar = getNameOfVehicleModel(getCarModel(carh))
                                            local _ , idofplayercar = sampGetPlayerIdByCharHandle(hm)
											wait(500)
											--sampSendChat(string.format('/r ['..cfg.main.tar..']: Веду погоню в секторе %s за автомобилем %s гос. номер: EV%sRP', kvadrat(),getCarNamebyModel(getCarModel(carh)),megafid))
											[[repeat wait(0)
												if doesCharExist(hm) then
													local posX, posY, posZ = getCharCoordinates(hm)
													local pPosX, pPosY, pPosZ = getCharCoordinates(PLAYER_PED)
													local distance = getDistanceBetweenCoords2d(pPosX, pPosY, posX, posY)
													if distance <= 20000000 and isPointOnScreen(posX, posY, posZ, 0.0) then
														local wPosX, wPosY = convert3DCoordsToScreen(posX, posY, posZ)
														local wPosX1, wPosY1 = convert3DCoordsToScreen(pPosX, pPosY, pPosZ)
														renderDrawLine(wPosX1, wPosY1, wPosX, wPosY, 2, 0x90000000)
														renderDrawPolygon(wPosX, wPosY, 20, 20, 20, 0.0, 0x90000000)
													end
												end
											until false]]
											break
                                        end
                                    end
                                end
                            end
						end
						else
						ftext("Для объявления в мегафон о нарушении вам необходимо быть не более 65 метров от нарушителя.")
						wait(1000)
                    end
                end
            end
        else
            ftext("Вам необходимо сидеть в транспорте правоохранительных органов.")
        end
    end)
end
function dklld()
    lua_thread.create(function()
        if isCharInAnyCar(playerPed) then
            local peds = getAllChars()
            local _, myvodil = sampGetPlayerIdByCharHandle(getDriverOfCar(storeCarCharIsInNoSave(playerPed)))
            if #peds ~= 0 then
                for _, hm in pairs(peds) do
                    local _ , megafid = sampGetPlayerIdByCharHandle(hm)
                    local _ , m = sampGetPlayerIdByCharHandle(PLAYER_PED)
                    if megafid ~= -1 and megafid ~= m and doesCharExist(hm) and sampIsPlayerConnected(megafid) then
                        local x, y, z = getCharCoordinates(hm)
                        local mx, my, mz = getCharCoordinates(PLAYER_PED)
                        local dist = getDistanceBetweenCoords3d(mx, my, mz, x, y, z)
                        local hskin = getCharModel(hm)
                            if isCharInAnyCar(hm) then
                                    if storeCarCharIsInNoSave(hm) ~= storeCarCharIsInNoSave(playerPed) then
                                        local _, myvodil = sampGetPlayerIdByCharHandle(getDriverOfCar(storeCarCharIsInNoSave(hm)))
                                        if megafid == myvodil then
                                            local carh = storeCarCharIsInNoSave(hm)
                                            local nameofcar = getNameOfVehicleModel(getCarModel(carh))
                                            local _ , idofplayercar = sampGetPlayerIdByCharHandle(hm)
											wait(500)
											--sampSendChat(string.format('/r ['..cfg.main.tar..']: Веду погоню в секторе %s за автомобилем %s гос. номер: EV%sRP', kvadrat(),getCarNamebyModel(getCarModel(carh)),megafid))
											repeat wait(0)
												if doesCharExist(hm) then
													local posX, posY, posZ = getCharCoordinates(hm)
													local pPosX, pPosY, pPosZ = getCharCoordinates(PLAYER_PED)
													local distance = getDistanceBetweenCoords2d(pPosX, pPosY, posX, posY)
													if distance <= 20000000 and isPointOnScreen(posX, posY, posZ, 0.0) then
														local wPosX, wPosY = convert3DCoordsToScreen(posX, posY, posZ)
														local wPosX1, wPosY1 = convert3DCoordsToScreen(pPosX, pPosY, pPosZ)
														renderDrawLine(wPosX1, wPosY1, wPosX, wPosY, 2, 0x90000000)
														renderDrawPolygon(wPosX, wPosY, 20, 20, 20, 0.0, 0x90000000)
													end
												end
											until false
											break
                                        end
                                end
                            end
						end
                    end
                end
        else
            ftext("Вам необходимо сидеть в транспорте правоохранительных органов.")
        end
    end)
end
function ystp()
    lua_thread.create(function()
        if isCharInAnyCar(playerPed) then
            local peds = getAllChars()
            local _, myvodil = sampGetPlayerIdByCharHandle(getDriverOfCar(storeCarCharIsInNoSave(playerPed)))
            if #peds ~= 0 then
                for _, hm in pairs(peds) do
                    local _ , megafid = sampGetPlayerIdByCharHandle(hm)
                    local _ , m = sampGetPlayerIdByCharHandle(PLAYER_PED)
                    if megafid ~= -1 and megafid ~= m and doesCharExist(hm) and sampIsPlayerConnected(megafid) then
                        local x, y, z = getCharCoordinates(hm)
                        local mx, my, mz = getCharCoordinates(PLAYER_PED)
                        local dist = getDistanceBetweenCoords3d(mx, my, mz, x, y, z)
                        local hskin = getCharModel(hm)
                        if dist <= 65 then
                            if isCharInAnyCar(hm) then
                                if storeCarCharIsInNoSave(hm) ~= storeCarCharIsInNoSave(playerPed) then
                                    local _, myvodil = sampGetPlayerIdByCharHandle(getDriverOfCar(storeCarCharIsInNoSave(hm)))
                                    if megafid == myvodil then
                                        local carh = storeCarCharIsInNoSave(hm)
                                        local nameofcar = getNameOfVehicleModel(getCarModel(carh))
                                        local _ , idofplayercar = sampGetPlayerIdByCharHandle(hm)
										wait(500)
										sampSendChat(string.format('/m Водитель автомобиля %s с гос. номером: EV%sRP, уступите дорогу!', getCarNamebyModel(getCarModel(carh)),megafid))
										break
                                    end
                                end
                            end
						end
						else
							ftext("Для просьбы уступить дорогу, нужно быть в дистанции 65 метров от цели.")
							wait(1000)
						end
                    end
                end
        else
            ftext("Вам необходимо сидеть в транспорте правоохранительных органов.")
        end
    end)
end
function dkld()
    local tn = {}
    if isCharInAnyCar(PLAYER_PED) then
        if post ~= 7 and post ~= 12 and post ~= 13 and post ~= 14 and post ~= 18 and post ~= 21 and post ~= 22 and post ~= 23 and post ~= 24 and post ~= 25 and post ~= 26 and post ~= 27 and post ~= 28 and post ~= 29 and post ~= 30 and post ~= 31 then
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 5.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(tn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if frak == 'LSPD' then
                if not cfg.main.tarb  then
                    if #tn == 0 then
                    sampSendChat('/r Патруль г. Лос-Сантос. Напарников нет.')
                    elseif #tn == 1 then
                    sampSendChat('/r Патруль г. Лос-Сантос. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                    sampSendChat('/r Патруль г. Лос-Сантос. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                else
                    if #tn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лос-Сантос. Напарников нет.')
                    elseif #tn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лос-Сантос. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лос-Сантос. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                end
            elseif frak == 'SFPD' then
                if not cfg.main.tarb then
                    if #tn == 0 then
                        sampSendChat('/r Патруль г. Сан-Фиерро. Напарников нет.')
                    elseif #tn == 1 then
                        sampSendChat('/r Патруль г. Сан-Фиерро. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                        sampSendChat('/r Патруль г. Сан-Фиерро. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                else
                    if #tn == 0 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Сан-Фиерро. Напарников нет.')
                    elseif #tn == 1 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Сан-Фиерро. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Сан-Фиерро. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                end
            elseif frak == 'LVPD' then
                if not cfg.main.tarb then
                    if #tn == 0 then
                        sampSendChat('/r Патруль г. Лас-Вентурас. Напарников нет.')
                    elseif #tn == 1 then
                        sampSendChat('/r Патруль г. Лас-Вентурас. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                        sampSendChat('/r Патруль г. Лас-Вентурас. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                else
                    if #tn == 0 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лас-Вентурас. Напарников нет.')
                    elseif #tn == 1 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лас-Вентурас. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лас-Вентурас. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                end
            end
        end
        if post == 7 or post == 12 or post == 13 or post == 14 or post == 18 then
            local tn = {}
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 5.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(tn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if not cfg.main.tarb then
                if #tn == 0 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(tn, ", ")..'.')
                end
            else
                if #tn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(tn, ", ")..'.')
                end
            end
        end
        if post == 21 then
            local tn = {}
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 5.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(tn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if not cfg.main.tarb then
                if #tn == 0 then
                    sampSendChat('/r Патруль опасного района. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r Патруль опасного района. Напарник: '..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r Патруль опасного района. Напарники: '..table.concat(tn, ", ")..'.')
                end
            else
                if #tn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль опасного района. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль опасного района. Напарник: '..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль опасного района. Напарники: '..table.concat(tn, ", ")..'.')
                end
            end
        end
        if post == 22 then
            local tn = {}
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 5.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(tn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if cfg.main.tar == nil then
                if #tn == 0 then
                    sampSendChat('/r Патруль ЛВа. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r Патруль ЛВа. Напарник: '..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r Патруль ЛВа. Напарники: '..table.concat(tn, ", ")..'.')
                end
            else
                if #tn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль ЛВа. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль ЛВа. Напарник: '..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль ЛВа. Напарники: '..table.concat(tn, ", ")..'.')
                end
            end
        end
        lua_thread.create(function()
            if post == 23 then
                if frak == 'LSPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    submenus_show(yrisdkld1404, '{0C2265}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 24 then
                if frak == 'LSPD' then
                    sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    submenus_show(yrisdkld1405, '{0C2265}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 25 then
                if frak == 'LSPD' then
                    sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    submenus_show(yrisdkld1405, '{0C2265}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 26 then
                if frak == 'LSPD' then
                    sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    submenus_show(yrisdkld1405, '{0C2265}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 27 then
                if frak == 'LVPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LSPD' then
                    submenus_show(yrisdkld1406, '{0C2265}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 28 then
                if frak == 'LVPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LSPD' then
                    submenus_show(yrisdkld1406, '{0C2265}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 29 then
                if frak == 'LSPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    submenus_show(yrisdkld1404, '{0C2265}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 30 then
                if frak == 'LSPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    submenus_show(yrisdkld1404, '{0C2265}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 31 then
                if frak == 'LSPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    submenus_show(yrisdkld1404, '{0C2265}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
        end)
    end
    if not isCharInAnyCar(PLAYER_PED) then
        if post ~= nil and post ~= 8 then
            local pn = {}
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 20.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(pn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if not cfg.main.tarb then
                if #pn == 0 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #pn == 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(pn, ", ")..'.')
                elseif #pn > 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(pn, ", ")..'.')
                end
            else
                if #pn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #pn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(pn, ", ")..'.')
                elseif #pn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(pn, ", ")..'.')
                end
            end
        end
        if post == 8 then
            local pn = {}
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 50.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(pn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if not cfg.main.tarb then
                if #pn == 0 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #pn == 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(pn, ", ")..'.')
                elseif #pn > 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(pn, ", ")..'.')
                end
            else
                if #pn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #pn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(pn, ", ")..'.')
                elseif #pn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(pn, ", ")..'.')
                end
            end
        end
    end
end

function kmdc(args)
    pID = tonumber(args)
    if cfg.main.male then
        if pID ~= nil then
            if sampIsPlayerConnected(pID) then
                lua_thread.create(function()
                    sampSendChat("/me достал КПК и сделал фотографию человека")
                    wait(2000)
                    sampSendChat("/do КПК дал информацию: Имя: "..sampGetPlayerNickname(pID):gsub('_', ' ')..".")
                    wait(2000)
                    sampSendChat("/mdc "..args)
                    wait(1500)
                    sampSendChat("/time")
                    wait(500)
                    setVirtualKeyDown(key.VK_F8, true)
                    wait(150)
                    setVirtualKeyDown(key.VK_F8, false)
                end)
            else
                ftext("Игрок с ID: "..args.." не подключен к серверу", -1)
            end
       else
            ftext("Введите: /kmdc ID", -1)
       end
    else
        if pID ~= nil then
            if sampIsPlayerConnected(pID) then
                lua_thread.create(function()
                    sampSendChat("/me достала КПК и сделала фотографию человека")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do КПК дал информацию: Имя: "..sampGetPlayerNickname(pID):gsub('_', ' ')..".")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/mdc "..args)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/time")
                    wait(500)
                    setVirtualKeyDown(key.VK_F8, true)
                    wait(150)
                    setVirtualKeyDown(key.VK_F8, false)
                end)
            else
                ftext("Игрок с ID: "..args.." не подключен к серверу", -1)
            end
        else
            ftext("Введите: /kmdc ID", -1)
        end
    end
end
function ftazer(id)
    if cfg.commands.ftazer then
        if cfg.main.male == true then
            if id == "" or id < "1" or id > "3" or id == nil then
                ftext("Введите: /ftazer [1-3]")
                ftext("1 - Всех | 2 - Гос.Сотрудников | 3 - Гражданских")
            elseif id == "1" then
                lua_thread.create(function()
				    sampSendChat("/me надел беруши и зажмурился")
                    wait(1200)
                    sampSendChat("/me бросил светошумовую гранату")
                    wait(1200)
                    sampSendChat("/ftazer 1", -1)
                end)
            elseif id == "2" then
                lua_thread.create(function()
					sampSendChat("/me надел беруши и зажмурился")
                    wait(1200)
                    sampSendChat("/me бросил светошумовую гранату")
                    wait(1200)
                    sampSendChat("/ftazer 2", -1)
                end)
            elseif id == "3" then
                lua_thread.create(function()
					sampSendChat("/me надел беруши и зажмурился")
                    wait(1200)
                    sampSendChat("/me бросил светошумовую гранату")
                    wait(1200)
                    sampSendChat("/ftazer 3", -1)
                end)
            end
        end
        if cfg.main.male == false then
            if id == "" or id < "1" or id > "3" or id == nil then
                ftext("Введите: /ftzer [1-3]")
                ftext("1 - Всех | 2 - Гос.Сотрудников | 3 - Гражданских")
            elseif id == "1" then
                lua_thread.create(function()
                    sampSendChat("/me достала из внутреннего кармана беруши")
                    wait(1500)
                    sampSendChat("/me надела беруши и зажмурилась")
                    wait(1500)
                    sampSendChat("/me бросила светошумовую гранату")
                    wait(1500)
                    sampSendChat("/ftazer 1", -1)
                end)
            elseif id == "2" then
                lua_thread.create(function()
                    sampSendChat("/me достала из внутреннего кармана беруши")
                    wait(1500)
                    sampSendChat("/me надела беруши и зажмурилась")
                    wait(1500)
                    sampSendChat("/me бросила светошумовую гранату")
                    wait(1500)
                    sampSendChat("/ftazer 2", -1)
                end)
            elseif id == "3" then
                lua_thread.create(function()
                    sampSendChat("/me достала из внутреннего кармана беруши")
                    wait(1500)
                    sampSendChat("/me надела беруши и зажмурилась")
                    wait(1500)
                    sampSendChat("/me бросила светошумовую гранату")
                    wait(1500)
                    sampSendChat("/ftazer 3", -1)
                end)
            end
        end
    else
        local ftazerid = tonumber(id)
        if ftazerid ~= nil then
            sampSendChat('/ftazer '..ftazerid)
        else
            ftext("Введите: /ftzer [1-3]")
            ftext("1 - Всех | 2 - Гос.Сотрудников | 3 - Гражданских")
        end
    end
end
function fvz(pam)
    local id = tonumber(pam)
    local _, myid = sampGetPlayerIdByCharHandle(playerPed)
    if frak == 'FBI' then
        if id == nil then
            ftext("Введите: /fvz [id]")
        end
        if id ~= nil and sampIsPlayerConnected(id) then
            lua_thread.create(function()
                warnst = true
                sampSendChat('/mdc '..id)
                wait(1200)
                if wfrac == 'LSPD' or wfrac == 'SFPD' or wfrac == 'LVPD' or wfrac == 'LVa' or wfrac == 'SFa' then
                    sampSendChat(string.format('/d %s, %s, явитесь в офис ФБР со старшими. Как приняли? Ответ на пдж.%s', wfrac, sampGetPlayerNickname(id):gsub('_', ' '), myid))
                else
                    ftext('Человек не является сотрудником PD/Army')
                end
                warnst = false
                wfrac = nil
            end)
        end
    else
        ftext("Вы не сотрудник ФБР")
    end
end
function fbd(pam)
    local id = tonumber(pam)
    if frak == 'FBI' then
        if id == nil then
            ftext("Введите: /fbd [id]")
        end
        if id ~= nil and sampIsPlayerConnected(id) then
            lua_thread.create(function()
                local _, myid = sampGetPlayerIdByCharHandle(playerPed)
                warnst = true
                sampSendChat('/mdc '..id)
                wait(1200)
                if wfrac == 'LSPD' or wfrac == 'SFPD' or wfrac == 'LVPD' then
                    sampSendChat(string.format('/d %s, %s, Причина изменения БД на п.%s', wfrac, sampGetPlayerNickname(id):gsub('_', ' '), myid))
                else
                    ftext('Человек не является сотрудником PD')
                end
                warnst = false
                wfrac = nil
            end)
        end
    else
        ftext("Вы не сотрудник ФБР")
    end
end
function cc()
    local memory = require "memory"
    memory.fill(sampGetChatInfoPtr() + 306, 0x0, 25200)
    memory.write(sampGetChatInfoPtr() + 306, 25562, 4, 0x0)
    memory.write(sampGetChatInfoPtr() + 0x63DA, 1, 1)
end
function blg(pam)
    local id, frack, pric = pam:match('(%d+) (%a+) (.+)')
    if id and frack and pric and sampIsPlayerConnected(id) then
        name = sampGetPlayerNickname(id)
        rpname = name:gsub('_', ' ')
        sampSendChat(string.format("/d %s, благодарю %s за %s. Цените.", frack, rpname, pric))
    else
        ftext("Введите: /blg [id] [Фракция] [За что. За-]", -1)
    end
end
function zbr(pam)
    local id, frack = pam:match('(%d+) (%a+)')
    if id and frack and sampIsPlayerConnected(id) then
        name = sampGetPlayerNickname(id)
        rpname = name:gsub('_', ' ')
        sampSendChat(string.format("/d %s, забрал у вас %s. Не теряйте.", frack, rpname))
    else
        ftext("Введите: /zbr [id] [Фракция]", -1)
    end
end
function df()
    lua_thread.create(function()
        submenus_show(dfmenu, "{0C2265}FBI Tools {ffffff}| Bomb Menu")
    end)
end
function mcheck()
    peds = getAllChars()
    if peds ~= nil then
        local openw = io.open("moonloader/fbitools/mcheck.txt", 'a')
        openw:write('\n')
        openw:write(os.date()..'\n')
        openw:close()
        lua_thread.create(function()
            for _, hm in pairs(peds) do
                _ , id = sampGetPlayerIdByCharHandle(hm)
                _ , m = sampGetPlayerIdByCharHandle(PLAYER_PED)
                if id ~= -1 and id ~= m and doesCharExist(hm) and sampIsPlayerConnected(id) then
                    local x, y, z = getCharCoordinates(hm)
                    local mx, my, mz = getCharCoordinates(PLAYER_PED)
                    local dist = getDistanceBetweenCoords3d(mx, my, mz, x, y, z)
                    if dist <= 200 then
                        mcheckb = true
                        _ , idofplayercar = sampGetPlayerIdByCharHandle(hm)
                        sampSendChat('/mdc '..idofplayercar)
                        wait(1200)
                        mcheckb = false
                    end
                end
            end
        end)
    end
end
function getcode(pam)
	if #pam == 0 then
		ftext('Вы выключили получение кодов')
		getcode = false
	end
	if #pam == 1 then
		ftext('Вы включили получение кодов')
		getcode = true
	end
end
function dlog()
    sampShowDialog(97987, '{0C2265}FBI Tools {ffffff} | Лог сообщений департамента', table.concat(departament, '\n'), '»', 'x', 0)
end
function rlog()
    sampShowDialog(97987, '{0C2265}FBI Tools {ffffff} | Лог сообщений рации', table.concat(radio, '\n'), '»', 'x', 0)
end
function sulog()
    sampShowDialog(97987, '{0C2265}FBI Tools {ffffff} | Лог выдачи розыска', table.concat(wanted, '\n'), '»', 'x', 0)
end
function smslog()
    sampShowDialog(97987, '{0C2265}FBI Tools {ffffff} | Лог SMS', table.concat(sms, '\n'), '»', 'x', 0)
end
function members()
	sampSendChat("/members")
end
function ticket(pam)
    lua_thread.create(function()
        local id, summa, reason = pam:match('(%d+) (%d+) (.+)')
        if id and summa and reason then
            if cfg.commands.ticket then
                sampSendChat(string.format("/me %s бланк и ручку", cfg.main.male and 'достал' or 'достала'))
                wait(cfg.commands.zaderjka)
                sampSendChat("/do бланк и ручка в руках")
                wait(cfg.commands.zaderjka)
                sampSendChat("/me начинает заполнять бланк")
                wait(cfg.commands.zaderjka)
                sampSendChat("/do бланк заполнен")
                wait(cfg.commands.zaderjka)
                sampSendChat(string.format("/me %s бланк нарушителю", cfg.main.male and 'передал' or 'передала'))
                wait(1200)
            end
            sampSendChat(string.format('/ticket %s %s %s', id, summa, reason))
        else
            ftext('Введите: /ticket [id] [сумма] [причина]')
        end
    end)
end
function udost(pam)
    pID = tonumber(pam)
	if pID ~= nil then
		if pID ~= (myid) then
			if sampIsPlayerConnected(pID) then
				lua_thread.create(function()
					local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
					local myname = sampGetPlayerNickname(myid)
					sampSendChat(string.format("Приветствую. Агент ФБР %s.", myname:gsub('_', ' ')))
					wait(3000)
					sampSendChat("/me достал удостоверение из внутреннего кармана")
					wait(2000)
					sampSendChat(string.format("/showudost %s", pID))
				end)
			else
				ftext("Игрок с ID: "..pID.." не подключен к серверу")
			end
		else
			ftext("Вы указали свой ID.")
		end
	else
		ftext("Введите: /ud [id]")
	end
end
function clearg(pam)
    if pam == "" or pam < "0" and pam ~= "31" and pam ~= "29" and pam ~= "24" and pam ~= "33" and pam ~= "25" and pam ~="46" or pam == nil then
        ftext("Введите: /cg [Тип]", -1)
        ftext("0 - убрать у себя все оружие. 31, 24, 30 - на выбор.", -1)
	elseif pam == "0" then
		lua_thread.create(function()
			removeAllCharWeapons(PLAYER_PED)
			ftext("Вы удалили себе всё оружие.", -1)
		end)
	elseif pam == "31" then
		lua_thread.create(function()
			removeWeaponFromChar(PLAYER_PED, 31)
			ftext("Вы удалили себе M4.")
		end)
	elseif pam == "46" then
		lua_thread.create(function()
			removeWeaponFromChar(PLAYER_PED, 46)
			ftext("Вы удалили себе Парашют.")
		end)
	elseif pam == "29" then
		lua_thread.create(function()
			removeWeaponFromChar(PLAYER_PED, 29)
			ftext("Вы удалили себе MP5.")
		end)
	elseif pam == "24" then
		lua_thread.create(function()
			removeWeaponFromChar(PLAYER_PED, 24)
			ftext("Вы удалили себе Desert Eagle.")
		end)
	elseif pam == "33" then
		lua_thread.create(function()
			removeWeaponFromChar(PLAYER_PED, 33)
			ftext("Вы удалили себе Rifle.")
		end)
	elseif pam == "25" then
		lua_thread.create(function()
			removeWeaponFromChar(PLAYER_PED, 25)
			ftext("Вы удалили себе Shotgun.")
		end)
	else
		ftext("Вы ввели неверный ID оружия.")
	end
end
function ooplist(pam)
    lua_thread.create(function()
        local oopid = tonumber(pam)
        if oopid ~= nil and sampIsPlayerConnected(oopid) then
            for k, v in pairs(ooplistt) do
                sampSendChat('/sms '..oopid..' '..v)
                wait(1200)
            end
        else
            sampShowDialog(2458, '{0C2265}FBI Tools | {ffffff}Список ООП', table.concat(ooplistt, '\n'), '»', "x", 2)
            ftext('Для отправки списка ООП адвокату введите /ooplist [id]')
        end
    end)
end
function rt(pam)
    if #pam == 0 then
        ftext("Введите /rt [текст]")
    else
        sampSendChat('/r '..pam)
    end
end
function fkv(pam)
    if #pam ~= 0 then
        kvadY, kvadX = string.match(pam, "(%A)-(%d+)")
        if kvadrat(kvadY) ~= nil and kvadX ~= nil and kvadY ~= nil and tonumber(kvadX) < 25 and tonumber(kvadX) > 0 then
            last = lcs
            coordX = kvadX * 250 - 3125
            coordY = (kvadrat1(kvadY) * 250 - 3125) * - 1
        end
    else
        ftext('Введите: /fkv [квадрат]')
        ftext('Предыдущая метка удалена')
		removeWaypoint()
    end
end
function ttest5(pam)
    lua_thread.create(function()
            local peds = getAllChars()
            if #peds ~= 0 then
				if #pam == 0 then
					if playerMarker ~= nil then
						removeBlip(playerMarker)
						playerMarker = nil
						playerMarkerId = nil
						ftext('Маркер успешно убран')
					return
					end
					ftext('Введите: /ttest5 [id]')
				return
				end
				local id = tonumber(pam)
				if id == nil then ftext('Игрок оффлайн!') return end
				if not sampIsPlayerConnected(id) then ftext('Игрок оффлайн!') return end
				local result, ped = sampGetCharHandleBySampPlayerId(id)
				if not result then ftext('Игрок должен быть в зоне прорисовки') return end   
				if playerMarker ~= nil then
					removeBlip(playerMarker)
					playerMarkerId = nil
				end
				playerMarkerId = id
				playerMarker = addBlipForChar(ped)
				local px, py, pz = getCharCoordinates(ped)
				repeat wait(0)
					if doesCharExist(ped) then
						local posX, posY, posZ = getCharCoordinates(ped)
						local pPosX, pPosY, pPosZ = getCharCoordinates(PLAYER_PED)
						local distance = getDistanceBetweenCoords2d(pPosX, pPosY, posX, posY)
						if distance <= 200000000 and distance >= 3 then
							if isPointOnScreen(posX, posY, posZ, 0.0) then
								local wPosX, wPosY = convert3DCoordsToScreen(posX, posY, posZ)
								local wPosX1, wPosY1 = convert3DCoordsToScreen(pPosX, pPosY, pPosZ)
								renderDrawLine(wPosX1, wPosY1, wPosX, wPosY, 2, 0xFFEE0000)
								renderDrawPolygon(wPosX, wPosY, 10, 10, 14, 0.0, 0xFFEE0000)
								changeBlipColour(playerMarker, 0x0C2265)
							end
						else
							removeBlip(playerMarker)
							playerMarker = nil
							playerMarkerId = nil
							ftext('Вы достигли цели.')
						return
						end
					end
				until false
				ftext(('Маркер установлен на игрока %s[%d]'):format(sampGetPlayerNickname(id), id))
				ftext('Чтобы убрать маркер, введите команду /ttest5 ещё раз')
			end
	end)
end
function ttest()
	text, prefix, color, pcolor = sampGetChatString(99)
	ftext('Color: '..color)
	ftext('Int color: '..pcolor)
end
function ttest2()
	lua_thread.create(function()
	sampSendClickTextdraw(2168)
	wait(200)
	sampSendClickTextdraw(2172)
	wait(200)
	sampSendClickTextdraw(2171)
	wait(200)
	sampSendClickTextdraw(2169)
	wait(200)
	sampSendClickTextdraw(2170)
	end)
end
function ttest3()
	local nearcar, nearped = storeClosestEntities(PLAYER_PED)
	if isCharInAnyCar(nearped) then
		if nearped ~= -1 then
			local nub, nn = getNumberOfPassengers(veh)
			local veh = storeCarCharIsInNoSave(nearped)
			local x, y, z = getCharCoordinates(nearped)
			local hisid = getDriverOfCar(nearcar)
			local mx, my, mz = getCharCoordinates(PLAYER_PED)
			local dist = getDistanceBetweenCoords3d(mx, my, mz, x, y, z)
			if dist <= 3 then
				sampSendChat('/deject '..hisid)
			else
				ftext('Вам нужно быть ближе чем 3 метра.')
			end
		else
			ftext('Рядом с вами никого нет.')
		end
	else
		ftext('Игрок не в машине.')
	end
end
function ttest1(pam)
	if pam == "" or pam < "0" and pam ~= "1" or pam == nil then
        ftext("Введите: /ttest1 [Тип]", -1)
        ftext("0 - выкл прос. 1 - вкл прос.", -1)
		check = false
	elseif pam == "0" then
		check = false
		ftext("Вы выключили прос", -1)
	elseif pam == "1" then
		check = true
		ftext("Вы включили прос.")
	else
		ftext("Вы ввели неверный ID оружия.")
		check = false
	end
end
function getpos()
	local res = locateCharInCarChar3d(PLAYER_PED, PLAYER_PED, 6, 6, 6, true)
	ftext('near car on you: '..res)
end
function direction()
    if sampIsLocalPlayerSpawned() then
        local angel = math.ceil(getCharHeading(PLAYER_PED))
        if angel then
            if (angel >= 0 and angel <= 30) or (angel <= 360 and angel >= 330) then
                return "Север"
            elseif (angel > 80 and angel < 100) then
                    return "Запад"
            elseif (angel > 260 and angel < 280) then
                    return "Восток"
            elseif (angel >= 170 and angel <= 190) then
                    return "Юг"
            elseif (angel >= 31 and angel <= 79) then
                    return "Северо-запад"
            elseif (angel >= 191 and angel <= 259) then
                    return "Юго-восток"
            elseif (angel >= 81 and angel <= 169) then
                    return "Юго-запад"
            elseif (angel >= 259 and angel <= 329) then
                    return "Северо-восток"
            else
                return angel
            end
        else
            return "Неизвестно"
        end
    else
        return "Неизвестно"
    end
end
function warehouse()
	sampSendChat('/warehouse')
end
function upd_locals()
    while true do wait(100)
        hfps = math.floor(mem.getfloat(0xB7CB50, 4, false))
    end
end
function dateToWeekNumber(date)
  local wsplit = string.split(date, ".")
  local day = tonumber(wsplit[1])
  local month = tonumber(wsplit[2])
  local year = tonumber(wsplit[3])
  local a = math.floor((14 - month) / 12)
  local y = year - a
  local m = month + 12 * a - 2
  return math.floor((day + y + math.floor(y / 4) - math.floor(y / 100) + math.floor(y / 400) + (31 * m) / 12) % 7)
end

function secToTime(sec)
  local hour, minute, second = sec / 3600, math.floor(sec / 60), sec % 60
  return string.format("%02d:%02d:%02d", math.floor(hour) ,  minute - (math.floor(hour) * 60), second)
end

function _secToTime(sec)
  sec = tonumber(sec)
  if sec == nil then return end
  local result = ""
  local hour, minute, second = sec / 3600, math.floor(sec / 60), sec % 60
  hour = math.floor(hour)
  minute = minute - (math.floor(hour) * 60)
  if hour > 0 then result = string.format("%02d", hour) end
  if minute > 0 and hour == 0 then result = string.format("%02d", minute)
  elseif minute > 0 and hour > 0 then result = result..string.format(":%02d", minute) end
  if result ~= "" then result = result..string.format(":%02d", second)
  else result = string.format("%d секунд", second) end
  return result
end
function sampGetPlayerIdByNickname(nick)
    local _, myid = sampGetPlayerIdByCharHandle(playerPed)
    if tostring(nick) == sampGetPlayerNickname(myid) then return myid end
    for i = 0, 1000 do if sampIsPlayerConnected(i) and sampGetPlayerNickname(i) == tostring(nick) then return i end end
end